; ModuleID = './bcfiles/Dhcp6Io.bc'
source_filename = "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main/NetworkPkg/Dhcp6Dxe/Dhcp6Io.c"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-windows-gnu"


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !48, globals: !973, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main/NetworkPkg/Dhcp6Dxe/Dhcp6Io.c", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main/Build/OvmfX64/NOOPT_CLANGPDB/X64/NetworkPkg/Dhcp6Dxe/Dhcp6Dxe", checksumkind: CSK_MD5, checksum: "bc6b8c7107400f2a41f355021beebbbc")
!2 = !{!3, !15, !23, !35}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 25, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "MdePkg/Include/Protocol/Ip6Config.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "cf53dacaa7608aee8b6a25df27792029")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14}
!7 = !DIEnumerator(name: "Ip6ConfigDataTypeInterfaceInfo", value: 0)
!8 = !DIEnumerator(name: "Ip6ConfigDataTypeAltInterfaceId", value: 1)
!9 = !DIEnumerator(name: "Ip6ConfigDataTypePolicy", value: 2)
!10 = !DIEnumerator(name: "Ip6ConfigDataTypeDupAddrDetectTransmits", value: 3)
!11 = !DIEnumerator(name: "Ip6ConfigDataTypeManualAddress", value: 4)
!12 = !DIEnumerator(name: "Ip6ConfigDataTypeGateway", value: 5)
!13 = !DIEnumerator(name: "Ip6ConfigDataTypeDnsServer", value: 6)
!14 = !DIEnumerator(name: "Ip6ConfigDataTypeMaximum", value: 7)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 249, baseType: !5, size: 32, elements: !17)
!16 = !DIFile(filename: "MdePkg/Include/Protocol/Ip6.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "03feec77f7ef20187070a3208a9b2779")
!17 = !{!18, !19, !20, !21, !22}
!18 = !DIEnumerator(name: "EfiNeighborInComplete", value: 0)
!19 = !DIEnumerator(name: "EfiNeighborReachable", value: 1)
!20 = !DIEnumerator(name: "EfiNeighborStale", value: 2)
!21 = !DIEnumerator(name: "EfiNeighborDelay", value: 3)
!22 = !DIEnumerator(name: "EfiNeighborProbe", value: 4)
!23 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !24, line: 28, baseType: !5, size: 32, elements: !25)
!24 = !DIFile(filename: "MdePkg/Include/Protocol/Dhcp6.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "bf699e189e28cf80226db9221bce0cd8")
!25 = !{!26, !27, !28, !29, !30, !31, !32, !33, !34}
!26 = !DIEnumerator(name: "Dhcp6Init", value: 0)
!27 = !DIEnumerator(name: "Dhcp6Selecting", value: 1)
!28 = !DIEnumerator(name: "Dhcp6Requesting", value: 2)
!29 = !DIEnumerator(name: "Dhcp6Declining", value: 3)
!30 = !DIEnumerator(name: "Dhcp6Confirming", value: 4)
!31 = !DIEnumerator(name: "Dhcp6Releasing", value: 5)
!32 = !DIEnumerator(name: "Dhcp6Bound", value: 6)
!33 = !DIEnumerator(name: "Dhcp6Renewing", value: 7)
!34 = !DIEnumerator(name: "Dhcp6Rebinding", value: 8)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !24, line: 76, baseType: !5, size: 32, elements: !36)
!36 = !{!37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47}
!37 = !DIEnumerator(name: "Dhcp6SendSolicit", value: 0)
!38 = !DIEnumerator(name: "Dhcp6RcvdAdvertise", value: 1)
!39 = !DIEnumerator(name: "Dhcp6SelectAdvertise", value: 2)
!40 = !DIEnumerator(name: "Dhcp6SendRequest", value: 3)
!41 = !DIEnumerator(name: "Dhcp6RcvdReply", value: 4)
!42 = !DIEnumerator(name: "Dhcp6RcvdReconfigure", value: 5)
!43 = !DIEnumerator(name: "Dhcp6SendDecline", value: 6)
!44 = !DIEnumerator(name: "Dhcp6SendConfirm", value: 7)
!45 = !DIEnumerator(name: "Dhcp6SendRelease", value: 8)
!46 = !DIEnumerator(name: "Dhcp6EnterRenewing", value: 9)
!47 = !DIEnumerator(name: "Dhcp6EnterRebinding", value: 10)
!48 = !{!49, !50, !53, !58, !110, !55, !113, !241, !107, !106, !244, !245, !71, !140, !248, !73, !942}
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "BOOLEAN", file: !51, line: 192, baseType: !52)
!51 = !DIFile(filename: "MdePkg/Include/X64/ProcessorBind.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "ef2524a221fe61206fa09ec88dd4f59b")
!52 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "RETURN_STATUS", file: !54, line: 1026, baseType: !55)
!54 = !DIFile(filename: "MdePkg/Include/Base.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "0c11ea3d1992443d8a8f590a064e50ff")
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINTN", file: !51, line: 211, baseType: !56)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT64", file: !51, line: 162, baseType: !57)
!57 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "DHCP6_TX_CB", file: !60, line: 37, baseType: !61)
!60 = !DIFile(filename: "NetworkPkg/Dhcp6Dxe/Dhcp6Impl.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "57e414e2fcd67f07078634f014dc3756")
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DHCP6_TX_CB", file: !60, line: 79, size: 640, elements: !62)
!62 = !{!63, !70, !72, !93, !101, !102, !103, !104, !105, !109}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "Link", scope: !61, file: !60, line: 80, baseType: !64, size: 128)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "LIST_ENTRY", file: !54, line: 242, baseType: !65)
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_LIST_ENTRY", file: !54, line: 247, size: 128, elements: !66)
!66 = !{!67, !69}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "ForwardLink", scope: !65, file: !54, line: 248, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "BackLink", scope: !65, file: !54, line: 249, baseType: !68, size: 64, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "Xid", scope: !61, file: !60, line: 81, baseType: !71, size: 32, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT32", file: !51, line: 170, baseType: !5)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "TxPacket", scope: !61, file: !60, line: 82, baseType: !73, size: 64, offset: 192)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP6_PACKET", file: !24, line: 201, baseType: !75)
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_DHCP6_PACKET", file: !24, line: 181, size: 104, elements: !76)
!76 = !{!77, !78, !79, !92}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !75, file: !24, line: 185, baseType: !71, size: 32)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !75, file: !24, line: 190, baseType: !71, size: 32, offset: 32)
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !75, file: !24, line: 191, size: 40, elements: !80)
!80 = !{!81, !87}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "Header", scope: !79, file: !24, line: 195, baseType: !82, size: 32)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP6_HEADER", file: !24, line: 175, baseType: !83)
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_DHCP6_HEADER", file: !24, line: 166, size: 32, elements: !84)
!84 = !{!85, !86}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "MessageType", scope: !83, file: !24, line: 170, baseType: !71, size: 8, flags: DIFlagBitField, extraData: i64 0)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "TransactionId", scope: !83, file: !24, line: 174, baseType: !71, size: 24, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "Option", scope: !79, file: !24, line: 199, baseType: !88, size: 8, offset: 32)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 8, elements: !90)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT8", file: !51, line: 196, baseType: !52)
!90 = !{!91}
!91 = !DISubrange(count: 1)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "Dhcp6", scope: !75, file: !24, line: 200, baseType: !79, size: 40, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "RetryCtl", scope: !61, file: !60, line: 83, baseType: !94, size: 128, offset: 256)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP6_RETRANSMISSION", file: !24, line: 238, baseType: !95)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_DHCP6_RETRANSMISSION", file: !24, line: 216, size: 128, elements: !96)
!96 = !{!97, !98, !99, !100}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "Irt", scope: !95, file: !24, line: 220, baseType: !71, size: 32)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "Mrc", scope: !95, file: !24, line: 225, baseType: !71, size: 32, offset: 32)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "Mrt", scope: !95, file: !24, line: 231, baseType: !71, size: 32, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "Mrd", scope: !95, file: !24, line: 237, baseType: !71, size: 32, offset: 96)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "RetryCnt", scope: !61, file: !60, line: 84, baseType: !71, size: 32, offset: 384)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "RetryExp", scope: !61, file: !60, line: 85, baseType: !71, size: 32, offset: 416)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "RetryLos", scope: !61, file: !60, line: 86, baseType: !71, size: 32, offset: 448)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "TickTime", scope: !61, file: !60, line: 87, baseType: !71, size: 32, offset: 480)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "Elapsed", scope: !61, file: !60, line: 88, baseType: !106, size: 64, offset: 512)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT16", file: !51, line: 178, baseType: !108)
!108 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "SolicitRetry", scope: !61, file: !60, line: 89, baseType: !50, size: 8, offset: 576)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHAR8", file: !51, line: 200, baseType: !112)
!112 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "DHCP6_INF_CB", file: !60, line: 36, baseType: !115)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DHCP6_INF_CB", file: !60, line: 95, size: 384, elements: !116)
!116 = !{!117, !118, !119, !242, !243}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "Link", scope: !115, file: !60, line: 96, baseType: !64, size: 128)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "Xid", scope: !115, file: !60, line: 97, baseType: !71, size: 32, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "ReplyCallback", scope: !115, file: !60, line: 98, baseType: !120, size: 64, offset: 192)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP6_INFO_CALLBACK", file: !24, line: 397, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{!124, !126, !49, !73}
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_STATUS", file: !125, line: 29, baseType: !53)
!125 = !DIFile(filename: "MdePkg/Include/Uefi/UefiBaseType.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "dbec48e65949dff122bc920c9d9d9c6a")
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP6_PROTOCOL", file: !24, line: 26, baseType: !128)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_DHCP6_PROTOCOL", file: !24, line: 765, size: 576, elements: !129)
!129 = !{!130, !206, !211, !216, !221, !226, !232, !234, !236}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "GetModeData", scope: !128, file: !24, line: 766, baseType: !131, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP6_GET_MODE_DATA", file: !24, line: 421, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DISubroutineType(types: !134)
!134 = !{!124, !126, !135, !177}
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP6_MODE_DATA", file: !24, line: 294, baseType: !137)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_DHCP6_MODE_DATA", file: !24, line: 284, size: 128, elements: !138)
!138 = !{!139, !146}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "ClientId", scope: !137, file: !24, line: 288, baseType: !140, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP6_DUID", file: !24, line: 214, baseType: !142)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_DHCP6_DUID", file: !24, line: 205, size: 32, elements: !143)
!143 = !{!144, !145}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !142, file: !24, line: 209, baseType: !107, size: 16)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "Duid", scope: !142, file: !24, line: 213, baseType: !88, size: 8, offset: 16)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "Ia", scope: !137, file: !24, line: 293, baseType: !147, size: 64, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP6_IA", file: !24, line: 282, baseType: !149)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_DHCP6_IA", file: !24, line: 260, size: 448, elements: !150)
!150 = !{!151, !157, !159, !160, !161}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "Descriptor", scope: !149, file: !24, line: 264, baseType: !152, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP6_IA_DESCRIPTOR", file: !24, line: 258, baseType: !153)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_DHCP6_IA_DESCRIPTOR", file: !24, line: 255, size: 64, elements: !154)
!154 = !{!155, !156}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !153, file: !24, line: 256, baseType: !107, size: 16)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "IaId", scope: !153, file: !24, line: 257, baseType: !71, size: 32, offset: 32)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "State", scope: !149, file: !24, line: 268, baseType: !158, size: 32, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP6_STATE", file: !24, line: 74, baseType: !23)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "ReplyPacket", scope: !149, file: !24, line: 272, baseType: !73, size: 64, offset: 128)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "IaAddressCount", scope: !149, file: !24, line: 276, baseType: !71, size: 32, offset: 192)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "IaAddress", scope: !149, file: !24, line: 281, baseType: !162, size: 192, offset: 224)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !163, size: 192, elements: !90)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP6_IA_ADDRESS", file: !24, line: 253, baseType: !164)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_DHCP6_IA_ADDRESS", file: !24, line: 240, size: 192, elements: !165)
!165 = !{!166, !175, !176}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "IpAddress", scope: !164, file: !24, line: 244, baseType: !167, size: 128)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IPv6_ADDRESS", file: !125, line: 90, baseType: !168)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPv6_ADDRESS", file: !54, line: 232, baseType: !169)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IPv6_ADDRESS", file: !54, line: 230, size: 128, elements: !170)
!170 = !{!171}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "Addr", scope: !169, file: !54, line: 231, baseType: !172, size: 128)
!172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 128, elements: !173)
!173 = !{!174}
!174 = !DISubrange(count: 16)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "PreferredLifetime", scope: !164, file: !24, line: 248, baseType: !71, size: 32, offset: 128)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "ValidLifetime", scope: !164, file: !24, line: 252, baseType: !71, size: 32, offset: 160)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP6_CONFIG_DATA", file: !24, line: 378, baseType: !179)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_DHCP6_CONFIG_DATA", file: !24, line: 327, size: 512, elements: !180)
!180 = !{!181, !188, !189, !190, !199, !200, !202, !203, !204}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "Dhcp6Callback", scope: !179, file: !24, line: 332, baseType: !182, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP6_CALLBACK", file: !24, line: 318, baseType: !183)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{!124, !126, !49, !158, !186, !73, !187}
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP6_EVENT", file: !24, line: 129, baseType: !35)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "CallbackContext", scope: !179, file: !24, line: 336, baseType: !49, size: 64, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "OptionCount", scope: !179, file: !24, line: 340, baseType: !71, size: 32, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "OptionList", scope: !179, file: !24, line: 348, baseType: !191, size: 64, offset: 192)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP6_PACKET_OPTION", file: !24, line: 160, baseType: !194)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_DHCP6_PACKET_OPTION", file: !24, line: 146, size: 40, elements: !195)
!195 = !{!196, !197, !198}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "OpCode", scope: !194, file: !24, line: 150, baseType: !107, size: 16)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "OpLen", scope: !194, file: !24, line: 155, baseType: !107, size: 16, offset: 16)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !194, file: !24, line: 159, baseType: !88, size: 8, offset: 32)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "IaDescriptor", scope: !179, file: !24, line: 352, baseType: !152, size: 64, offset: 256)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "IaInfoEvent", scope: !179, file: !24, line: 360, baseType: !201, size: 64, offset: 320)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_EVENT", file: !125, line: 37, baseType: !49)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "ReconfigureAccept", scope: !179, file: !24, line: 366, baseType: !50, size: 8, offset: 384)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "RapidCommit", scope: !179, file: !24, line: 372, baseType: !50, size: 8, offset: 392)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "SolicitRetransmission", scope: !179, file: !24, line: 377, baseType: !205, size: 64, offset: 448)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "Configure", scope: !128, file: !24, line: 767, baseType: !207, size: 64, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP6_CONFIGURE", file: !24, line: 465, baseType: !208)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DISubroutineType(types: !210)
!210 = !{!124, !126, !177}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "Start", scope: !128, file: !24, line: 768, baseType: !212, size: 64, offset: 128)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP6_START", file: !24, line: 506, baseType: !213)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DISubroutineType(types: !215)
!215 = !{!124, !126}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "InfoRequest", scope: !128, file: !24, line: 769, baseType: !217, size: 64, offset: 192)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP6_INFO_REQUEST", file: !24, line: 569, baseType: !218)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DISubroutineType(types: !220)
!220 = !{!124, !126, !50, !192, !71, !191, !205, !201, !120, !49}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "RenewRebind", scope: !128, file: !24, line: 770, baseType: !222, size: 64, offset: 256)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP6_RENEW_REBIND", file: !24, line: 623, baseType: !223)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DISubroutineType(types: !225)
!225 = !{!124, !126, !50}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "Decline", scope: !128, file: !24, line: 771, baseType: !227, size: 64, offset: 320)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP6_DECLINE", file: !24, line: 661, baseType: !228)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DISubroutineType(types: !230)
!230 = !{!124, !126, !71, !231}
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "Release", scope: !128, file: !24, line: 772, baseType: !233, size: 64, offset: 384)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP6_RELEASE", file: !24, line: 699, baseType: !228)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "Stop", scope: !128, file: !24, line: 773, baseType: !235, size: 64, offset: 448)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP6_STOP", file: !24, line: 724, baseType: !213)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "Parse", scope: !128, file: !24, line: 774, baseType: !237, size: 64, offset: 512)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP6_PARSE", file: !24, line: 754, baseType: !238)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DISubroutineType(types: !240)
!240 = !{!124, !126, !73, !241, !191}
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "CallbackContext", scope: !115, file: !60, line: 99, baseType: !49, size: 64, offset: 256)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "TimeoutEvent", scope: !115, file: !60, line: 100, baseType: !201, size: 64, offset: 320)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTN", file: !51, line: 216, baseType: !246)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT64", file: !51, line: 166, baseType: !247)
!247 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "DHCP6_SERVICE", file: !60, line: 38, baseType: !250)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DHCP6_SERVICE", file: !60, line: 134, size: 832, elements: !251)
!251 = !{!252, !253, !255, !256, !273, !421, !444, !445, !939, !940, !941}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", scope: !250, file: !60, line: 135, baseType: !71, size: 32)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "Controller", scope: !250, file: !60, line: 136, baseType: !254, size: 64, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_HANDLE", file: !125, line: 33, baseType: !49)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !250, file: !60, line: 137, baseType: !254, size: 64, offset: 128)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "ServiceBinding", scope: !250, file: !60, line: 138, baseType: !257, size: 128, offset: 192)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SERVICE_BINDING_PROTOCOL", file: !258, line: 19, baseType: !259)
!258 = !DIFile(filename: "MdePkg/Include/Protocol/ServiceBinding.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "ea68c59cdcea108c5697eda607991864")
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_SERVICE_BINDING_PROTOCOL", file: !258, line: 83, size: 128, elements: !260)
!260 = !{!261, !268}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "CreateChild", scope: !259, file: !258, line: 84, baseType: !262, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SERVICE_BINDING_CREATE_CHILD", file: !258, line: 42, baseType: !263)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DISubroutineType(types: !265)
!265 = !{!124, !266, !267}
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "DestroyChild", scope: !259, file: !258, line: 85, baseType: !269, size: 64, offset: 64)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SERVICE_BINDING_DESTROY_CHILD", file: !258, line: 67, baseType: !270)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!124, !266, !254}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "Snp", scope: !250, file: !60, line: 139, baseType: !274, size: 64, offset: 320)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_NETWORK_PROTOCOL", file: !276, line: 28, baseType: !277)
!276 = !DIFile(filename: "MdePkg/Include/Protocol/SimpleNetwork.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "ce4888de327acb559b98965e4f2a0a5b")
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_SIMPLE_NETWORK_PROTOCOL", file: !276, line: 643, size: 1024, elements: !278)
!278 = !{!279, !280, !285, !287, !292, !297, !299, !312, !317, !353, !374, !379, !385, !390, !395, !396}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "Revision", scope: !277, file: !276, line: 649, baseType: !56, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "Start", scope: !277, file: !276, line: 650, baseType: !281, size: 64, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_NETWORK_START", file: !276, line: 262, baseType: !282)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DISubroutineType(types: !284)
!284 = !{!124, !274}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "Stop", scope: !277, file: !276, line: 651, baseType: !286, size: 64, offset: 128)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_NETWORK_STOP", file: !276, line: 280, baseType: !282)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "Initialize", scope: !277, file: !276, line: 652, baseType: !288, size: 64, offset: 192)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_NETWORK_INITIALIZE", file: !276, line: 312, baseType: !289)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = !DISubroutineType(types: !291)
!291 = !{!124, !274, !55, !55}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "Reset", scope: !277, file: !276, line: 653, baseType: !293, size: 64, offset: 256)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_NETWORK_RESET", file: !276, line: 336, baseType: !294)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DISubroutineType(types: !296)
!296 = !{!124, !274, !50}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "Shutdown", scope: !277, file: !276, line: 654, baseType: !298, size: 64, offset: 320)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_NETWORK_SHUTDOWN", file: !276, line: 356, baseType: !282)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "ReceiveFilters", scope: !277, file: !276, line: 655, baseType: !300, size: 64, offset: 384)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_NETWORK_RECEIVE_FILTERS", file: !276, line: 386, baseType: !301)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DISubroutineType(types: !303)
!303 = !{!124, !274, !71, !71, !50, !55, !304}
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MAC_ADDRESS", file: !125, line: 97, baseType: !306)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_MAC_ADDRESS", file: !125, line: 95, size: 256, elements: !307)
!307 = !{!308}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "Addr", scope: !306, file: !125, line: 96, baseType: !309, size: 256)
!309 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 256, elements: !310)
!310 = !{!311}
!311 = !DISubrange(count: 32)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "StationAddress", scope: !277, file: !276, line: 656, baseType: !313, size: 64, offset: 448)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_NETWORK_STATION_ADDRESS", file: !276, line: 412, baseType: !314)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DISubroutineType(types: !316)
!316 = !{!124, !274, !50, !304}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "Statistics", scope: !277, file: !276, line: 657, baseType: !318, size: 64, offset: 512)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_NETWORK_STATISTICS", file: !276, line: 441, baseType: !319)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DISubroutineType(types: !321)
!321 = !{!124, !274, !50, !322, !323}
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_NETWORK_STATISTICS", file: !276, line: 136, baseType: !325)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_NETWORK_STATISTICS", file: !276, line: 38, size: 1664, elements: !326)
!326 = !{!327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "RxTotalFrames", scope: !325, file: !276, line: 43, baseType: !56, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "RxGoodFrames", scope: !325, file: !276, line: 48, baseType: !56, size: 64, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "RxUndersizeFrames", scope: !325, file: !276, line: 54, baseType: !56, size: 64, offset: 128)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "RxOversizeFrames", scope: !325, file: !276, line: 60, baseType: !56, size: 64, offset: 192)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "RxDroppedFrames", scope: !325, file: !276, line: 65, baseType: !56, size: 64, offset: 256)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "RxUnicastFrames", scope: !325, file: !276, line: 70, baseType: !56, size: 64, offset: 320)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "RxBroadcastFrames", scope: !325, file: !276, line: 75, baseType: !56, size: 64, offset: 384)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "RxMulticastFrames", scope: !325, file: !276, line: 80, baseType: !56, size: 64, offset: 448)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "RxCrcErrorFrames", scope: !325, file: !276, line: 85, baseType: !56, size: 64, offset: 512)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "RxTotalBytes", scope: !325, file: !276, line: 91, baseType: !56, size: 64, offset: 576)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "TxTotalFrames", scope: !325, file: !276, line: 96, baseType: !56, size: 64, offset: 640)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "TxGoodFrames", scope: !325, file: !276, line: 97, baseType: !56, size: 64, offset: 704)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "TxUndersizeFrames", scope: !325, file: !276, line: 98, baseType: !56, size: 64, offset: 768)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "TxOversizeFrames", scope: !325, file: !276, line: 99, baseType: !56, size: 64, offset: 832)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "TxDroppedFrames", scope: !325, file: !276, line: 100, baseType: !56, size: 64, offset: 896)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "TxUnicastFrames", scope: !325, file: !276, line: 101, baseType: !56, size: 64, offset: 960)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "TxBroadcastFrames", scope: !325, file: !276, line: 102, baseType: !56, size: 64, offset: 1024)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "TxMulticastFrames", scope: !325, file: !276, line: 103, baseType: !56, size: 64, offset: 1088)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "TxCrcErrorFrames", scope: !325, file: !276, line: 104, baseType: !56, size: 64, offset: 1152)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "TxTotalBytes", scope: !325, file: !276, line: 105, baseType: !56, size: 64, offset: 1216)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "Collisions", scope: !325, file: !276, line: 110, baseType: !56, size: 64, offset: 1280)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "UnsupportedProtocol", scope: !325, file: !276, line: 115, baseType: !56, size: 64, offset: 1344)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "RxDuplicatedFrames", scope: !325, file: !276, line: 120, baseType: !56, size: 64, offset: 1408)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "RxDecryptErrorFrames", scope: !325, file: !276, line: 125, baseType: !56, size: 64, offset: 1472)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "TxErrorFrames", scope: !325, file: !276, line: 130, baseType: !56, size: 64, offset: 1536)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "TxRetryFrames", scope: !325, file: !276, line: 135, baseType: !56, size: 64, offset: 1600)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "MCastIpToMac", scope: !277, file: !276, line: 658, baseType: !354, size: 64, offset: 576)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_NETWORK_MCAST_IP_TO_MAC", file: !276, line: 471, baseType: !355)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DISubroutineType(types: !357)
!357 = !{!124, !274, !50, !358, !304}
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP_ADDRESS", file: !125, line: 107, baseType: !360)
!360 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "EFI_IP_ADDRESS", file: !125, line: 103, size: 128, elements: !361)
!361 = !{!362, !366, !373}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "Addr", scope: !360, file: !125, line: 104, baseType: !363, size: 128)
!363 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 128, elements: !364)
!364 = !{!365}
!365 = !DISubrange(count: 4)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !360, file: !125, line: 105, baseType: !367, size: 32)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IPv4_ADDRESS", file: !125, line: 85, baseType: !368)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPv4_ADDRESS", file: !54, line: 225, baseType: !369)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IPv4_ADDRESS", file: !54, line: 223, size: 32, elements: !370)
!370 = !{!371}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "Addr", scope: !369, file: !54, line: 224, baseType: !372, size: 32)
!372 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 32, elements: !364)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !360, file: !125, line: 106, baseType: !167, size: 128)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "NvData", scope: !277, file: !276, line: 659, baseType: !375, size: 64, offset: 640)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_NETWORK_NVDATA", file: !276, line: 500, baseType: !376)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DISubroutineType(types: !378)
!378 = !{!124, !274, !50, !55, !55, !49}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "GetStatus", scope: !277, file: !276, line: 660, baseType: !380, size: 64, offset: 704)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_NETWORK_GET_STATUS", file: !276, line: 535, baseType: !381)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DISubroutineType(types: !383)
!383 = !{!124, !274, !241, !384}
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "Transmit", scope: !277, file: !276, line: 661, baseType: !386, size: 64, offset: 768)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_NETWORK_TRANSMIT", file: !276, line: 576, baseType: !387)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DISubroutineType(types: !389)
!389 = !{!124, !274, !55, !55, !49, !304, !304, !106}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "Receive", scope: !277, file: !276, line: 662, baseType: !391, size: 64, offset: 832)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_NETWORK_RECEIVE", file: !276, line: 620, baseType: !392)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DISubroutineType(types: !394)
!394 = !{!124, !274, !322, !322, !49, !304, !304, !106}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "WaitForPacket", scope: !277, file: !276, line: 666, baseType: !201, size: 64, offset: 896)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "Mode", scope: !277, file: !276, line: 670, baseType: !397, size: 64, offset: 960)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_NETWORK_MODE", file: !276, line: 242, baseType: !399)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_SIMPLE_NETWORK_MODE", file: !276, line: 162, size: 5248, elements: !400)
!400 = !{!401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !413, !414, !415, !416, !417, !418, !419, !420}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "State", scope: !399, file: !276, line: 166, baseType: !71, size: 32)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "HwAddressSize", scope: !399, file: !276, line: 170, baseType: !71, size: 32, offset: 32)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "MediaHeaderSize", scope: !399, file: !276, line: 174, baseType: !71, size: 32, offset: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "MaxPacketSize", scope: !399, file: !276, line: 178, baseType: !71, size: 32, offset: 96)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "NvRamSize", scope: !399, file: !276, line: 182, baseType: !71, size: 32, offset: 128)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "NvRamAccessSize", scope: !399, file: !276, line: 189, baseType: !71, size: 32, offset: 160)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "ReceiveFilterMask", scope: !399, file: !276, line: 193, baseType: !71, size: 32, offset: 192)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "ReceiveFilterSetting", scope: !399, file: !276, line: 197, baseType: !71, size: 32, offset: 224)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "MaxMCastFilterCount", scope: !399, file: !276, line: 201, baseType: !71, size: 32, offset: 256)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "MCastFilterCount", scope: !399, file: !276, line: 205, baseType: !71, size: 32, offset: 288)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "MCastFilter", scope: !399, file: !276, line: 209, baseType: !412, size: 4096, offset: 320)
!412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !305, size: 4096, elements: !173)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "CurrentAddress", scope: !399, file: !276, line: 213, baseType: !305, size: 256, offset: 4416)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "BroadcastAddress", scope: !399, file: !276, line: 217, baseType: !305, size: 256, offset: 4672)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "PermanentAddress", scope: !399, file: !276, line: 221, baseType: !305, size: 256, offset: 4928)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "IfType", scope: !399, file: !276, line: 225, baseType: !89, size: 8, offset: 5184)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "MacAddressChangeable", scope: !399, file: !276, line: 229, baseType: !50, size: 8, offset: 5192)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "MultipleTxSupported", scope: !399, file: !276, line: 233, baseType: !50, size: 8, offset: 5200)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "MediaPresentSupported", scope: !399, file: !276, line: 237, baseType: !50, size: 8, offset: 5208)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "MediaPresent", scope: !399, file: !276, line: 241, baseType: !50, size: 8, offset: 5216)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "Ip6Cfg", scope: !250, file: !60, line: 140, baseType: !422, size: 64, offset: 384)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP6_CONFIG_PROTOCOL", file: !4, line: 20, baseType: !424)
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_IP6_CONFIG_PROTOCOL", file: !4, line: 358, size: 256, elements: !425)
!425 = !{!426, !432, !437, !442}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "SetData", scope: !424, file: !4, line: 359, baseType: !427, size: 64)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP6_CONFIG_SET_DATA", file: !4, line: 248, baseType: !428)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DISubroutineType(types: !430)
!430 = !{!124, !422, !431, !55, !49}
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP6_CONFIG_DATA_TYPE", file: !4, line: 95, baseType: !3)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "GetData", scope: !424, file: !4, line: 360, baseType: !433, size: 64, offset: 64)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP6_CONFIG_GET_DATA", file: !4, line: 294, baseType: !434)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DISubroutineType(types: !436)
!436 = !{!124, !422, !431, !322, !49}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "RegisterDataNotify", scope: !424, file: !4, line: 361, baseType: !438, size: 64, offset: 128)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP6_CONFIG_REGISTER_NOTIFY", file: !4, line: 325, baseType: !439)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DISubroutineType(types: !441)
!441 = !{!124, !422, !431, !201}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "UnregisterDataNotify", scope: !424, file: !4, line: 362, baseType: !443, size: 64, offset: 192)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP6_CONFIG_UNREGISTER_NOTIFY", file: !4, line: 348, baseType: !439)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "ClientId", scope: !250, file: !60, line: 141, baseType: !140, size: 64, offset: 448)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "UdpIo", scope: !250, file: !60, line: 142, baseType: !446, size: 64, offset: 512)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "UDP_IO", file: !448, line: 18, baseType: !449)
!448 = !DIFile(filename: "NetworkPkg/Include/Library/UdpIoLib.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "63fbf94bd36560d0121aa4bfbe9a173a")
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_UDP_IO", file: !448, line: 125, size: 6464, elements: !450)
!450 = !{!451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !701, !933, !934, !938}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", scope: !449, file: !448, line: 126, baseType: !71, size: 32)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "Link", scope: !449, file: !448, line: 127, baseType: !64, size: 128, offset: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "RefCnt", scope: !449, file: !448, line: 128, baseType: !245, size: 64, offset: 192)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "UdpVersion", scope: !449, file: !448, line: 129, baseType: !89, size: 8, offset: 256)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "Controller", scope: !449, file: !448, line: 134, baseType: !254, size: 64, offset: 320)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !449, file: !448, line: 135, baseType: !254, size: 64, offset: 384)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "UdpHandle", scope: !449, file: !448, line: 136, baseType: !254, size: 64, offset: 448)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "SnpMode", scope: !449, file: !448, line: 138, baseType: !398, size: 5248, offset: 512)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "SentDatagram", scope: !449, file: !448, line: 140, baseType: !64, size: 128, offset: 5760)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "RecvRequest", scope: !449, file: !448, line: 141, baseType: !461, size: 64, offset: 5888)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "UDP_RX_TOKEN", file: !448, line: 86, baseType: !463)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UDP_RX_TOKEN", file: !448, line: 77, size: 512, elements: !464)
!464 = !{!465, !466, !467, !589, !590, !591}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", scope: !463, file: !448, line: 78, baseType: !71, size: 32)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "UdpIo", scope: !463, file: !448, line: 79, baseType: !446, size: 64, offset: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "CallBack", scope: !463, file: !448, line: 81, baseType: !468, size: 64, offset: 128)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "UDP_IO_CALLBACK", file: !448, line: 57, baseType: !469)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DISubroutineType(types: !471)
!471 = !{null, !472, !581, !124, !49}
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_BUF", file: !474, line: 1612, baseType: !475)
!474 = !DIFile(filename: "NetworkPkg/Include/Library/NetLib.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "9ef5aa6e52119eac072123f1d7d223d9")
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NET_BUF", file: !474, line: 1597, size: 1408, elements: !476)
!476 = !{!477, !478, !479, !480, !516, !533, !542, !546, !569, !570, !571}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", scope: !475, file: !474, line: 1598, baseType: !71, size: 32)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "RefCnt", scope: !475, file: !474, line: 1599, baseType: !245, size: 64, offset: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "List", scope: !475, file: !474, line: 1600, baseType: !64, size: 128, offset: 128)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "Ip", scope: !475, file: !474, line: 1602, baseType: !481, size: 64, offset: 256)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_IP_HEAD", file: !474, line: 1585, baseType: !482)
!482 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "NET_IP_HEAD", file: !474, line: 1582, size: 64, elements: !483)
!483 = !{!484, !501}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "Ip4", scope: !482, file: !474, line: 1583, baseType: !485, size: 64)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "IP4_HEAD", file: !474, line: 140, baseType: !487)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IP4_HEAD", file: !474, line: 128, size: 160, elements: !488)
!488 = !{!489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !500}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "HeadLen", scope: !487, file: !474, line: 129, baseType: !89, size: 4, flags: DIFlagBitField, extraData: i64 0)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "Ver", scope: !487, file: !474, line: 130, baseType: !89, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "Tos", scope: !487, file: !474, line: 131, baseType: !89, size: 8, offset: 8)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "TotalLen", scope: !487, file: !474, line: 132, baseType: !107, size: 16, offset: 16)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "Id", scope: !487, file: !474, line: 133, baseType: !107, size: 16, offset: 32)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "Fragment", scope: !487, file: !474, line: 134, baseType: !107, size: 16, offset: 48)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "Ttl", scope: !487, file: !474, line: 135, baseType: !89, size: 8, offset: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "Protocol", scope: !487, file: !474, line: 136, baseType: !89, size: 8, offset: 72)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "Checksum", scope: !487, file: !474, line: 137, baseType: !107, size: 16, offset: 80)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "Src", scope: !487, file: !474, line: 138, baseType: !499, size: 32, offset: 96)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "IP4_ADDR", file: !474, line: 18, baseType: !71)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "Dst", scope: !487, file: !474, line: 139, baseType: !499, size: 32, offset: 128)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "Ip6", scope: !482, file: !474, line: 1584, baseType: !502, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP6_HEADER", file: !16, line: 406, baseType: !504)
!504 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_IP6_HEADER", file: !16, line: 395, size: 320, elements: !505)
!505 = !{!506, !507, !508, !509, !510, !511, !512, !513, !514, !515}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "TrafficClassH", scope: !504, file: !16, line: 396, baseType: !89, size: 4, flags: DIFlagBitField, extraData: i64 0)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "Version", scope: !504, file: !16, line: 397, baseType: !89, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "FlowLabelH", scope: !504, file: !16, line: 398, baseType: !89, size: 4, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "TrafficClassL", scope: !504, file: !16, line: 399, baseType: !89, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 8)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "FlowLabelL", scope: !504, file: !16, line: 400, baseType: !107, size: 16, offset: 16)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "PayloadLength", scope: !504, file: !16, line: 401, baseType: !107, size: 16, offset: 32)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "NextHeader", scope: !504, file: !16, line: 402, baseType: !89, size: 8, offset: 48)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "HopLimit", scope: !504, file: !16, line: 403, baseType: !89, size: 8, offset: 56)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "SourceAddress", scope: !504, file: !16, line: 404, baseType: !167, size: 128, offset: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "DestinationAddress", scope: !504, file: !16, line: 405, baseType: !167, size: 128, offset: 192)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "Tcp", scope: !475, file: !474, line: 1603, baseType: !517, size: 64, offset: 320)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "TCP_HEAD", file: !474, line: 205, baseType: !519)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TCP_HEAD", file: !474, line: 194, size: 160, elements: !520)
!520 = !{!521, !523, !524, !526, !527, !528, !529, !530, !531, !532}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "SrcPort", scope: !519, file: !474, line: 195, baseType: !522, size: 16)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "TCP_PORTNO", file: !474, line: 20, baseType: !107)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "DstPort", scope: !519, file: !474, line: 196, baseType: !522, size: 16, offset: 16)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "Seq", scope: !519, file: !474, line: 197, baseType: !525, size: 32, offset: 32)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "TCP_SEQNO", file: !474, line: 19, baseType: !71)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "Ack", scope: !519, file: !474, line: 198, baseType: !525, size: 32, offset: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "Res", scope: !519, file: !474, line: 199, baseType: !89, size: 4, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "HeadLen", scope: !519, file: !474, line: 200, baseType: !89, size: 4, offset: 100, flags: DIFlagBitField, extraData: i64 96)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "Flag", scope: !519, file: !474, line: 201, baseType: !89, size: 8, offset: 104)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "Wnd", scope: !519, file: !474, line: 202, baseType: !107, size: 16, offset: 112)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "Checksum", scope: !519, file: !474, line: 203, baseType: !107, size: 16, offset: 128)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "Urg", scope: !519, file: !474, line: 204, baseType: !107, size: 16, offset: 144)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "Udp", scope: !475, file: !474, line: 1604, baseType: !534, size: 64, offset: 384)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_UDP_HEADER", file: !474, line: 189, baseType: !536)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_UDP_HEADER", file: !474, line: 184, size: 64, elements: !537)
!537 = !{!538, !539, !540, !541}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "SrcPort", scope: !536, file: !474, line: 185, baseType: !107, size: 16)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "DstPort", scope: !536, file: !474, line: 186, baseType: !107, size: 16, offset: 16)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !536, file: !474, line: 187, baseType: !107, size: 16, offset: 32)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "Checksum", scope: !536, file: !474, line: 188, baseType: !107, size: 16, offset: 48)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoData", scope: !475, file: !474, line: 1605, baseType: !543, size: 512, offset: 448)
!543 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 512, elements: !544)
!544 = !{!545}
!545 = !DISubrange(count: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "Vector", scope: !475, file: !474, line: 1607, baseType: !547, size: 64, offset: 960)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_VECTOR", file: !474, line: 1568, baseType: !549)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NET_VECTOR", file: !474, line: 1558, size: 512, elements: !550)
!550 = !{!551, !552, !553, !558, !559, !560, !561, !562}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", scope: !549, file: !474, line: 1559, baseType: !71, size: 32)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "RefCnt", scope: !549, file: !474, line: 1560, baseType: !245, size: 64, offset: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "Free", scope: !549, file: !474, line: 1561, baseType: !554, size: 64, offset: 128)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_VECTOR_EXT_FREE", file: !474, line: 1551, baseType: !555)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = !DISubroutineType(types: !557)
!557 = !{null, !49}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "Arg", scope: !549, file: !474, line: 1562, baseType: !49, size: 64, offset: 192)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "Flag", scope: !549, file: !474, line: 1563, baseType: !71, size: 32, offset: 256)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "Len", scope: !549, file: !474, line: 1564, baseType: !71, size: 32, offset: 288)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "BlockNum", scope: !549, file: !474, line: 1566, baseType: !71, size: 32, offset: 320)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "Block", scope: !549, file: !474, line: 1567, baseType: !563, size: 128, offset: 384)
!563 = !DICompositeType(tag: DW_TAG_array_type, baseType: !564, size: 128, elements: !90)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_BLOCK", file: !474, line: 1549, baseType: !565)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NET_BLOCK", file: !474, line: 1546, size: 128, elements: !566)
!566 = !{!567, !568}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "Len", scope: !565, file: !474, line: 1547, baseType: !71, size: 32)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "Bulk", scope: !565, file: !474, line: 1548, baseType: !244, size: 64, offset: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "BlockOpNum", scope: !475, file: !474, line: 1609, baseType: !71, size: 32, offset: 1024)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "TotalSize", scope: !475, file: !474, line: 1610, baseType: !71, size: 32, offset: 1056)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "BlockOp", scope: !475, file: !474, line: 1611, baseType: !572, size: 320, offset: 1088)
!572 = !DICompositeType(tag: DW_TAG_array_type, baseType: !573, size: 320, elements: !90)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_BLOCK_OP", file: !474, line: 1580, baseType: !574)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NET_BLOCK_OP", file: !474, line: 1574, size: 320, elements: !575)
!575 = !{!576, !577, !578, !579, !580}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "BlockHead", scope: !574, file: !474, line: 1575, baseType: !244, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "BlockTail", scope: !574, file: !474, line: 1576, baseType: !244, size: 64, offset: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "Head", scope: !574, file: !474, line: 1577, baseType: !244, size: 64, offset: 128)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "Tail", scope: !574, file: !474, line: 1578, baseType: !244, size: 64, offset: 192)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !574, file: !474, line: 1579, baseType: !71, size: 32, offset: 256)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "UDP_END_POINT", file: !448, line: 39, baseType: !583)
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UDP_END_POINT", file: !448, line: 34, size: 320, elements: !584)
!584 = !{!585, !586, !587, !588}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "LocalAddr", scope: !583, file: !448, line: 35, baseType: !359, size: 128)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "LocalPort", scope: !583, file: !448, line: 36, baseType: !107, size: 16, offset: 128)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "RemoteAddr", scope: !583, file: !448, line: 37, baseType: !359, size: 128, offset: 160)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "RemotePort", scope: !583, file: !448, line: 38, baseType: !107, size: 16, offset: 288)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "Context", scope: !463, file: !448, line: 82, baseType: !49, size: 64, offset: 192)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "HeadLen", scope: !463, file: !448, line: 83, baseType: !71, size: 32, offset: 256)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "Token", scope: !463, file: !448, line: 85, baseType: !592, size: 192, offset: 320)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "UDP_COMPLETION_TOKEN", file: !448, line: 75, baseType: !593)
!593 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "UDP_COMPLETION_TOKEN", file: !448, line: 72, size: 192, elements: !594)
!594 = !{!595, !657}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "Udp4", scope: !593, file: !448, line: 73, baseType: !596, size: 192)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_UDP4_COMPLETION_TOKEN", file: !597, line: 118, baseType: !598)
!597 = !DIFile(filename: "MdePkg/Include/Protocol/Udp4.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "b43e113d8bfd3002b7bb0ecd1117fd63")
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_UDP4_COMPLETION_TOKEN", file: !597, line: 111, size: 192, elements: !599)
!599 = !{!600, !601, !602, !656}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "Event", scope: !598, file: !597, line: 112, baseType: !201, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "Status", scope: !598, file: !597, line: 113, baseType: !124, size: 64, offset: 64)
!602 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !598, file: !597, line: 114, size: 64, elements: !603)
!603 = !{!604, !644}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "RxData", scope: !602, file: !597, line: 115, baseType: !605, size: 64)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_UDP4_RECEIVE_DATA", file: !597, line: 109, baseType: !607)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_UDP4_RECEIVE_DATA", file: !597, line: 102, size: 512, elements: !608)
!608 = !{!609, !626, !627, !635, !636, !637}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "TimeStamp", scope: !607, file: !597, line: 103, baseType: !610, size: 128)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TIME", file: !125, line: 80, baseType: !611)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_TIME", file: !125, line: 68, size: 128, elements: !612)
!612 = !{!613, !614, !615, !616, !617, !618, !619, !620, !621, !624, !625}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "Year", scope: !611, file: !125, line: 69, baseType: !107, size: 16)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "Month", scope: !611, file: !125, line: 70, baseType: !89, size: 8, offset: 16)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "Day", scope: !611, file: !125, line: 71, baseType: !89, size: 8, offset: 24)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "Hour", scope: !611, file: !125, line: 72, baseType: !89, size: 8, offset: 32)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "Minute", scope: !611, file: !125, line: 73, baseType: !89, size: 8, offset: 40)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "Second", scope: !611, file: !125, line: 74, baseType: !89, size: 8, offset: 48)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "Pad1", scope: !611, file: !125, line: 75, baseType: !89, size: 8, offset: 56)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "Nanosecond", scope: !611, file: !125, line: 76, baseType: !71, size: 32, offset: 64)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "TimeZone", scope: !611, file: !125, line: 77, baseType: !622, size: 16, offset: 96)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT16", file: !51, line: 187, baseType: !623)
!623 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "Daylight", scope: !611, file: !125, line: 78, baseType: !89, size: 8, offset: 112)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "Pad2", scope: !611, file: !125, line: 79, baseType: !89, size: 8, offset: 120)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "RecycleSignal", scope: !607, file: !597, line: 104, baseType: !201, size: 64, offset: 128)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "UdpSession", scope: !607, file: !597, line: 105, baseType: !628, size: 96, offset: 192)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_UDP4_SESSION_DATA", file: !597, line: 66, baseType: !629)
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_UDP4_SESSION_DATA", file: !597, line: 61, size: 96, elements: !630)
!630 = !{!631, !632, !633, !634}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "SourceAddress", scope: !629, file: !597, line: 62, baseType: !367, size: 32)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "SourcePort", scope: !629, file: !597, line: 63, baseType: !107, size: 16, offset: 32)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "DestinationAddress", scope: !629, file: !597, line: 64, baseType: !367, size: 32, offset: 48)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "DestinationPort", scope: !629, file: !597, line: 65, baseType: !107, size: 16, offset: 80)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "DataLength", scope: !607, file: !597, line: 106, baseType: !71, size: 32, offset: 288)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "FragmentCount", scope: !607, file: !597, line: 107, baseType: !71, size: 32, offset: 320)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "FragmentTable", scope: !607, file: !597, line: 108, baseType: !638, size: 128, offset: 384)
!638 = !DICompositeType(tag: DW_TAG_array_type, baseType: !639, size: 128, elements: !90)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_UDP4_FRAGMENT_DATA", file: !597, line: 59, baseType: !640)
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_UDP4_FRAGMENT_DATA", file: !597, line: 56, size: 128, elements: !641)
!641 = !{!642, !643}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "FragmentLength", scope: !640, file: !597, line: 57, baseType: !71, size: 32)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "FragmentBuffer", scope: !640, file: !597, line: 58, baseType: !49, size: 64, offset: 64)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "TxData", scope: !602, file: !597, line: 116, baseType: !645, size: 64)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_UDP4_TRANSMIT_DATA", file: !597, line: 100, baseType: !647)
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_UDP4_TRANSMIT_DATA", file: !597, line: 94, size: 320, elements: !648)
!648 = !{!649, !651, !653, !654, !655}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "UdpSessionData", scope: !647, file: !597, line: 95, baseType: !650, size: 64)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "GatewayAddress", scope: !647, file: !597, line: 96, baseType: !652, size: 64, offset: 64)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "DataLength", scope: !647, file: !597, line: 97, baseType: !71, size: 32, offset: 128)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "FragmentCount", scope: !647, file: !597, line: 98, baseType: !71, size: 32, offset: 160)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "FragmentTable", scope: !647, file: !597, line: 99, baseType: !638, size: 128, offset: 192)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "Packet", scope: !598, file: !597, line: 117, baseType: !602, size: 64, offset: 128)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "Udp6", scope: !593, file: !448, line: 74, baseType: !658, size: 192)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_UDP6_COMPLETION_TOKEN", file: !659, line: 294, baseType: !660)
!659 = !DIFile(filename: "MdePkg/Include/Protocol/Udp6.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "f5229d05b997c7ff83c368dde8dcb821")
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_UDP6_COMPLETION_TOKEN", file: !659, line: 257, size: 192, elements: !661)
!661 = !{!662, !663, !664, !700}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "Event", scope: !660, file: !659, line: 262, baseType: !201, size: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "Status", scope: !660, file: !659, line: 283, baseType: !124, size: 64, offset: 64)
!664 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !660, file: !659, line: 284, size: 64, elements: !665)
!665 = !{!666, !690}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "RxData", scope: !664, file: !659, line: 288, baseType: !667, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_UDP6_RECEIVE_DATA", file: !659, line: 246, baseType: !669)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_UDP6_RECEIVE_DATA", file: !659, line: 220, size: 704, elements: !670)
!670 = !{!671, !672, !673, !681, !682, !683}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "TimeStamp", scope: !669, file: !659, line: 224, baseType: !610, size: 128)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "RecycleSignal", scope: !669, file: !659, line: 228, baseType: !201, size: 64, offset: 128)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "UdpSession", scope: !669, file: !659, line: 233, baseType: !674, size: 288, offset: 192)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_UDP6_SESSION_DATA", file: !659, line: 116, baseType: !675)
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_UDP6_SESSION_DATA", file: !659, line: 95, size: 288, elements: !676)
!676 = !{!677, !678, !679, !680}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "SourceAddress", scope: !675, file: !659, line: 100, baseType: !167, size: 128)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "SourcePort", scope: !675, file: !659, line: 105, baseType: !107, size: 16, offset: 128)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "DestinationAddress", scope: !675, file: !659, line: 110, baseType: !167, size: 128, offset: 144)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "DestinationPort", scope: !675, file: !659, line: 115, baseType: !107, size: 16, offset: 272)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "DataLength", scope: !669, file: !659, line: 237, baseType: !71, size: 32, offset: 480)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "FragmentCount", scope: !669, file: !659, line: 241, baseType: !71, size: 32, offset: 512)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "FragmentTable", scope: !669, file: !659, line: 245, baseType: !684, size: 128, offset: 576)
!684 = !DICompositeType(tag: DW_TAG_array_type, baseType: !685, size: 128, elements: !90)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_UDP6_FRAGMENT_DATA", file: !659, line: 88, baseType: !686)
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_UDP6_FRAGMENT_DATA", file: !659, line: 85, size: 128, elements: !687)
!687 = !{!688, !689}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "FragmentLength", scope: !686, file: !659, line: 86, baseType: !71, size: 32)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "FragmentBuffer", scope: !686, file: !659, line: 87, baseType: !49, size: 64, offset: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "TxData", scope: !664, file: !659, line: 292, baseType: !691, size: 64)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_UDP6_TRANSMIT_DATA", file: !659, line: 208, baseType: !693)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_UDP6_TRANSMIT_DATA", file: !659, line: 189, size: 256, elements: !694)
!694 = !{!695, !697, !698, !699}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "UdpSessionData", scope: !693, file: !659, line: 195, baseType: !696, size: 64)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "DataLength", scope: !693, file: !659, line: 199, baseType: !71, size: 32, offset: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "FragmentCount", scope: !693, file: !659, line: 203, baseType: !71, size: 32, offset: 96)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "FragmentTable", scope: !693, file: !659, line: 207, baseType: !684, size: 128, offset: 128)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "Packet", scope: !660, file: !659, line: 293, baseType: !664, size: 64, offset: 128)
!701 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !449, file: !448, line: 143, size: 64, elements: !702)
!702 = !{!703, !822}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "Udp4", scope: !701, file: !448, line: 144, baseType: !704, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_UDP4_PROTOCOL", file: !597, line: 32, baseType: !706)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_UDP4_PROTOCOL", file: !597, line: 423, size: 512, elements: !707)
!707 = !{!708, !792, !797, !802, !807, !813, !815, !817}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "GetModeData", scope: !706, file: !597, line: 424, baseType: !709, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_UDP4_GET_MODE_DATA", file: !597, line: 142, baseType: !710)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = !DISubroutineType(types: !712)
!712 = !{!124, !704, !713, !732, !777, !397}
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_UDP4_CONFIG_DATA", file: !597, line: 92, baseType: !715)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_UDP4_CONFIG_DATA", file: !597, line: 67, size: 288, elements: !716)
!716 = !{!717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "AcceptBroadcast", scope: !715, file: !597, line: 71, baseType: !50, size: 8)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "AcceptPromiscuous", scope: !715, file: !597, line: 72, baseType: !50, size: 8, offset: 8)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "AcceptAnyPort", scope: !715, file: !597, line: 73, baseType: !50, size: 8, offset: 16)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "AllowDuplicatePort", scope: !715, file: !597, line: 74, baseType: !50, size: 8, offset: 24)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "TypeOfService", scope: !715, file: !597, line: 78, baseType: !89, size: 8, offset: 32)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "TimeToLive", scope: !715, file: !597, line: 79, baseType: !89, size: 8, offset: 40)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "DoNotFragment", scope: !715, file: !597, line: 80, baseType: !50, size: 8, offset: 48)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "ReceiveTimeout", scope: !715, file: !597, line: 81, baseType: !71, size: 32, offset: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "TransmitTimeout", scope: !715, file: !597, line: 82, baseType: !71, size: 32, offset: 96)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultAddress", scope: !715, file: !597, line: 86, baseType: !50, size: 8, offset: 128)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "StationAddress", scope: !715, file: !597, line: 87, baseType: !367, size: 32, offset: 136)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "SubnetMask", scope: !715, file: !597, line: 88, baseType: !367, size: 32, offset: 168)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "StationPort", scope: !715, file: !597, line: 89, baseType: !107, size: 16, offset: 208)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "RemoteAddress", scope: !715, file: !597, line: 90, baseType: !367, size: 32, offset: 224)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "RemotePort", scope: !715, file: !597, line: 91, baseType: !107, size: 16, offset: 256)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_MODE_DATA", file: !734, line: 182, baseType: !735)
!734 = !DIFile(filename: "MdePkg/Include/Protocol/Ip4.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "1ff13a8b379fde89ccc818c3d7035657")
!735 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_IP4_MODE_DATA", file: !734, line: 141, size: 704, elements: !736)
!736 = !{!737, !738, !739, !757, !758, !759, !760, !761, !769, !770}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "IsStarted", scope: !735, file: !734, line: 145, baseType: !50, size: 8)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "MaxPacketSize", scope: !735, file: !734, line: 149, baseType: !71, size: 32, offset: 32)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "ConfigData", scope: !735, file: !734, line: 153, baseType: !740, size: 224, offset: 64)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_CONFIG_DATA", file: !734, line: 128, baseType: !741)
!741 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_IP4_CONFIG_DATA", file: !734, line: 58, size: 224, elements: !742)
!742 = !{!743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "DefaultProtocol", scope: !741, file: !734, line: 63, baseType: !89, size: 8)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "AcceptAnyProtocol", scope: !741, file: !734, line: 69, baseType: !50, size: 8, offset: 8)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "AcceptIcmpErrors", scope: !741, file: !734, line: 74, baseType: !50, size: 8, offset: 16)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "AcceptBroadcast", scope: !741, file: !734, line: 80, baseType: !50, size: 8, offset: 24)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "AcceptPromiscuous", scope: !741, file: !734, line: 86, baseType: !50, size: 8, offset: 32)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultAddress", scope: !741, file: !734, line: 90, baseType: !50, size: 8, offset: 40)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "StationAddress", scope: !741, file: !734, line: 94, baseType: !367, size: 32, offset: 48)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "SubnetMask", scope: !741, file: !734, line: 98, baseType: !367, size: 32, offset: 80)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "TypeOfService", scope: !741, file: !734, line: 102, baseType: !89, size: 8, offset: 112)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "TimeToLive", scope: !741, file: !734, line: 106, baseType: !89, size: 8, offset: 120)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "DoNotFragment", scope: !741, file: !734, line: 110, baseType: !50, size: 8, offset: 128)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "RawData", scope: !741, file: !734, line: 115, baseType: !50, size: 8, offset: 136)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "ReceiveTimeout", scope: !741, file: !734, line: 121, baseType: !71, size: 32, offset: 160)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "TransmitTimeout", scope: !741, file: !734, line: 127, baseType: !71, size: 32, offset: 192)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "IsConfigured", scope: !735, file: !734, line: 157, baseType: !50, size: 8, offset: 288)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "GroupCount", scope: !735, file: !734, line: 161, baseType: !71, size: 32, offset: 320)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "GroupTable", scope: !735, file: !734, line: 165, baseType: !652, size: 64, offset: 384)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "RouteCount", scope: !735, file: !734, line: 169, baseType: !71, size: 32, offset: 448)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "RouteTable", scope: !735, file: !734, line: 173, baseType: !762, size: 64, offset: 512)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_ROUTE_TABLE", file: !734, line: 134, baseType: !764)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_IP4_ROUTE_TABLE", file: !734, line: 130, size: 96, elements: !765)
!765 = !{!766, !767, !768}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "SubnetAddress", scope: !764, file: !734, line: 131, baseType: !367, size: 32)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "SubnetMask", scope: !764, file: !734, line: 132, baseType: !367, size: 32, offset: 32)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "GatewayAddress", scope: !764, file: !734, line: 133, baseType: !367, size: 32, offset: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "IcmpTypeCount", scope: !735, file: !734, line: 177, baseType: !71, size: 32, offset: 576)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "IcmpTypeList", scope: !735, file: !734, line: 181, baseType: !771, size: 64, offset: 640)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_ICMP_TYPE", file: !734, line: 139, baseType: !773)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_IP4_ICMP_TYPE", file: !734, line: 136, size: 16, elements: !774)
!774 = !{!775, !776}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !773, file: !734, line: 137, baseType: !89, size: 8)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "Code", scope: !773, file: !734, line: 138, baseType: !89, size: 8, offset: 8)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MANAGED_NETWORK_CONFIG_DATA", file: !779, line: 84, baseType: !780)
!779 = !DIFile(filename: "MdePkg/Include/Protocol/ManagedNetwork.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "8951452d2c79255944d265d14ed27585")
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_MANAGED_NETWORK_CONFIG_DATA", file: !779, line: 30, size: 160, elements: !781)
!781 = !{!782, !783, !784, !785, !786, !787, !788, !789, !790, !791}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "ReceivedQueueTimeoutValue", scope: !780, file: !779, line: 35, baseType: !71, size: 32)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "TransmitQueueTimeoutValue", scope: !780, file: !779, line: 40, baseType: !71, size: 32, offset: 32)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "ProtocolTypeFilter", scope: !780, file: !779, line: 45, baseType: !107, size: 16, offset: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "EnableUnicastReceive", scope: !780, file: !779, line: 50, baseType: !50, size: 8, offset: 80)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "EnableMulticastReceive", scope: !780, file: !779, line: 55, baseType: !50, size: 8, offset: 88)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "EnableBroadcastReceive", scope: !780, file: !779, line: 60, baseType: !50, size: 8, offset: 96)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "EnablePromiscuousReceive", scope: !780, file: !779, line: 65, baseType: !50, size: 8, offset: 104)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "FlushQueuesOnReset", scope: !780, file: !779, line: 70, baseType: !50, size: 8, offset: 112)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "EnableReceiveTimestamps", scope: !780, file: !779, line: 76, baseType: !50, size: 8, offset: 120)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "DisableBackgroundPolling", scope: !780, file: !779, line: 83, baseType: !50, size: 8, offset: 128)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "Configure", scope: !706, file: !597, line: 425, baseType: !793, size: 64, offset: 64)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_UDP4_CONFIGURE", file: !597, line: 190, baseType: !794)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = !DISubroutineType(types: !796)
!796 = !{!124, !704, !713}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "Groups", scope: !706, file: !597, line: 426, baseType: !798, size: 64, offset: 128)
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_UDP4_GROUPS", file: !597, line: 226, baseType: !799)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DISubroutineType(types: !801)
!801 = !{!124, !704, !50, !652}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "Routes", scope: !706, file: !597, line: 427, baseType: !803, size: 64, offset: 192)
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_UDP4_ROUTES", file: !597, line: 272, baseType: !804)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DISubroutineType(types: !806)
!806 = !{!124, !704, !50, !652, !652, !652}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "Transmit", scope: !706, file: !597, line: 428, baseType: !808, size: 64, offset: 256)
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_UDP4_TRANSMIT", file: !597, line: 376, baseType: !809)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DISubroutineType(types: !811)
!811 = !{!124, !704, !812}
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "Receive", scope: !706, file: !597, line: 429, baseType: !814, size: 64, offset: 320)
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_UDP4_RECEIVE", file: !597, line: 339, baseType: !809)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "Cancel", scope: !706, file: !597, line: 430, baseType: !816, size: 64, offset: 384)
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_UDP4_CANCEL", file: !597, line: 411, baseType: !809)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "Poll", scope: !706, file: !597, line: 431, baseType: !818, size: 64, offset: 448)
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_UDP4_POLL", file: !597, line: 302, baseType: !819)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = !DISubroutineType(types: !821)
!821 = !{!124, !704}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "Udp6", scope: !701, file: !448, line: 145, baseType: !823, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_UDP6_PROTOCOL", file: !659, line: 79, baseType: !825)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_UDP6_PROTOCOL", file: !659, line: 561, size: 448, elements: !826)
!826 = !{!827, !908, !913, !918, !924, !926, !928}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "GetModeData", scope: !825, file: !659, line: 562, baseType: !828, size: 64)
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_UDP6_GET_MODE_DATA", file: !659, line: 318, baseType: !829)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = !DISubroutineType(types: !831)
!831 = !{!124, !823, !832, !847, !777, !397}
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_UDP6_CONFIG_DATA", file: !659, line: 183, baseType: !834)
!834 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_UDP6_CONFIG_DATA", file: !659, line: 118, size: 416, elements: !835)
!835 = !{!836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "AcceptPromiscuous", scope: !834, file: !659, line: 122, baseType: !50, size: 8)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "AcceptAnyPort", scope: !834, file: !659, line: 126, baseType: !50, size: 8, offset: 8)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "AllowDuplicatePort", scope: !834, file: !659, line: 131, baseType: !50, size: 8, offset: 16)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "TrafficClass", scope: !834, file: !659, line: 135, baseType: !89, size: 8, offset: 24)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "HopLimit", scope: !834, file: !659, line: 139, baseType: !89, size: 8, offset: 32)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "ReceiveTimeout", scope: !834, file: !659, line: 144, baseType: !71, size: 32, offset: 64)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "TransmitTimeout", scope: !834, file: !659, line: 149, baseType: !71, size: 32, offset: 96)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "StationAddress", scope: !834, file: !659, line: 161, baseType: !167, size: 128, offset: 128)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "StationPort", scope: !834, file: !659, line: 168, baseType: !107, size: 16, offset: 256)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "RemoteAddress", scope: !834, file: !659, line: 175, baseType: !167, size: 128, offset: 272)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "RemotePort", scope: !834, file: !659, line: 182, baseType: !107, size: 16, offset: 400)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP6_MODE_DATA", file: !16, line: 387, baseType: !849)
!849 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_IP6_MODE_DATA", file: !16, line: 305, size: 1280, elements: !850)
!850 = !{!851, !852, !853, !868, !869, !870, !877, !878, !879, !880, !888, !889, !898, !899, !900, !901}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "IsStarted", scope: !849, file: !16, line: 311, baseType: !50, size: 8)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "MaxPacketSize", scope: !849, file: !16, line: 315, baseType: !71, size: 32, offset: 32)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "ConfigData", scope: !849, file: !16, line: 319, baseType: !854, size: 416, offset: 64)
!854 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP6_CONFIG_DATA", file: !16, line: 215, baseType: !855)
!855 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_IP6_CONFIG_DATA", file: !16, line: 137, size: 416, elements: !856)
!856 = !{!857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "DefaultProtocol", scope: !855, file: !16, line: 144, baseType: !89, size: 8)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "AcceptAnyProtocol", scope: !855, file: !16, line: 152, baseType: !50, size: 8, offset: 8)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "AcceptIcmpErrors", scope: !855, file: !16, line: 157, baseType: !50, size: 8, offset: 16)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "AcceptPromiscuous", scope: !855, file: !16, line: 163, baseType: !50, size: 8, offset: 24)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "DestinationAddress", scope: !855, file: !16, line: 168, baseType: !167, size: 128, offset: 32)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "StationAddress", scope: !855, file: !16, line: 188, baseType: !167, size: 128, offset: 160)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "TrafficClass", scope: !855, file: !16, line: 193, baseType: !89, size: 8, offset: 288)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "HopLimit", scope: !855, file: !16, line: 197, baseType: !89, size: 8, offset: 296)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "FlowLabel", scope: !855, file: !16, line: 202, baseType: !71, size: 32, offset: 320)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "ReceiveTimeout", scope: !855, file: !16, line: 208, baseType: !71, size: 32, offset: 352)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "TransmitTimeout", scope: !855, file: !16, line: 214, baseType: !71, size: 32, offset: 384)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "IsConfigured", scope: !849, file: !16, line: 326, baseType: !50, size: 8, offset: 480)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "AddressCount", scope: !849, file: !16, line: 330, baseType: !71, size: 32, offset: 512)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "AddressList", scope: !849, file: !16, line: 336, baseType: !871, size: 64, offset: 576)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP6_ADDRESS_INFO", file: !16, line: 223, baseType: !873)
!873 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_IP6_ADDRESS_INFO", file: !16, line: 220, size: 136, elements: !874)
!874 = !{!875, !876}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "Address", scope: !873, file: !16, line: 221, baseType: !167, size: 128)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "PrefixLength", scope: !873, file: !16, line: 222, baseType: !89, size: 8, offset: 128)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "GroupCount", scope: !849, file: !16, line: 341, baseType: !71, size: 32, offset: 640)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "GroupTable", scope: !849, file: !16, line: 347, baseType: !231, size: 64, offset: 704)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "RouteCount", scope: !849, file: !16, line: 352, baseType: !71, size: 32, offset: 768)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "RouteTable", scope: !849, file: !16, line: 356, baseType: !881, size: 64, offset: 832)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!882 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP6_ROUTE_TABLE", file: !16, line: 244, baseType: !883)
!883 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_IP6_ROUTE_TABLE", file: !16, line: 229, size: 264, elements: !884)
!884 = !{!885, !886, !887}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "Gateway", scope: !883, file: !16, line: 235, baseType: !167, size: 128)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "Destination", scope: !883, file: !16, line: 239, baseType: !167, size: 128, offset: 128)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "PrefixLength", scope: !883, file: !16, line: 243, baseType: !89, size: 8, offset: 256)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "NeighborCount", scope: !849, file: !16, line: 361, baseType: !71, size: 32, offset: 896)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "NeighborCache", scope: !849, file: !16, line: 366, baseType: !890, size: 64, offset: 960)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP6_NEIGHBOR_CACHE", file: !16, line: 290, baseType: !892)
!892 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_IP6_NEIGHBOR_CACHE", file: !16, line: 286, size: 416, elements: !893)
!893 = !{!894, !895, !896}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "Neighbor", scope: !892, file: !16, line: 287, baseType: !167, size: 128)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "LinkAddress", scope: !892, file: !16, line: 288, baseType: !305, size: 256, offset: 128)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "State", scope: !892, file: !16, line: 289, baseType: !897, size: 32, offset: 384)
!897 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP6_NEIGHBOR_STATE", file: !16, line: 279, baseType: !15)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "PrefixCount", scope: !849, file: !16, line: 371, baseType: !71, size: 32, offset: 1024)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "PrefixTable", scope: !849, file: !16, line: 376, baseType: !871, size: 64, offset: 1088)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "IcmpTypeCount", scope: !849, file: !16, line: 380, baseType: !71, size: 32, offset: 1152)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "IcmpTypeList", scope: !849, file: !16, line: 386, baseType: !902, size: 64, offset: 1216)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!903 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP6_ICMP_TYPE", file: !16, line: 300, baseType: !904)
!904 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_IP6_ICMP_TYPE", file: !16, line: 297, size: 16, elements: !905)
!905 = !{!906, !907}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !904, file: !16, line: 298, baseType: !89, size: 8)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "Code", scope: !904, file: !16, line: 299, baseType: !89, size: 8, offset: 8)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "Configure", scope: !825, file: !659, line: 563, baseType: !909, size: 64, offset: 64)
!909 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_UDP6_CONFIGURE", file: !659, line: 369, baseType: !910)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!911 = !DISubroutineType(types: !912)
!912 = !{!124, !823, !832}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "Groups", scope: !825, file: !659, line: 564, baseType: !914, size: 64, offset: 128)
!914 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_UDP6_GROUPS", file: !659, line: 399, baseType: !915)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!916 = !DISubroutineType(types: !917)
!917 = !{!124, !823, !50, !231}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "Transmit", scope: !825, file: !659, line: 565, baseType: !919, size: 64, offset: 192)
!919 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_UDP6_TRANSMIT", file: !659, line: 456, baseType: !920)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!921 = !DISubroutineType(types: !922)
!922 = !{!124, !823, !923}
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "Receive", scope: !825, file: !659, line: 566, baseType: !925, size: 64, offset: 256)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_UDP6_RECEIVE", file: !659, line: 495, baseType: !920)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "Cancel", scope: !825, file: !659, line: 567, baseType: !927, size: 64, offset: 320)
!927 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_UDP6_CANCEL", file: !659, line: 525, baseType: !920)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "Poll", scope: !825, file: !659, line: 568, baseType: !929, size: 64, offset: 384)
!929 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_UDP6_POLL", file: !659, line: 551, baseType: !930)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!931 = !DISubroutineType(types: !932)
!932 = !{!124, !823}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "Protocol", scope: !449, file: !448, line: 146, baseType: !701, size: 64, offset: 5952)
!934 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !449, file: !448, line: 148, size: 416, elements: !935)
!935 = !{!936, !937}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "Udp4", scope: !934, file: !448, line: 149, baseType: !714, size: 288)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "Udp6", scope: !934, file: !448, line: 150, baseType: !833, size: 416)
