; ModuleID = 'Dispatcher.bc'
source_filename = "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main/MdeModulePkg/Core/PiSmmCore/Dispatcher.c"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-windows-gnu"

%struct._LIST_ENTRY = type { %struct._LIST_ENTRY*, %struct._LIST_ENTRY* }
%struct._EFI_SECURITY_ARCH_PROTOCOL = type { i64 (%struct._EFI_SECURITY_ARCH_PROTOCOL*, i32, %struct.EFI_DEVICE_PATH_PROTOCOL*)* }
%struct.EFI_DEVICE_PATH_PROTOCOL = type { i8, i8, [2 x i8] }
%struct._EFI_SECURITY2_ARCH_PROTOCOL = type { i64 (%struct._EFI_SECURITY2_ARCH_PROTOCOL*, %struct.EFI_DEVICE_PATH_PROTOCOL*, i8*, i64, i8)* }

!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !52, globals: !829, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main/MdeModulePkg/Core/PiSmmCore/Dispatcher.c", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main/Build/OvmfX64/NOOPT_CLANGPDB/X64/MdeModulePkg/Core/PiSmmCore/PiSmmCore", checksumkind: CSK_MD5, checksum: "6876a634d8882ec90924c753d950bbf0")
!4 = !{!5, !13, !20, !39, !44, !47}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 117, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "MdePkg/Include/Uefi/UefiMultiPhase.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "321376346bf760b12510b9ae9d8f46f8")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12}
!9 = !DIEnumerator(name: "EfiResetCold", value: 0)
!10 = !DIEnumerator(name: "EfiResetWarm", value: 1)
!11 = !DIEnumerator(name: "EfiResetShutdown", value: 2)
!12 = !DIEnumerator(name: "EfiResetPlatformSpecific", value: 3)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !14, line: 29, baseType: !7, size: 32, elements: !15)
!14 = !DIFile(filename: "MdePkg/Include/Uefi/UefiSpec.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "dd07249351b00161d82576c2d3d57d19")
!15 = !{!16, !17, !18, !19}
!16 = !DIEnumerator(name: "AllocateAnyPages", value: 0)
!17 = !DIEnumerator(name: "AllocateMaxAddress", value: 1)
!18 = !DIEnumerator(name: "AllocateAddress", value: 2)
!19 = !DIEnumerator(name: "MaxAllocateType", value: 3)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 38, baseType: !7, size: 32, elements: !21)
!21 = !{!22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38}
!22 = !DIEnumerator(name: "EfiReservedMemoryType", value: 0)
!23 = !DIEnumerator(name: "EfiLoaderCode", value: 1)
!24 = !DIEnumerator(name: "EfiLoaderData", value: 2)
!25 = !DIEnumerator(name: "EfiBootServicesCode", value: 3)
!26 = !DIEnumerator(name: "EfiBootServicesData", value: 4)
!27 = !DIEnumerator(name: "EfiRuntimeServicesCode", value: 5)
!28 = !DIEnumerator(name: "EfiRuntimeServicesData", value: 6)
!29 = !DIEnumerator(name: "EfiConventionalMemory", value: 7)
!30 = !DIEnumerator(name: "EfiUnusableMemory", value: 8)
!31 = !DIEnumerator(name: "EfiACPIReclaimMemory", value: 9)
!32 = !DIEnumerator(name: "EfiACPIMemoryNVS", value: 10)
!33 = !DIEnumerator(name: "EfiMemoryMappedIO", value: 11)
!34 = !DIEnumerator(name: "EfiMemoryMappedIOPortSpace", value: 12)
!35 = !DIEnumerator(name: "EfiPalCode", value: 13)
!36 = !DIEnumerator(name: "EfiPersistentMemory", value: 14)
!37 = !DIEnumerator(name: "EfiUnacceptedMemoryType", value: 15)
!38 = !DIEnumerator(name: "EfiMaxMemoryType", value: 16)
!39 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !14, line: 506, baseType: !7, size: 32, elements: !40)
!40 = !{!41, !42, !43}
!41 = !DIEnumerator(name: "TimerCancel", value: 0)
!42 = !DIEnumerator(name: "TimerPeriodic", value: 1)
!43 = !DIEnumerator(name: "TimerRelative", value: 2)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !14, line: 1144, baseType: !7, size: 32, elements: !45)
!45 = !{!46}
!46 = !DIEnumerator(name: "EFI_NATIVE_INTERFACE", value: 0)
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !14, line: 1460, baseType: !7, size: 32, elements: !48)
!48 = !{!49, !50, !51}
!49 = !DIEnumerator(name: "AllHandles", value: 0)
!50 = !DIEnumerator(name: "ByRegisterNotify", value: 1)
!51 = !DIEnumerator(name: "ByProtocol", value: 2)
!52 = !{!53, !54, !60, !61, !185, !188, !191, !192, !189, !56, !194, !195, !196, !205, !206, !207, !817, !821}
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "RETURN_STATUS", file: !55, line: 1026, baseType: !56)
!55 = !DIFile(filename: "MdePkg/Include/Base.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "0c11ea3d1992443d8a8f590a064e50ff")
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINTN", file: !57, line: 211, baseType: !58)
!57 = !DIFile(filename: "MdePkg/Include/X64/ProcessorBind.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "ef2524a221fe61206fa09ec88dd4f59b")
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT64", file: !57, line: 162, baseType: !59)
!59 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT32", file: !57, line: 170, baseType: !7)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IMAGE_OPTIONAL_HEADER_UNION", file: !63, line: 797, baseType: !64)
!63 = !DIFile(filename: "MdePkg/Include/IndustryStandard/PeImage.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "5617df6c12f0ebe2c225debd76491c44")
!64 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "EFI_IMAGE_OPTIONAL_HEADER_UNION", file: !63, line: 793, size: 2112, elements: !65)
!65 = !{!66, !129, !169}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "Pe32", scope: !64, file: !63, line: 794, baseType: !67, size: 1984)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IMAGE_NT_HEADERS32", file: !63, line: 246, baseType: !68)
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_IMAGE_NT_HEADERS32", file: !63, line: 242, size: 1984, elements: !69)
!69 = !{!70, !71, !84}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", scope: !68, file: !63, line: 243, baseType: !60, size: 32)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "FileHeader", scope: !68, file: !63, line: 244, baseType: !72, size: 160, offset: 32)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IMAGE_FILE_HEADER", file: !63, line: 90, baseType: !73)
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_IMAGE_FILE_HEADER", file: !63, line: 82, size: 160, elements: !74)
!74 = !{!75, !78, !79, !80, !81, !82, !83}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "Machine", scope: !73, file: !63, line: 83, baseType: !76, size: 16)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT16", file: !57, line: 178, baseType: !77)
!77 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "NumberOfSections", scope: !73, file: !63, line: 84, baseType: !76, size: 16, offset: 16)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "TimeDateStamp", scope: !73, file: !63, line: 85, baseType: !60, size: 32, offset: 32)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "PointerToSymbolTable", scope: !73, file: !63, line: 86, baseType: !60, size: 32, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "NumberOfSymbols", scope: !73, file: !63, line: 87, baseType: !60, size: 32, offset: 96)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "SizeOfOptionalHeader", scope: !73, file: !63, line: 88, baseType: !76, size: 16, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "Characteristics", scope: !73, file: !63, line: 89, baseType: !76, size: 16, offset: 144)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "OptionalHeader", scope: !68, file: !63, line: 245, baseType: !85, size: 1792, offset: 192)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IMAGE_OPTIONAL_HEADER32", file: !63, line: 186, baseType: !86)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_IMAGE_OPTIONAL_HEADER32", file: !63, line: 148, size: 1792, elements: !87)
!87 = !{!88, !89, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "Magic", scope: !86, file: !63, line: 152, baseType: !76, size: 16)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "MajorLinkerVersion", scope: !86, file: !63, line: 153, baseType: !90, size: 8, offset: 16)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT8", file: !57, line: 196, baseType: !91)
!91 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "MinorLinkerVersion", scope: !86, file: !63, line: 154, baseType: !90, size: 8, offset: 24)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "SizeOfCode", scope: !86, file: !63, line: 155, baseType: !60, size: 32, offset: 32)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "SizeOfInitializedData", scope: !86, file: !63, line: 156, baseType: !60, size: 32, offset: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "SizeOfUninitializedData", scope: !86, file: !63, line: 157, baseType: !60, size: 32, offset: 96)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "AddressOfEntryPoint", scope: !86, file: !63, line: 158, baseType: !60, size: 32, offset: 128)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "BaseOfCode", scope: !86, file: !63, line: 159, baseType: !60, size: 32, offset: 160)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "BaseOfData", scope: !86, file: !63, line: 160, baseType: !60, size: 32, offset: 192)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "ImageBase", scope: !86, file: !63, line: 164, baseType: !60, size: 32, offset: 224)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "SectionAlignment", scope: !86, file: !63, line: 165, baseType: !60, size: 32, offset: 256)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "FileAlignment", scope: !86, file: !63, line: 166, baseType: !60, size: 32, offset: 288)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "MajorOperatingSystemVersion", scope: !86, file: !63, line: 167, baseType: !76, size: 16, offset: 320)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "MinorOperatingSystemVersion", scope: !86, file: !63, line: 168, baseType: !76, size: 16, offset: 336)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "MajorImageVersion", scope: !86, file: !63, line: 169, baseType: !76, size: 16, offset: 352)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "MinorImageVersion", scope: !86, file: !63, line: 170, baseType: !76, size: 16, offset: 368)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "MajorSubsystemVersion", scope: !86, file: !63, line: 171, baseType: !76, size: 16, offset: 384)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "MinorSubsystemVersion", scope: !86, file: !63, line: 172, baseType: !76, size: 16, offset: 400)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "Win32VersionValue", scope: !86, file: !63, line: 173, baseType: !60, size: 32, offset: 416)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "SizeOfImage", scope: !86, file: !63, line: 174, baseType: !60, size: 32, offset: 448)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "SizeOfHeaders", scope: !86, file: !63, line: 175, baseType: !60, size: 32, offset: 480)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "CheckSum", scope: !86, file: !63, line: 176, baseType: !60, size: 32, offset: 512)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "Subsystem", scope: !86, file: !63, line: 177, baseType: !76, size: 16, offset: 544)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "DllCharacteristics", scope: !86, file: !63, line: 178, baseType: !76, size: 16, offset: 560)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "SizeOfStackReserve", scope: !86, file: !63, line: 179, baseType: !60, size: 32, offset: 576)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "SizeOfStackCommit", scope: !86, file: !63, line: 180, baseType: !60, size: 32, offset: 608)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "SizeOfHeapReserve", scope: !86, file: !63, line: 181, baseType: !60, size: 32, offset: 640)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "SizeOfHeapCommit", scope: !86, file: !63, line: 182, baseType: !60, size: 32, offset: 672)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "LoaderFlags", scope: !86, file: !63, line: 183, baseType: !60, size: 32, offset: 704)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "NumberOfRvaAndSizes", scope: !86, file: !63, line: 184, baseType: !60, size: 32, offset: 736)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "DataDirectory", scope: !86, file: !63, line: 185, baseType: !121, size: 1024, offset: 768)
!121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !122, size: 1024, elements: !127)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IMAGE_DATA_DIRECTORY", file: !63, line: 118, baseType: !123)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_IMAGE_DATA_DIRECTORY", file: !63, line: 115, size: 64, elements: !124)
!124 = !{!125, !126}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "VirtualAddress", scope: !123, file: !63, line: 116, baseType: !60, size: 32)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !123, file: !63, line: 117, baseType: !60, size: 32, offset: 32)
!127 = !{!128}
!128 = !DISubrange(count: 16)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "Pe32Plus", scope: !64, file: !63, line: 795, baseType: !130, size: 2112)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IMAGE_NT_HEADERS64", file: !63, line: 258, baseType: !131)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_IMAGE_NT_HEADERS64", file: !63, line: 254, size: 2112, elements: !132)
!132 = !{!133, !134, !135}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", scope: !131, file: !63, line: 255, baseType: !60, size: 32)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "FileHeader", scope: !131, file: !63, line: 256, baseType: !72, size: 160, offset: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "OptionalHeader", scope: !131, file: !63, line: 257, baseType: !136, size: 1920, offset: 192)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IMAGE_OPTIONAL_HEADER64", file: !63, line: 236, baseType: !137)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_IMAGE_OPTIONAL_HEADER64", file: !63, line: 199, size: 1920, elements: !138)
!138 = !{!139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "Magic", scope: !137, file: !63, line: 203, baseType: !76, size: 16)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "MajorLinkerVersion", scope: !137, file: !63, line: 204, baseType: !90, size: 8, offset: 16)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "MinorLinkerVersion", scope: !137, file: !63, line: 205, baseType: !90, size: 8, offset: 24)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "SizeOfCode", scope: !137, file: !63, line: 206, baseType: !60, size: 32, offset: 32)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "SizeOfInitializedData", scope: !137, file: !63, line: 207, baseType: !60, size: 32, offset: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "SizeOfUninitializedData", scope: !137, file: !63, line: 208, baseType: !60, size: 32, offset: 96)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "AddressOfEntryPoint", scope: !137, file: !63, line: 209, baseType: !60, size: 32, offset: 128)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "BaseOfCode", scope: !137, file: !63, line: 210, baseType: !60, size: 32, offset: 160)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "ImageBase", scope: !137, file: !63, line: 214, baseType: !58, size: 64, offset: 192)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "SectionAlignment", scope: !137, file: !63, line: 215, baseType: !60, size: 32, offset: 256)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "FileAlignment", scope: !137, file: !63, line: 216, baseType: !60, size: 32, offset: 288)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "MajorOperatingSystemVersion", scope: !137, file: !63, line: 217, baseType: !76, size: 16, offset: 320)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "MinorOperatingSystemVersion", scope: !137, file: !63, line: 218, baseType: !76, size: 16, offset: 336)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "MajorImageVersion", scope: !137, file: !63, line: 219, baseType: !76, size: 16, offset: 352)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "MinorImageVersion", scope: !137, file: !63, line: 220, baseType: !76, size: 16, offset: 368)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "MajorSubsystemVersion", scope: !137, file: !63, line: 221, baseType: !76, size: 16, offset: 384)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "MinorSubsystemVersion", scope: !137, file: !63, line: 222, baseType: !76, size: 16, offset: 400)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "Win32VersionValue", scope: !137, file: !63, line: 223, baseType: !60, size: 32, offset: 416)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "SizeOfImage", scope: !137, file: !63, line: 224, baseType: !60, size: 32, offset: 448)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "SizeOfHeaders", scope: !137, file: !63, line: 225, baseType: !60, size: 32, offset: 480)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "CheckSum", scope: !137, file: !63, line: 226, baseType: !60, size: 32, offset: 512)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "Subsystem", scope: !137, file: !63, line: 227, baseType: !76, size: 16, offset: 544)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "DllCharacteristics", scope: !137, file: !63, line: 228, baseType: !76, size: 16, offset: 560)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "SizeOfStackReserve", scope: !137, file: !63, line: 229, baseType: !58, size: 64, offset: 576)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "SizeOfStackCommit", scope: !137, file: !63, line: 230, baseType: !58, size: 64, offset: 640)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "SizeOfHeapReserve", scope: !137, file: !63, line: 231, baseType: !58, size: 64, offset: 704)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "SizeOfHeapCommit", scope: !137, file: !63, line: 232, baseType: !58, size: 64, offset: 768)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "LoaderFlags", scope: !137, file: !63, line: 233, baseType: !60, size: 32, offset: 832)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "NumberOfRvaAndSizes", scope: !137, file: !63, line: 234, baseType: !60, size: 32, offset: 864)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "DataDirectory", scope: !137, file: !63, line: 235, baseType: !121, size: 1024, offset: 896)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "Te", scope: !64, file: !63, line: 796, baseType: !170, size: 320)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TE_IMAGE_HEADER", file: !63, line: 780, baseType: !171)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_TE_IMAGE_HEADER", file: !63, line: 770, size: 320, elements: !172)
!172 = !{!173, !174, !175, !176, !177, !178, !179, !180, !181}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", scope: !171, file: !63, line: 771, baseType: !76, size: 16)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "Machine", scope: !171, file: !63, line: 772, baseType: !76, size: 16, offset: 16)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "NumberOfSections", scope: !171, file: !63, line: 773, baseType: !90, size: 8, offset: 32)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "Subsystem", scope: !171, file: !63, line: 774, baseType: !90, size: 8, offset: 40)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "StrippedSize", scope: !171, file: !63, line: 775, baseType: !76, size: 16, offset: 48)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "AddressOfEntryPoint", scope: !171, file: !63, line: 776, baseType: !60, size: 32, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "BaseOfCode", scope: !171, file: !63, line: 777, baseType: !60, size: 32, offset: 96)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "ImageBase", scope: !171, file: !63, line: 778, baseType: !58, size: 64, offset: 128)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "DataDirectory", scope: !171, file: !63, line: 779, baseType: !182, size: 128, offset: 192)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !122, size: 128, elements: !183)
!183 = !{!184}
!184 = !DISubrange(count: 2)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHAR8", file: !57, line: 200, baseType: !187)
!187 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTN", file: !57, line: 216, baseType: !189)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT64", file: !57, line: 166, baseType: !190)
!190 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_PHYSICAL_ADDRESS", file: !193, line: 50, baseType: !58)
!193 = !DIFile(filename: "MdePkg/Include/Uefi/UefiBaseType.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "dbec48e65949dff122bc920c9d9d9c6a")
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "BOOLEAN", file: !57, line: 192, baseType: !91)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DEVICE_PATH_PROTOCOL", file: !198, line: 58, baseType: !199)
!198 = !DIFile(filename: "MdePkg/Include/Protocol/DevicePath.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "6b6d593d171f69b933a87911e52d4607")
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_DEVICE_PATH_PROTOCOL", file: !198, line: 43, size: 32, elements: !200)
!200 = !{!201, !202, !203}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !199, file: !198, line: 44, baseType: !90, size: 8)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "SubType", scope: !199, file: !198, line: 51, baseType: !90, size: 8, offset: 8)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !199, file: !198, line: 56, baseType: !204, size: 16, offset: 16)
!204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 16, elements: !183)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SMM_DRIVER_ENTRY", file: !209, line: 142, baseType: !210)
!209 = !DIFile(filename: "MdeModulePkg/Core/PiSmmCore/PiSmmCore.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "e4edf3842107ce4b1893f0150320562f")
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_SMM_DRIVER_ENTRY", file: !209, line: 103, size: 2112, elements: !211)
!211 = !{!212, !213, !220, !221, !223, !235, !236, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !811, !813, !814, !815, !816}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", scope: !210, file: !209, line: 104, baseType: !56, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "Link", scope: !210, file: !209, line: 105, baseType: !214, size: 128, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "LIST_ENTRY", file: !55, line: 242, baseType: !215)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_LIST_ENTRY", file: !55, line: 247, size: 128, elements: !216)
!216 = !{!217, !219}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "ForwardLink", scope: !215, file: !55, line: 248, baseType: !218, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "BackLink", scope: !215, file: !55, line: 249, baseType: !218, size: 64, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "ScheduledLink", scope: !210, file: !209, line: 107, baseType: !214, size: 128, offset: 192)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "FvHandle", scope: !210, file: !209, line: 109, baseType: !222, size: 64, offset: 320)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_HANDLE", file: !193, line: 33, baseType: !53)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "FileName", scope: !210, file: !209, line: 110, baseType: !224, size: 128, offset: 384)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GUID", file: !193, line: 25, baseType: !225)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "GUID", file: !55, line: 218, baseType: !226)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GUID", file: !55, line: 213, size: 128, elements: !227)
!227 = !{!228, !229, !230, !231}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "Data1", scope: !226, file: !55, line: 214, baseType: !60, size: 32)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "Data2", scope: !226, file: !55, line: 215, baseType: !76, size: 16, offset: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "Data3", scope: !226, file: !55, line: 216, baseType: !76, size: 16, offset: 48)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "Data4", scope: !226, file: !55, line: 217, baseType: !232, size: 64, offset: 64)
!232 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 64, elements: !233)
!233 = !{!234}
!234 = !DISubrange(count: 8)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "FvFileDevicePath", scope: !210, file: !209, line: 111, baseType: !196, size: 64, offset: 512)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "Fv", scope: !210, file: !209, line: 112, baseType: !237, size: 64, offset: 576)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FIRMWARE_VOLUME2_PROTOCOL", file: !239, line: 22, baseType: !240)
!239 = !DIFile(filename: "MdePkg/Include/Protocol/FirmwareVolume2.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "e17565cad68c5de540c8e91ee2a96221")
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_FIRMWARE_VOLUME2_PROTOCOL", file: !239, line: 722, size: 640, elements: !241)
!241 = !{!242, !252, !254, !268, !274, !290, !295, !296, !297, !302}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "GetVolumeAttributes", scope: !240, file: !239, line: 723, baseType: !243, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FV_GET_ATTRIBUTES", file: !239, line: 106, baseType: !244)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DISubroutineType(types: !246)
!246 = !{!247, !248, !250}
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_STATUS", file: !193, line: 29, baseType: !54)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !238)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FV_ATTRIBUTES", file: !239, line: 27, baseType: !58)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "SetVolumeAttributes", scope: !240, file: !239, line: 724, baseType: !253, size: 64, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FV_SET_ATTRIBUTES", file: !239, line: 200, baseType: !244)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "ReadFile", scope: !240, file: !239, line: 725, baseType: !255, size: 64, offset: 128)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FV_READ_FILE", file: !239, line: 294, baseType: !256)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DISubroutineType(types: !258)
!258 = !{!247, !248, !259, !195, !206, !261, !264, !267}
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !224)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FV_FILETYPE", file: !263, line: 50, baseType: !90)
!263 = !DIFile(filename: "MdePkg/Include/Pi/PiFirmwareFile.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "942fe99f769f631cab0d641a8d548f4d")
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FV_FILE_ATTRIBUTES", file: !266, line: 18, baseType: !60)
!266 = !DIFile(filename: "MdePkg/Include/Pi/PiFirmwareVolume.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "9a02bea8b9edc1b887ae684c8d405b44")
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "ReadSection", scope: !240, file: !239, line: 726, baseType: !269, size: 64, offset: 192)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FV_READ_SECTION", file: !239, line: 400, baseType: !270)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!247, !248, !259, !273, !56, !195, !206, !267}
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SECTION_TYPE", file: !263, line: 193, baseType: !90)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "WriteFile", scope: !240, file: !239, line: 727, baseType: !275, size: 64, offset: 256)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FV_WRITE_FILE", file: !239, line: 511, baseType: !276)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DISubroutineType(types: !278)
!278 = !{!247, !248, !60, !279, !280}
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FV_WRITE_POLICY", file: !239, line: 413, baseType: !60)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FV_WRITE_FILE_DATA", file: !239, line: 441, baseType: !282)
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_FV_WRITE_FILE_DATA", file: !239, line: 420, size: 256, elements: !283)
!283 = !{!284, !286, !287, !288, !289}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "NameGuid", scope: !282, file: !239, line: 424, baseType: !285, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !282, file: !239, line: 428, baseType: !262, size: 8, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "FileAttributes", scope: !282, file: !239, line: 432, baseType: !265, size: 32, offset: 96)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "Buffer", scope: !282, file: !239, line: 436, baseType: !53, size: 64, offset: 128)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "BufferSize", scope: !282, file: !239, line: 440, baseType: !60, size: 32, offset: 192)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "GetNextFile", scope: !240, file: !239, line: 728, baseType: !291, size: 64, offset: 320)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FV_GET_NEXT_FILE", file: !239, line: 595, baseType: !292)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DISubroutineType(types: !294)
!294 = !{!247, !248, !53, !261, !285, !264, !206}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "KeySize", scope: !240, file: !239, line: 735, baseType: !60, size: 32, offset: 384)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "ParentHandle", scope: !240, file: !239, line: 740, baseType: !222, size: 64, offset: 448)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "GetInfo", scope: !240, file: !239, line: 741, baseType: !298, size: 64, offset: 512)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FV_GET_INFO", file: !239, line: 653, baseType: !299)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DISubroutineType(types: !301)
!301 = !{!247, !248, !259, !206, !53}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "SetInfo", scope: !240, file: !239, line: 742, baseType: !303, size: 64, offset: 576)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FV_SET_INFO", file: !239, line: 702, baseType: !304)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DISubroutineType(types: !306)
!306 = !{!247, !248, !259, !56, !307}
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "Depex", scope: !210, file: !209, line: 114, baseType: !53, size: 64, offset: 640)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "DepexSize", scope: !210, file: !209, line: 115, baseType: !56, size: 64, offset: 704)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "Before", scope: !210, file: !209, line: 117, baseType: !194, size: 8, offset: 768)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "After", scope: !210, file: !209, line: 118, baseType: !194, size: 8, offset: 776)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "BeforeAfterGuid", scope: !210, file: !209, line: 119, baseType: !224, size: 128, offset: 800)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "Dependent", scope: !210, file: !209, line: 121, baseType: !194, size: 8, offset: 928)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "Scheduled", scope: !210, file: !209, line: 122, baseType: !194, size: 8, offset: 936)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "Initialized", scope: !210, file: !209, line: 123, baseType: !194, size: 8, offset: 944)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "DepexProtocolError", scope: !210, file: !209, line: 124, baseType: !194, size: 8, offset: 952)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "ImageHandle", scope: !210, file: !209, line: 126, baseType: !222, size: 64, offset: 960)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "LoadedImage", scope: !210, file: !209, line: 127, baseType: !320, size: 64, offset: 1024)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_LOADED_IMAGE_PROTOCOL", file: !322, line: 72, baseType: !323)
!322 = !DIFile(filename: "MdePkg/Include/Protocol/LoadedImage.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "0bfc90f5c05009801c3af3d54bff9caa")
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_LOADED_IMAGE_PROTOCOL", file: !322, line: 43, size: 768, elements: !324)
!324 = !{!325, !326, !327, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "Revision", scope: !323, file: !322, line: 44, baseType: !60, size: 32)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "ParentHandle", scope: !323, file: !322, line: 46, baseType: !222, size: 64, offset: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "SystemTable", scope: !323, file: !322, line: 48, baseType: !328, size: 64, offset: 128)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SYSTEM_TABLE", file: !14, line: 2038, baseType: !330)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_SYSTEM_TABLE", file: !14, line: 1977, size: 960, elements: !331)
!331 = !{!332, !341, !344, !345, !346, !370, !371, !426, !427, !428, !550, !793, !794}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "Hdr", scope: !330, file: !14, line: 1981, baseType: !333, size: 192)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TABLE_HEADER", file: !6, line: 177, baseType: !334)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_TABLE_HEADER", file: !6, line: 150, size: 192, elements: !335)
!335 = !{!336, !337, !338, !339, !340}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", scope: !334, file: !6, line: 156, baseType: !58, size: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "Revision", scope: !334, file: !6, line: 163, baseType: !60, size: 32, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "HeaderSize", scope: !334, file: !6, line: 167, baseType: !60, size: 32, offset: 96)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "CRC32", scope: !334, file: !6, line: 172, baseType: !60, size: 32, offset: 128)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved", scope: !334, file: !6, line: 176, baseType: !60, size: 32, offset: 160)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "FirmwareVendor", scope: !330, file: !14, line: 1986, baseType: !342, size: 64, offset: 192)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHAR16", file: !57, line: 183, baseType: !77)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "FirmwareRevision", scope: !330, file: !14, line: 1991, baseType: !60, size: 32, offset: 256)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "ConsoleInHandle", scope: !330, file: !14, line: 1996, baseType: !222, size: 64, offset: 320)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "ConIn", scope: !330, file: !14, line: 2001, baseType: !347, size: 64, offset: 384)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_TEXT_INPUT_PROTOCOL", file: !349, line: 20, baseType: !350)
!349 = !DIFile(filename: "MdePkg/Include/Protocol/SimpleTextIn.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "239cf4f3dddb25a8596c70fa738413fd")
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_SIMPLE_TEXT_INPUT_PROTOCOL", file: !349, line: 116, size: 192, elements: !351)
!351 = !{!352, !357, !368}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "Reset", scope: !350, file: !349, line: 117, baseType: !353, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_INPUT_RESET", file: !349, line: 86, baseType: !354)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DISubroutineType(types: !356)
!356 = !{!247, !347, !194}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "ReadKeyStroke", scope: !350, file: !349, line: 118, baseType: !358, size: 64, offset: 64)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_INPUT_READ_KEY", file: !349, line: 107, baseType: !359)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DISubroutineType(types: !361)
!361 = !{!247, !347, !362}
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_INPUT_KEY", file: !349, line: 38, baseType: !364)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_INPUT_KEY", file: !349, line: 35, size: 32, elements: !365)
!365 = !{!366, !367}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "ScanCode", scope: !364, file: !349, line: 36, baseType: !76, size: 16)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "UnicodeChar", scope: !364, file: !349, line: 37, baseType: !343, size: 16, offset: 16)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "WaitForKey", scope: !350, file: !349, line: 122, baseType: !369, size: 64, offset: 128)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_EVENT", file: !193, line: 37, baseType: !53)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "ConsoleOutHandle", scope: !330, file: !14, line: 2005, baseType: !222, size: 64, offset: 448)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "ConOut", scope: !330, file: !14, line: 2010, baseType: !372, size: 64, offset: 512)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_TEXT_OUTPUT_PROTOCOL", file: !374, line: 27, baseType: !375)
!374 = !DIFile(filename: "MdePkg/Include/Protocol/SimpleTextOut.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "685bec042927ad46d31bf42ae7f6ddcd")
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_SIMPLE_TEXT_OUTPUT_PROTOCOL", file: !374, line: 387, size: 640, elements: !376)
!376 = !{!377, !382, !387, !389, !394, !399, !401, !406, !411, !413}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "Reset", scope: !375, file: !374, line: 388, baseType: !378, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TEXT_RESET", file: !374, line: 167, baseType: !379)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DISubroutineType(types: !381)
!381 = !{!247, !372, !194}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "OutputString", scope: !375, file: !374, line: 390, baseType: !383, size: 64, offset: 64)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TEXT_STRING", file: !374, line: 192, baseType: !384)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DISubroutineType(types: !386)
!386 = !{!247, !372, !342}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "TestString", scope: !375, file: !374, line: 391, baseType: !388, size: 64, offset: 128)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TEXT_TEST_STRING", file: !374, line: 213, baseType: !384)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "QueryMode", scope: !375, file: !374, line: 393, baseType: !390, size: 64, offset: 192)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TEXT_QUERY_MODE", file: !374, line: 236, baseType: !391)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DISubroutineType(types: !393)
!393 = !{!247, !372, !56, !206, !206}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "SetMode", scope: !375, file: !374, line: 394, baseType: !395, size: 64, offset: 256)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TEXT_SET_MODE", file: !374, line: 256, baseType: !396)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DISubroutineType(types: !398)
!398 = !{!247, !372, !56}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "SetAttribute", scope: !375, file: !374, line: 395, baseType: !400, size: 64, offset: 320)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TEXT_SET_ATTRIBUTE", file: !374, line: 277, baseType: !396)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "ClearScreen", scope: !375, file: !374, line: 397, baseType: !402, size: 64, offset: 384)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TEXT_CLEAR_SCREEN", file: !374, line: 295, baseType: !403)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DISubroutineType(types: !405)
!405 = !{!247, !372}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "SetCursorPosition", scope: !375, file: !374, line: 398, baseType: !407, size: 64, offset: 448)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TEXT_SET_CURSOR_POSITION", file: !374, line: 318, baseType: !408)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DISubroutineType(types: !410)
!410 = !{!247, !372, !56, !56}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "EnableCursor", scope: !375, file: !374, line: 399, baseType: !412, size: 64, offset: 512)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TEXT_ENABLE_CURSOR", file: !374, line: 340, baseType: !379)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "Mode", scope: !375, file: !374, line: 404, baseType: !414, size: 64, offset: 576)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_TEXT_OUTPUT_MODE", file: !374, line: 379, baseType: !416)
!416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_SIMPLE_TEXT_OUTPUT_MODE", file: !374, line: 349, size: 192, elements: !417)
!417 = !{!418, !421, !422, !423, !424, !425}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "MaxMode", scope: !416, file: !374, line: 353, baseType: !419, size: 32)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT32", file: !57, line: 174, baseType: !420)
!420 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "Mode", scope: !416, file: !374, line: 362, baseType: !419, size: 32, offset: 32)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "Attribute", scope: !416, file: !374, line: 366, baseType: !419, size: 32, offset: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "CursorColumn", scope: !416, file: !374, line: 370, baseType: !419, size: 32, offset: 96)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "CursorRow", scope: !416, file: !374, line: 374, baseType: !419, size: 32, offset: 128)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "CursorVisible", scope: !416, file: !374, line: 378, baseType: !194, size: 8, offset: 160)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "StandardErrorHandle", scope: !330, file: !14, line: 2015, baseType: !222, size: 64, offset: 576)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "StdErr", scope: !330, file: !14, line: 2020, baseType: !372, size: 64, offset: 640)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "RuntimeServices", scope: !330, file: !14, line: 2024, baseType: !429, size: 64, offset: 704)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_RUNTIME_SERVICES", file: !14, line: 1856, baseType: !431)
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_RUNTIME_SERVICES", file: !14, line: 1813, size: 1088, elements: !432)
!432 = !{!433, !434, !463, !468, !474, !479, !494, !499, !504, !509, !514, !519, !525, !539, !545}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "Hdr", scope: !431, file: !14, line: 1817, baseType: !333, size: 192)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "GetTime", scope: !431, file: !14, line: 1822, baseType: !435, size: 64, offset: 192)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GET_TIME", file: !14, line: 801, baseType: !436)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DISubroutineType(types: !438)
!438 = !{!247, !439, !456}
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TIME", file: !193, line: 80, baseType: !441)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_TIME", file: !193, line: 68, size: 128, elements: !442)
!442 = !{!443, !444, !445, !446, !447, !448, !449, !450, !451, !454, !455}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "Year", scope: !441, file: !193, line: 69, baseType: !76, size: 16)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "Month", scope: !441, file: !193, line: 70, baseType: !90, size: 8, offset: 16)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "Day", scope: !441, file: !193, line: 71, baseType: !90, size: 8, offset: 24)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "Hour", scope: !441, file: !193, line: 72, baseType: !90, size: 8, offset: 32)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "Minute", scope: !441, file: !193, line: 73, baseType: !90, size: 8, offset: 40)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "Second", scope: !441, file: !193, line: 74, baseType: !90, size: 8, offset: 48)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "Pad1", scope: !441, file: !193, line: 75, baseType: !90, size: 8, offset: 56)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "Nanosecond", scope: !441, file: !193, line: 76, baseType: !60, size: 32, offset: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "TimeZone", scope: !441, file: !193, line: 77, baseType: !452, size: 16, offset: 96)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT16", file: !57, line: 187, baseType: !453)
!453 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "Daylight", scope: !441, file: !193, line: 78, baseType: !90, size: 8, offset: 112)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "Pad2", scope: !441, file: !193, line: 79, baseType: !90, size: 8, offset: 120)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TIME_CAPABILITIES", file: !14, line: 784, baseType: !458)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_TIME_CAPABILITIES", file: !14, line: 761, size: 96, elements: !459)
!459 = !{!460, !461, !462}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "Resolution", scope: !458, file: !14, line: 768, baseType: !60, size: 32)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "Accuracy", scope: !458, file: !14, line: 775, baseType: !60, size: 32, offset: 32)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "SetsToZero", scope: !458, file: !14, line: 783, baseType: !194, size: 8, offset: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "SetTime", scope: !431, file: !14, line: 1823, baseType: !464, size: 64, offset: 256)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SET_TIME", file: !14, line: 818, baseType: !465)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DISubroutineType(types: !467)
!467 = !{!247, !439}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "GetWakeupTime", scope: !431, file: !14, line: 1824, baseType: !469, size: 64, offset: 320)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GET_WAKEUP_TIME", file: !14, line: 839, baseType: !470)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DISubroutineType(types: !472)
!472 = !{!247, !473, !473, !439}
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "SetWakeupTime", scope: !431, file: !14, line: 1825, baseType: !475, size: 64, offset: 384)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SET_WAKEUP_TIME", file: !14, line: 861, baseType: !476)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DISubroutineType(types: !478)
!478 = !{!247, !194, !439}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "SetVirtualAddressMap", scope: !431, file: !14, line: 1830, baseType: !480, size: 64, offset: 448)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SET_VIRTUAL_ADDRESS_MAP", file: !14, line: 312, baseType: !481)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DISubroutineType(types: !483)
!483 = !{!247, !56, !56, !60, !484}
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MEMORY_DESCRIPTOR", file: !14, line: 160, baseType: !486)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_MEMORY_DESCRIPTOR", file: !14, line: 128, size: 320, elements: !487)
!487 = !{!488, !489, !490, !492, !493}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !486, file: !14, line: 134, baseType: !60, size: 32)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "PhysicalStart", scope: !486, file: !14, line: 140, baseType: !192, size: 64, offset: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "VirtualStart", scope: !486, file: !14, line: 146, baseType: !491, size: 64, offset: 128)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_VIRTUAL_ADDRESS", file: !193, line: 55, baseType: !58)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "NumberOfPages", scope: !486, file: !14, line: 153, baseType: !58, size: 64, offset: 192)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "Attribute", scope: !486, file: !14, line: 159, baseType: !58, size: 64, offset: 256)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "ConvertPointer", scope: !431, file: !14, line: 1831, baseType: !495, size: 64, offset: 512)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CONVERT_POINTER", file: !14, line: 407, baseType: !496)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DISubroutineType(types: !498)
!498 = !{!247, !56, !195}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "GetVariable", scope: !431, file: !14, line: 1836, baseType: !500, size: 64, offset: 576)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GET_VARIABLE", file: !14, line: 671, baseType: !501)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DISubroutineType(types: !503)
!503 = !{!247, !342, !285, !267, !206, !53}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "GetNextVariableName", scope: !431, file: !14, line: 1837, baseType: !505, size: 64, offset: 640)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GET_NEXT_VARIABLE_NAME", file: !14, line: 707, baseType: !506)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DISubroutineType(types: !508)
!508 = !{!247, !206, !342, !285}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "SetVariable", scope: !431, file: !14, line: 1838, baseType: !510, size: 64, offset: 704)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SET_VARIABLE", file: !14, line: 749, baseType: !511)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = !DISubroutineType(types: !513)
!513 = !{!247, !342, !285, !60, !56, !53}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "GetNextHighMonotonicCount", scope: !431, file: !14, line: 1843, baseType: !515, size: 64, offset: 768)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GET_NEXT_HIGH_MONO_COUNT", file: !14, line: 1082, baseType: !516)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DISubroutineType(types: !518)
!518 = !{!247, !267}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "ResetSystem", scope: !431, file: !14, line: 1844, baseType: !520, size: 64, offset: 832)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_RESET_SYSTEM", file: !14, line: 1047, baseType: !521)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DISubroutineType(types: !523)
!523 = !{null, !524, !247, !56, !53}
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_RESET_TYPE", file: !6, line: 145, baseType: !5)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "UpdateCapsule", scope: !431, file: !14, line: 1849, baseType: !526, size: 64, offset: 896)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_UPDATE_CAPSULE", file: !14, line: 1708, baseType: !527)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DISubroutineType(types: !529)
!529 = !{!247, !530, !56, !192}
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CAPSULE_HEADER", file: !14, line: 1654, baseType: !533)
!533 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_CAPSULE_HEADER", file: !14, line: 1633, size: 224, elements: !534)
!534 = !{!535, !536, !537, !538}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "CapsuleGuid", scope: !533, file: !14, line: 1637, baseType: !224, size: 128)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "HeaderSize", scope: !533, file: !14, line: 1643, baseType: !60, size: 32, offset: 128)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !533, file: !14, line: 1649, baseType: !60, size: 32, offset: 160)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "CapsuleImageSize", scope: !533, file: !14, line: 1653, baseType: !60, size: 32, offset: 192)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "QueryCapsuleCapabilities", scope: !431, file: !14, line: 1850, baseType: !540, size: 64, offset: 960)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_QUERY_CAPSULE_CAPABILITIES", file: !14, line: 1739, baseType: !541)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DISubroutineType(types: !543)
!543 = !{!247, !530, !56, !191, !544}
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "QueryVariableInfo", scope: !431, file: !14, line: 1855, baseType: !546, size: 64, offset: 1024)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_QUERY_VARIABLE_INFO", file: !14, line: 1770, baseType: !547)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DISubroutineType(types: !549)
!549 = !{!247, !60, !191, !191, !191}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "BootServices", scope: !330, file: !14, line: 2028, baseType: !551, size: 64, offset: 768)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_BOOT_SERVICES", file: !14, line: 1957, baseType: !553)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_BOOT_SERVICES", file: !14, line: 1864, size: 3008, elements: !554)
!554 = !{!555, !556, !562, !567, !575, !580, !585, !590, !595, !605, !611, !616, !621, !623, !625, !632, !637, !642, !647, !648, !653, !659, !665, !670, !675, !681, !686, !691, !696, !701, !706, !711, !716, !721, !726, !731, !745, !752, !758, !763, !768, !773, !778, !783, !788}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "Hdr", scope: !553, file: !14, line: 1868, baseType: !333, size: 192)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "RaiseTPL", scope: !553, file: !14, line: 1873, baseType: !557, size: 64, offset: 192)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_RAISE_TPL", file: !14, line: 629, baseType: !558)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DISubroutineType(types: !560)
!560 = !{!561, !561}
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TPL", file: !193, line: 41, baseType: !56)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "RestoreTPL", scope: !553, file: !14, line: 1874, baseType: !563, size: 64, offset: 256)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_RESTORE_TPL", file: !14, line: 641, baseType: !564)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DISubroutineType(types: !566)
!566 = !{null, !561}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "AllocatePages", scope: !553, file: !14, line: 1879, baseType: !568, size: 64, offset: 320)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_ALLOCATE_PAGES", file: !14, line: 188, baseType: !569)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = !DISubroutineType(types: !571)
!571 = !{!247, !572, !573, !56, !574}
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_ALLOCATE_TYPE", file: !14, line: 47, baseType: !13)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MEMORY_TYPE", file: !6, line: 112, baseType: !20)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "FreePages", scope: !553, file: !14, line: 1880, baseType: !576, size: 64, offset: 384)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FREE_PAGES", file: !14, line: 209, baseType: !577)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = !DISubroutineType(types: !579)
!579 = !{!247, !192, !56}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "GetMemoryMap", scope: !553, file: !14, line: 1881, baseType: !581, size: 64, offset: 448)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GET_MEMORY_MAP", file: !14, line: 241, baseType: !582)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DISubroutineType(types: !584)
!584 = !{!247, !206, !484, !206, !206, !267}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "AllocatePool", scope: !553, file: !14, line: 1882, baseType: !586, size: 64, offset: 512)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_ALLOCATE_POOL", file: !14, line: 270, baseType: !587)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = !DISubroutineType(types: !589)
!589 = !{!247, !573, !56, !195}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "FreePool", scope: !553, file: !14, line: 1883, baseType: !591, size: 64, offset: 576)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FREE_POOL", file: !14, line: 287, baseType: !592)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = !DISubroutineType(types: !594)
!594 = !{!247, !53}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "CreateEvent", scope: !553, file: !14, line: 1888, baseType: !596, size: 64, offset: 640)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CREATE_EVENT", file: !14, line: 465, baseType: !597)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DISubroutineType(types: !599)
!599 = !{!247, !60, !561, !600, !53, !604}
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_EVENT_NOTIFY", file: !14, line: 442, baseType: !601)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DISubroutineType(types: !603)
!603 = !{null, !369, !53}
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "SetTimer", scope: !553, file: !14, line: 1889, baseType: !606, size: 64, offset: 704)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SET_TIMER", file: !14, line: 539, baseType: !607)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DISubroutineType(types: !609)
!609 = !{!247, !369, !610, !58}
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TIMER_DELAY", file: !14, line: 519, baseType: !39)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "WaitForEvent", scope: !553, file: !14, line: 1890, baseType: !612, size: 64, offset: 768)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_WAIT_FOR_EVENT", file: !14, line: 575, baseType: !613)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DISubroutineType(types: !615)
!615 = !{!247, !56, !604, !206}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "SignalEvent", scope: !553, file: !14, line: 1891, baseType: !617, size: 64, offset: 832)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIGNAL_EVENT", file: !14, line: 555, baseType: !618)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = !DISubroutineType(types: !620)
!620 = !{!247, !369}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "CloseEvent", scope: !553, file: !14, line: 1892, baseType: !622, size: 64, offset: 896)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CLOSE_EVENT", file: !14, line: 591, baseType: !618)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "CheckEvent", scope: !553, file: !14, line: 1893, baseType: !624, size: 64, offset: 960)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CHECK_EVENT", file: !14, line: 607, baseType: !618)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "InstallProtocolInterface", scope: !553, file: !14, line: 1898, baseType: !626, size: 64, offset: 1024)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_INSTALL_PROTOCOL_INTERFACE", file: !14, line: 1173, baseType: !627)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = !DISubroutineType(types: !629)
!629 = !{!247, !630, !285, !631, !53}
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_INTERFACE_TYPE", file: !14, line: 1149, baseType: !44)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "ReinstallProtocolInterface", scope: !553, file: !14, line: 1899, baseType: !633, size: 64, offset: 1088)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_REINSTALL_PROTOCOL_INTERFACE", file: !14, line: 1223, baseType: !634)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DISubroutineType(types: !636)
!636 = !{!247, !222, !285, !53, !53}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "UninstallProtocolInterface", scope: !553, file: !14, line: 1900, baseType: !638, size: 64, offset: 1152)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_UNINSTALL_PROTOCOL_INTERFACE", file: !14, line: 1249, baseType: !639)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DISubroutineType(types: !641)
!641 = !{!247, !222, !285, !53}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "HandleProtocol", scope: !553, file: !14, line: 1901, baseType: !643, size: 64, offset: 1216)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_HANDLE_PROTOCOL", file: !14, line: 1290, baseType: !644)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = !DISubroutineType(types: !646)
!646 = !{!247, !222, !285, !195}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved", scope: !553, file: !14, line: 1902, baseType: !53, size: 64, offset: 1280)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "RegisterProtocolNotify", scope: !553, file: !14, line: 1903, baseType: !649, size: 64, offset: 1344)
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_REGISTER_PROTOCOL_NOTIFY", file: !14, line: 1451, baseType: !650)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = !DISubroutineType(types: !652)
!652 = !{!247, !285, !369, !195}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "LocateHandle", scope: !553, file: !14, line: 1904, baseType: !654, size: 64, offset: 1408)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_LOCATE_HANDLE", file: !14, line: 1500, baseType: !655)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DISubroutineType(types: !657)
!657 = !{!247, !658, !285, !53, !206, !630}
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_LOCATE_SEARCH_TYPE", file: !14, line: 1474, baseType: !47)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "LocateDevicePath", scope: !553, file: !14, line: 1905, baseType: !660, size: 64, offset: 1472)
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_LOCATE_DEVICE_PATH", file: !14, line: 1526, baseType: !661)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DISubroutineType(types: !663)
!663 = !{!247, !285, !664, !630}
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "InstallConfigurationTable", scope: !553, file: !14, line: 1906, baseType: !666, size: 64, offset: 1536)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_INSTALL_CONFIGURATION_TABLE", file: !14, line: 1547, baseType: !667)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DISubroutineType(types: !669)
!669 = !{!247, !285, !53}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "LoadImage", scope: !553, file: !14, line: 1911, baseType: !671, size: 64, offset: 1600)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IMAGE_LOAD", file: !14, line: 898, baseType: !672)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = !DISubroutineType(types: !674)
!674 = !{!247, !194, !222, !196, !53, !56, !630}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "StartImage", scope: !553, file: !14, line: 1912, baseType: !676, size: 64, offset: 1664)
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IMAGE_START", file: !14, line: 923, baseType: !677)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DISubroutineType(types: !679)
!679 = !{!247, !222, !206, !680}
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "Exit", scope: !553, file: !14, line: 1913, baseType: !682, size: 64, offset: 1728)
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_EXIT", file: !14, line: 951, baseType: !683)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DISubroutineType(types: !685)
!685 = !{!247, !222, !247, !56, !342}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "UnloadImage", scope: !553, file: !14, line: 1914, baseType: !687, size: 64, offset: 1792)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IMAGE_UNLOAD", file: !14, line: 969, baseType: !688)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DISubroutineType(types: !690)
!690 = !{!247, !222}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "ExitBootServices", scope: !553, file: !14, line: 1915, baseType: !692, size: 64, offset: 1856)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_EXIT_BOOT_SERVICES", file: !14, line: 985, baseType: !693)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DISubroutineType(types: !695)
!695 = !{!247, !222, !56}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "GetNextMonotonicCount", scope: !553, file: !14, line: 1920, baseType: !697, size: 64, offset: 1920)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GET_NEXT_MONOTONIC_COUNT", file: !14, line: 1066, baseType: !698)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DISubroutineType(types: !700)
!700 = !{!247, !191}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "Stall", scope: !553, file: !14, line: 1921, baseType: !702, size: 64, offset: 1984)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_STALL", file: !14, line: 1001, baseType: !703)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = !DISubroutineType(types: !705)
!705 = !{!247, !56}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "SetWatchdogTimer", scope: !553, file: !14, line: 1922, baseType: !707, size: 64, offset: 2048)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SET_WATCHDOG_TIMER", file: !14, line: 1023, baseType: !708)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DISubroutineType(types: !710)
!710 = !{!247, !56, !58, !56, !342}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "ConnectController", scope: !553, file: !14, line: 1927, baseType: !712, size: 64, offset: 2112)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CONNECT_CONTROLLER", file: !14, line: 346, baseType: !713)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = !DISubroutineType(types: !715)
!715 = !{!247, !222, !630, !196, !194}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "DisconnectController", scope: !553, file: !14, line: 1928, baseType: !717, size: 64, offset: 2176)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DISCONNECT_CONTROLLER", file: !14, line: 379, baseType: !718)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DISubroutineType(types: !720)
!720 = !{!247, !222, !222, !222}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "OpenProtocol", scope: !553, file: !14, line: 1933, baseType: !722, size: 64, offset: 2240)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_OPEN_PROTOCOL", file: !14, line: 1332, baseType: !723)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DISubroutineType(types: !725)
!725 = !{!247, !222, !285, !195, !222, !222, !60}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "CloseProtocol", scope: !553, file: !14, line: 1934, baseType: !727, size: 64, offset: 2304)
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CLOSE_PROTOCOL", file: !14, line: 1364, baseType: !728)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = !DISubroutineType(types: !730)
!730 = !{!247, !222, !285, !222, !222}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "OpenProtocolInformation", scope: !553, file: !14, line: 1935, baseType: !732, size: 64, offset: 2368)
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_OPEN_PROTOCOL_INFORMATION", file: !14, line: 1398, baseType: !733)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = !DISubroutineType(types: !735)
!735 = !{!247, !222, !285, !736, !206}
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_OPEN_PROTOCOL_INFORMATION_ENTRY", file: !14, line: 1379, baseType: !739)
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_OPEN_PROTOCOL_INFORMATION_ENTRY", file: !14, line: 1374, size: 192, elements: !740)
!740 = !{!741, !742, !743, !744}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "AgentHandle", scope: !739, file: !14, line: 1375, baseType: !222, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "ControllerHandle", scope: !739, file: !14, line: 1376, baseType: !222, size: 64, offset: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "Attributes", scope: !739, file: !14, line: 1377, baseType: !60, size: 32, offset: 128)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "OpenCount", scope: !739, file: !14, line: 1378, baseType: !60, size: 32, offset: 160)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "ProtocolsPerHandle", scope: !553, file: !14, line: 1940, baseType: !746, size: 64, offset: 2432)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_PROTOCOLS_PER_HANDLE", file: !14, line: 1428, baseType: !747)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DISubroutineType(types: !749)
!749 = !{!247, !222, !750, !206}
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "LocateHandleBuffer", scope: !553, file: !14, line: 1941, baseType: !753, size: 64, offset: 2496)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_LOCATE_HANDLE_BUFFER", file: !14, line: 1573, baseType: !754)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DISubroutineType(types: !756)
!756 = !{!247, !658, !285, !53, !206, !757}
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "LocateProtocol", scope: !553, file: !14, line: 1942, baseType: !759, size: 64, offset: 2560)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_LOCATE_PROTOCOL", file: !14, line: 1600, baseType: !760)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DISubroutineType(types: !762)
!762 = !{!247, !285, !53, !195}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "InstallMultipleProtocolInterfaces", scope: !553, file: !14, line: 1943, baseType: !764, size: 64, offset: 2624)
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_INSTALL_MULTIPLE_PROTOCOL_INTERFACES", file: !14, line: 1198, baseType: !765)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DISubroutineType(types: !767)
!767 = !{!247, !630, null}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "UninstallMultipleProtocolInterfaces", scope: !553, file: !14, line: 1944, baseType: !769, size: 64, offset: 2688)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_UNINSTALL_MULTIPLE_PROTOCOL_INTERFACES", file: !14, line: 1268, baseType: !770)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DISubroutineType(types: !772)
!772 = !{!247, !222, null}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "CalculateCrc32", scope: !553, file: !14, line: 1949, baseType: !774, size: 64, offset: 2752)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CALCULATE_CRC32", file: !14, line: 1103, baseType: !775)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DISubroutineType(types: !777)
!777 = !{!247, !53, !56, !267}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "CopyMem", scope: !553, file: !14, line: 1954, baseType: !779, size: 64, offset: 2816)
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_COPY_MEM", file: !14, line: 1119, baseType: !780)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DISubroutineType(types: !782)
!782 = !{null, !53, !53, !56}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "SetMem", scope: !553, file: !14, line: 1955, baseType: !784, size: 64, offset: 2880)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SET_MEM", file: !14, line: 1135, baseType: !785)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DISubroutineType(types: !787)
!787 = !{null, !53, !56, !90}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "CreateEventEx", scope: !553, file: !14, line: 1956, baseType: !789, size: 64, offset: 2944)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CREATE_EVENT_EX", file: !14, line: 494, baseType: !790)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = !DISubroutineType(types: !792)
!792 = !{!247, !60, !561, !600, !307, !259, !604}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "NumberOfTableEntries", scope: !330, file: !14, line: 2032, baseType: !56, size: 64, offset: 832)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "ConfigurationTable", scope: !330, file: !14, line: 2037, baseType: !795, size: 64, offset: 896)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CONFIGURATION_TABLE", file: !14, line: 1972, baseType: !797)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_CONFIGURATION_TABLE", file: !14, line: 1963, size: 192, elements: !798)
!798 = !{!799, !800}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "VendorGuid", scope: !797, file: !14, line: 1967, baseType: !224, size: 128)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "VendorTable", scope: !797, file: !14, line: 1971, baseType: !53, size: 64, offset: 128)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "DeviceHandle", scope: !323, file: !322, line: 53, baseType: !222, size: 64, offset: 192)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "FilePath", scope: !323, file: !322, line: 54, baseType: !196, size: 64, offset: 256)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved", scope: !323, file: !322, line: 56, baseType: !53, size: 64, offset: 320)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "LoadOptionsSize", scope: !323, file: !322, line: 61, baseType: !60, size: 32, offset: 384)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "LoadOptions", scope: !323, file: !322, line: 62, baseType: !53, size: 64, offset: 448)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "ImageBase", scope: !323, file: !322, line: 67, baseType: !53, size: 64, offset: 512)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "ImageSize", scope: !323, file: !322, line: 68, baseType: !58, size: 64, offset: 576)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "ImageCodeType", scope: !323, file: !322, line: 69, baseType: !573, size: 32, offset: 640)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "ImageDataType", scope: !323, file: !322, line: 70, baseType: !573, size: 32, offset: 672)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "Unload", scope: !323, file: !322, line: 71, baseType: !687, size: 64, offset: 704)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "ImageEntryPoint", scope: !210, file: !209, line: 131, baseType: !812, size: 64, offset: 1088)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "PHYSICAL_ADDRESS", file: !55, line: 237, baseType: !58)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "ImageBuffer", scope: !210, file: !209, line: 135, baseType: !812, size: 64, offset: 1152)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "NumberOfPage", scope: !210, file: !209, line: 139, baseType: !56, size: 64, offset: 1216)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "SmmImageHandle", scope: !210, file: !209, line: 140, baseType: !222, size: 64, offset: 1280)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "SmmLoadedImage", scope: !210, file: !209, line: 141, baseType: !321, size: 768, offset: 1344)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IMAGE_ENTRY_POINT", file: !14, line: 2053, baseType: !818)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DISubroutineType(types: !820)
!820 = !{!247, !222, !328}
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "KNOWN_HANDLE", file: !823, line: 46, baseType: !824)
!823 = !DIFile(filename: "MdeModulePkg/Core/PiSmmCore/Dispatcher.c", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "6876a634d8882ec90924c753d950bbf0")
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "KNOWN_HANDLE", file: !823, line: 42, size: 256, elements: !825)
!825 = !{!826, !827, !828}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", scope: !824, file: !823, line: 43, baseType: !56, size: 64)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "Link", scope: !824, file: !823, line: 44, baseType: !214, size: 128, offset: 64)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "Handle", scope: !824, file: !823, line: 45, baseType: !222, size: 64, offset: 192)
!829 = !{!0, !830, !832, !834, !836, !838, !843, !859, !873, !875, !877, !879, !881, !883, !885, !887}
!830 = !DIGlobalVariableExpression(var: !831, expr: !DIExpression())
!831 = distinct !DIGlobalVariable(name: "mScheduledQueue", scope: !2, file: !823, line: 78, type: !214, isLocal: false, isDefinition: true)
!832 = !DIGlobalVariableExpression(var: !833, expr: !DIExpression())
!833 = distinct !DIGlobalVariable(name: "mFvHandleList", scope: !2, file: !823, line: 83, type: !214, isLocal: false, isDefinition: true)
!834 = !DIGlobalVariableExpression(var: !835, expr: !DIExpression())
!835 = distinct !DIGlobalVariable(name: "gDispatcherRunning", scope: !2, file: !823, line: 88, type: !194, isLocal: false, isDefinition: true)
!836 = !DIGlobalVariableExpression(var: !837, expr: !DIExpression())
!837 = distinct !DIGlobalVariable(name: "gRequestDispatch", scope: !2, file: !823, line: 93, type: !194, isLocal: false, isDefinition: true)
!838 = !DIGlobalVariableExpression(var: !839, expr: !DIExpression())
!839 = distinct !DIGlobalVariable(name: "mSmmFileTypes", scope: !2, file: !823, line: 98, type: !840, isLocal: false, isDefinition: true)
!840 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 24, elements: !841)
!841 = !{!842}
!842 = !DISubrange(count: 3)
!843 = !DIGlobalVariableExpression(var: !844, expr: !DIExpression())
!844 = distinct !DIGlobalVariable(name: "mSecurity", scope: !2, file: !823, line: 118, type: !845, isLocal: false, isDefinition: true)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SECURITY_ARCH_PROTOCOL", file: !847, line: 31, baseType: !848)
!847 = !DIFile(filename: "MdePkg/Include/Protocol/Security.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "f614af7327fc7e01f862abd983ad93fd")
!848 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_SECURITY_ARCH_PROTOCOL", file: !847, line: 91, size: 64, elements: !849)
!849 = !{!850}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "FileAuthenticationState", scope: !848, file: !847, line: 92, baseType: !851, size: 64)
!851 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SECURITY_FILE_AUTHENTICATION_STATE", file: !847, line: 80, baseType: !852)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = !DISubroutineType(types: !854)
!854 = !{!247, !855, !60, !857}
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !846)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !197)
!859 = !DIGlobalVariableExpression(var: !860, expr: !DIExpression())
!860 = distinct !DIGlobalVariable(name: "mSecurity2", scope: !2, file: !823, line: 119, type: !861, isLocal: false, isDefinition: true)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SECURITY2_ARCH_PROTOCOL", file: !863, line: 34, baseType: !864)
!863 = !DIFile(filename: "MdePkg/Include/Protocol/Security2.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "332bbac2d3f6ef97214238553ccfd26d")
!864 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_SECURITY2_ARCH_PROTOCOL", file: !863, line: 95, size: 64, elements: !865)
!865 = !{!866}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "FileAuthentication", scope: !864, file: !863, line: 96, baseType: !867, size: 64)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SECURITY2_FILE_AUTHENTICATION", file: !863, line: 81, baseType: !868)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DISubroutineType(types: !870)
!870 = !{!247, !871, !857, !53, !56, !194}
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !862)
!873 = !DIGlobalVariableExpression(var: !874, expr: !DIExpression())
!874 = distinct !DIGlobalVariable(name: "mSmmCodeMemoryRangeUsageBitMap", scope: !2, file: !823, line: 126, type: !191, isLocal: false, isDefinition: true)
!875 = !DIGlobalVariableExpression(var: !876, expr: !DIExpression(DW_OP_constu, 1, DW_OP_stack_value))
!876 = distinct !DIGlobalVariable(name: "AllocateMaxAddress", scope: !2, file: !14, line: 38, type: !420, isLocal: true, isDefinition: true)
!877 = !DIGlobalVariableExpression(var: !878, expr: !DIExpression(DW_OP_constu, 5, DW_OP_stack_value))
!878 = distinct !DIGlobalVariable(name: "EfiRuntimeServicesCode", scope: !2, file: !6, line: 65, type: !420, isLocal: true, isDefinition: true)
!879 = !DIGlobalVariableExpression(var: !880, expr: !DIExpression(DW_OP_constu, 4, DW_OP_stack_value))
!880 = distinct !DIGlobalVariable(name: "EfiBootServicesData", scope: !2, file: !6, line: 61, type: !420, isLocal: true, isDefinition: true)
!881 = !DIGlobalVariableExpression(var: !882, expr: !DIExpression(DW_OP_constu, 6, DW_OP_stack_value))
!882 = distinct !DIGlobalVariable(name: "EfiRuntimeServicesData", scope: !2, file: !6, line: 70, type: !420, isLocal: true, isDefinition: true)
!883 = !DIGlobalVariableExpression(var: !884, expr: !DIExpression(DW_OP_constu, 0, DW_OP_stack_value))
!884 = distinct !DIGlobalVariable(name: "EFI_NATIVE_INTERFACE", scope: !2, file: !14, line: 1148, type: !420, isLocal: true, isDefinition: true)
!885 = !DIGlobalVariableExpression(var: !886, expr: !DIExpression(DW_OP_constu, 2, DW_OP_stack_value))
!886 = distinct !DIGlobalVariable(name: "ByProtocol", scope: !2, file: !14, line: 1473, type: !420, isLocal: true, isDefinition: true)
!887 = !DIGlobalVariableExpression(var: !888, expr: !DIExpression())
!888 = distinct !DIGlobalVariable(name: "mFvDevicePath", scope: !2, file: !823, line: 113, type: !889, isLocal: false, isDefinition: true)
!889 = !DIDerivedType(tag: DW_TAG_typedef, name: "FV_FILEPATH_DEVICE_PATH", file: !823, line: 111, baseType: !890)
!890 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FV_FILEPATH_DEVICE_PATH", file: !823, line: 108, size: 192, elements: !891)
!891 = !{!892, !898}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "File", scope: !890, file: !823, line: 109, baseType: !893, size: 160)
!893 = !DIDerivedType(tag: DW_TAG_typedef, name: "MEDIA_FW_VOL_FILEPATH_DEVICE_PATH", file: !198, line: 1121, baseType: !894)
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MEDIA_FW_VOL_FILEPATH_DEVICE_PATH", file: !198, line: 1115, size: 160, elements: !895)
!895 = !{!896, !897}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "Header", scope: !894, file: !198, line: 1116, baseType: !197, size: 32)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "FvFileName", scope: !894, file: !198, line: 1120, baseType: !224, size: 128, offset: 32)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "End", scope: !890, file: !823, line: 110, baseType: !197, size: 32, offset: 160)
!899 = !{i32 2, !"CodeView", i32 1}
!900 = !{i32 2, !"Debug Info Version", i32 3}
!901 = !{i32 1, !"wchar_size", i32 2}
!902 = !{i32 7, !"PIC Level", i32 2}
!903 = !{i32 1, !"Code Model", i32 1}
!904 = !{i32 7, !"uwtable", i32 1}
!905 = !{i32 1, !"ThinLTO", i32 0}
!906 = !{i32 1, !"EnableSplitLTOUnit", i32 1}
!907 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!908 = distinct !DISubprogram(name: "CheckAndMarkFixLoadingMemoryUsageBitMap", scope: !823, file: !823, line: 140, type: !578, scopeLine: 144, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !909)
!909 = !{}
!910 = !DILocalVariable(name: "ImageBase", arg: 1, scope: !908, file: !823, line: 141, type: !192)
!911 = !DILocation(line: 141, scope: !908)
!912 = !DILocalVariable(name: "ImageSize", arg: 2, scope: !908, file: !823, line: 142, type: !56)
!913 = !DILocation(line: 142, scope: !908)
!914 = !DILocalVariable(name: "SmmCodePageNumber", scope: !908, file: !823, line: 145, type: !60)
!915 = !DILocation(line: 145, scope: !908)
!916 = !DILocalVariable(name: "SmmCodeSize", scope: !908, file: !823, line: 146, type: !58)
!917 = !DILocation(line: 146, scope: !908)
!918 = !DILocalVariable(name: "SmmCodeBase", scope: !908, file: !823, line: 147, type: !192)
!919 = !DILocation(line: 147, scope: !908)
!920 = !DILocalVariable(name: "BaseOffsetPageNumber", scope: !908, file: !823, line: 148, type: !56)
!921 = !DILocation(line: 148, scope: !908)
!922 = !DILocalVariable(name: "TopOffsetPageNumber", scope: !908, file: !823, line: 149, type: !56)
!923 = !DILocation(line: 149, scope: !908)
!924 = !DILocalVariable(name: "Index", scope: !908, file: !823, line: 150, type: !56)
!925 = !DILocation(line: 150, scope: !908)
!926 = !DILocation(line: 155, scope: !908)
!927 = !DILocation(line: 156, scope: !908)
!928 = !DILocation(line: 157, scope: !908)
!929 = !DILocation(line: 163, scope: !908)
!930 = !DILocation(line: 164, scope: !931)
!931 = distinct !DILexicalBlock(scope: !932, file: !823, line: 163)
!932 = distinct !DILexicalBlock(scope: !908, file: !823, line: 163)
!933 = !DILocation(line: 165, scope: !931)
!934 = !DILocation(line: 170, scope: !908)
!935 = !DILocation(line: 171, scope: !936)
!936 = distinct !DILexicalBlock(scope: !937, file: !823, line: 170)
!937 = distinct !DILexicalBlock(scope: !908, file: !823, line: 170)
!938 = !DILocation(line: 177, scope: !908)
!939 = !DILocation(line: 178, scope: !940)
!940 = distinct !DILexicalBlock(scope: !941, file: !823, line: 177)
!941 = distinct !DILexicalBlock(scope: !908, file: !823, line: 177)
!942 = !DILocation(line: 184, scope: !908)
!943 = !DILocation(line: 185, scope: !908)
!944 = !DILocation(line: 186, scope: !945)
!945 = distinct !DILexicalBlock(scope: !908, file: !823, line: 186)
!946 = !DILocation(line: 187, scope: !947)
!947 = distinct !DILexicalBlock(scope: !948, file: !823, line: 186)
!948 = distinct !DILexicalBlock(scope: !945, file: !823, line: 186)
!949 = !DILocation(line: 191, scope: !950)
!950 = distinct !DILexicalBlock(scope: !951, file: !823, line: 187)
!951 = distinct !DILexicalBlock(scope: !947, file: !823, line: 187)
!952 = !DILocation(line: 193, scope: !947)
!953 = !DILocation(line: 186, scope: !948)
!954 = distinct !{!954, !944, !955, !956}
!955 = !DILocation(line: 193, scope: !945)
!956 = !{!"llvm.loop.mustprogress"}
!957 = !DILocation(line: 198, scope: !958)
!958 = distinct !DILexicalBlock(scope: !908, file: !823, line: 198)
!959 = !DILocation(line: 199, scope: !960)
!960 = distinct !DILexicalBlock(scope: !961, file: !823, line: 198)
!961 = distinct !DILexicalBlock(scope: !958, file: !823, line: 198)
!962 = !DILocation(line: 200, scope: !960)
!963 = !DILocation(line: 198, scope: !961)
!964 = distinct !{!964, !957, !965, !956}
!965 = !DILocation(line: 200, scope: !958)
!966 = !DILocation(line: 202, scope: !908)
!967 = !DILocation(line: 203, scope: !908)
!968 = distinct !DISubprogram(name: "GetPeCoffImageFixLoadingAssignedAddress", scope: !823, file: !823, line: 216, type: !969, scopeLine: 219, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !909)
!969 = !DISubroutineType(types: !970)
!970 = !{!247, !971}
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64)
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "PE_COFF_LOADER_IMAGE_CONTEXT", file: !973, line: 200, baseType: !974)
!973 = !DIFile(filename: "MdePkg/Include/Library/PeCoffLib.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "9d1440d549b484d9f44142f6a037b597")
!974 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PE_COFF_LOADER_IMAGE_CONTEXT", file: !973, line: 75, size: 1216, elements: !975)
!975 = !{!976, !977, !978, !979, !980, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "ImageAddress", scope: !974, file: !973, line: 79, baseType: !812, size: 64)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "ImageSize", scope: !974, file: !973, line: 84, baseType: !58, size: 64, offset: 64)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "DestinationAddress", scope: !974, file: !973, line: 91, baseType: !812, size: 64, offset: 128)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "EntryPoint", scope: !974, file: !973, line: 95, baseType: !812, size: 64, offset: 192)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "ImageRead", scope: !974, file: !973, line: 100, baseType: !981, size: 64, offset: 256)
!981 = !DIDerivedType(tag: DW_TAG_typedef, name: "PE_COFF_LOADER_READ_FILE", file: !973, line: 65, baseType: !982)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
!983 = !DISubroutineType(types: !984)
!984 = !{!54, !53, !56, !206, !53}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "Handle", scope: !974, file: !973, line: 104, baseType: !53, size: 64, offset: 320)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "FixupData", scope: !974, file: !973, line: 111, baseType: !53, size: 64, offset: 384)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "SectionAlignment", scope: !974, file: !973, line: 116, baseType: !60, size: 32, offset: 448)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "PeCoffHeaderOffset", scope: !974, file: !973, line: 122, baseType: !60, size: 32, offset: 480)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "DebugDirectoryEntryRva", scope: !974, file: !973, line: 127, baseType: !60, size: 32, offset: 512)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "CodeView", scope: !974, file: !973, line: 131, baseType: !53, size: 64, offset: 576)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "PdbPointer", scope: !974, file: !973, line: 137, baseType: !185, size: 64, offset: 640)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "SizeOfHeaders", scope: !974, file: !973, line: 141, baseType: !56, size: 64, offset: 704)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "ImageCodeMemoryType", scope: !974, file: !973, line: 148, baseType: !60, size: 32, offset: 768)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "ImageDataMemoryType", scope: !974, file: !973, line: 155, baseType: !60, size: 32, offset: 800)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "ImageError", scope: !974, file: !973, line: 159, baseType: !60, size: 32, offset: 832)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "FixupDataSize", scope: !974, file: !973, line: 164, baseType: !56, size: 64, offset: 896)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "Machine", scope: !974, file: !973, line: 168, baseType: !76, size: 16, offset: 960)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "ImageType", scope: !974, file: !973, line: 172, baseType: !76, size: 16, offset: 976)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "DllCharacteristics", scope: !974, file: !973, line: 177, baseType: !76, size: 16, offset: 992)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "DllCharacteristicsEx", scope: !974, file: !973, line: 178, baseType: !60, size: 32, offset: 1024)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "RelocationsStripped", scope: !974, file: !973, line: 183, baseType: !194, size: 8, offset: 1056)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "IsTeImage", scope: !974, file: !973, line: 189, baseType: !194, size: 8, offset: 1064)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "HiiResourceData", scope: !974, file: !973, line: 195, baseType: !812, size: 64, offset: 1088)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "Context", scope: !974, file: !973, line: 199, baseType: !58, size: 64, offset: 1152)
!1005 = !DILocalVariable(name: "ImageContext", arg: 1, scope: !968, file: !823, line: 217, type: !971)
!1006 = !DILocation(line: 217, scope: !968)
!1007 = !DILocalVariable(name: "SectionHeaderOffset", scope: !968, file: !823, line: 220, type: !56)
!1008 = !DILocation(line: 220, scope: !968)
!1009 = !DILocalVariable(name: "Status", scope: !968, file: !823, line: 221, type: !247)
!1010 = !DILocation(line: 221, scope: !968)
!1011 = !DILocalVariable(name: "SectionHeader", scope: !968, file: !823, line: 222, type: !1012)
!1012 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IMAGE_SECTION_HEADER", file: !63, line: 294, baseType: !1013)
!1013 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_IMAGE_SECTION_HEADER", file: !63, line: 280, size: 320, elements: !1014)
!1014 = !{!1015, !1016, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "Name", scope: !1013, file: !63, line: 281, baseType: !232, size: 64)
!1016 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1013, file: !63, line: 282, size: 32, elements: !1017)
!1017 = !{!1018, !1019}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "PhysicalAddress", scope: !1016, file: !63, line: 283, baseType: !60, size: 32)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "VirtualSize", scope: !1016, file: !63, line: 284, baseType: !60, size: 32)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "Misc", scope: !1013, file: !63, line: 285, baseType: !1016, size: 32, offset: 64)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "VirtualAddress", scope: !1013, file: !63, line: 286, baseType: !60, size: 32, offset: 96)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "SizeOfRawData", scope: !1013, file: !63, line: 287, baseType: !60, size: 32, offset: 128)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "PointerToRawData", scope: !1013, file: !63, line: 288, baseType: !60, size: 32, offset: 160)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "PointerToRelocations", scope: !1013, file: !63, line: 289, baseType: !60, size: 32, offset: 192)
