; ModuleID = 'FaultTolerantWriteSmm.bc'
source_filename = "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main/MdeModulePkg/Universal/FaultTolerantWriteDxe/FaultTolerantWriteSmm.c"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-windows-gnu"

%struct.EFI_FTW_DEVICE = type { i64, i8*, %struct._EFI_FAULT_TOLERANT_WRITE_PROTOCOL, i64, i64, i64, i64, i64, i64, i64, i64, %struct.EFI_FAULT_TOLERANT_WORKING_BLOCK_HEADER*, %struct.EFI_FAULT_TOLERANT_WRITE_HEADER*, %struct.EFI_FAULT_TOLERANT_WRITE_RECORD*, %struct._EFI_FIRMWARE_VOLUME_BLOCK_PROTOCOL*, %struct._EFI_FIRMWARE_VOLUME_BLOCK_PROTOCOL*, i64, i64, i64, i64, i64, i64, i64, i64, i8* }
%struct._EFI_FAULT_TOLERANT_WRITE_PROTOCOL = type { i64 (%struct._EFI_FAULT_TOLERANT_WRITE_PROTOCOL*, i64*)*, i64 (%struct._EFI_FAULT_TOLERANT_WRITE_PROTOCOL*, %struct.GUID*, i64, i64)*, i64 (%struct._EFI_FAULT_TOLERANT_WRITE_PROTOCOL*, i64, i64, i64, i8*, i8*, i8*)*, i64 (%struct._EFI_FAULT_TOLERANT_WRITE_PROTOCOL*, i8*)*, i64 (%struct._EFI_FAULT_TOLERANT_WRITE_PROTOCOL*)*, i64 (%struct._EFI_FAULT_TOLERANT_WRITE_PROTOCOL*, %struct.GUID*, i64*, i64*, i64*, i64*, i8*, i8*)* }
%struct.GUID = type { i32, i16, i16, [8 x i8] }
%struct.EFI_FAULT_TOLERANT_WORKING_BLOCK_HEADER = type { %struct.GUID, i32, i8, [3 x i8], i64 }
%struct.EFI_FAULT_TOLERANT_WRITE_HEADER = type { i8, %struct.GUID, i64, i64 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "mFvbRegistration", scope: !2, file: !94, line: 59, type: !6, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !4, globals: !91, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main/MdeModulePkg/Universal/FaultTolerantWriteDxe/FaultTolerantWriteSmm.c", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main/Build/MdeModule/NOOPT_CLANGPDB/X64/MdeModulePkg/Universal/FaultTolerantWriteDxe/FaultTolerantWriteSmm", checksumkind: CSK_MD5, checksum: "00586fb84857ff06d53e89437be24bfa")
!4 = !{!5, !6, !7, !13, !9, !16, !18, !32, !37, !59, !74, !80}
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "RETURN_STATUS", file: !8, line: 1026, baseType: !9)
!8 = !DIFile(filename: "MdePkg/Include/Base.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "0c11ea3d1992443d8a8f590a064e50ff")
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINTN", file: !10, line: 211, baseType: !11)
!10 = !DIFile(filename: "MdePkg/Include/X64/ProcessorBind.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "ef2524a221fe61206fa09ec88dd4f59b")
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT64", file: !10, line: 162, baseType: !12)
!12 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTN", file: !10, line: 216, baseType: !14)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT64", file: !10, line: 166, baseType: !15)
!15 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "BOOLEAN", file: !10, line: 192, baseType: !17)
!17 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "SMM_FTW_COMMUNICATE_FUNCTION_HEADER", file: !20, line: 27, baseType: !21)
!20 = !DIFile(filename: "MdeModulePkg/Universal/FaultTolerantWriteDxe/FaultTolerantWriteSmmCommon.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "2ab207646395f778e695ce126a18efca")
!21 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SMM_FTW_COMMUNICATE_FUNCTION_HEADER", file: !20, line: 23, size: 192, elements: !22)
!22 = !{!23, !24, !27}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !21, file: !20, line: 24, baseType: !9, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "ReturnStatus", scope: !21, file: !20, line: 25, baseType: !25, size: 64, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_STATUS", file: !26, line: 29, baseType: !7)
!26 = !DIFile(filename: "MdePkg/Include/Uefi/UefiBaseType.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "dbec48e65949dff122bc920c9d9d9c6a")
!27 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !21, file: !20, line: 26, baseType: !28, size: 8, offset: 128)
!28 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 8, elements: !30)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT8", file: !10, line: 196, baseType: !17)
!30 = !{!31}
!31 = !DISubrange(count: 1)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "SMM_FTW_GET_MAX_BLOCK_SIZE_HEADER", file: !20, line: 41, baseType: !34)
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SMM_FTW_GET_MAX_BLOCK_SIZE_HEADER", file: !20, line: 39, size: 64, elements: !35)
!35 = !{!36}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "BlockSize", scope: !34, file: !20, line: 40, baseType: !9, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "SMM_FTW_ALLOCATE_HEADER", file: !20, line: 47, baseType: !39)
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SMM_FTW_ALLOCATE_HEADER", file: !20, line: 43, size: 256, elements: !40)
!40 = !{!41, !57, !58}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "CallerId", scope: !39, file: !20, line: 44, baseType: !42, size: 128)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GUID", file: !26, line: 25, baseType: !43)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "GUID", file: !8, line: 218, baseType: !44)
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GUID", file: !8, line: 213, size: 128, elements: !45)
!45 = !{!46, !49, !52, !53}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "Data1", scope: !44, file: !8, line: 214, baseType: !47, size: 32)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT32", file: !10, line: 170, baseType: !48)
!48 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "Data2", scope: !44, file: !8, line: 215, baseType: !50, size: 16, offset: 32)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT16", file: !10, line: 178, baseType: !51)
!51 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "Data3", scope: !44, file: !8, line: 216, baseType: !50, size: 16, offset: 48)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "Data4", scope: !44, file: !8, line: 217, baseType: !54, size: 64, offset: 64)
!54 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 64, elements: !55)
!55 = !{!56}
!56 = !DISubrange(count: 8)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "PrivateDataSize", scope: !39, file: !20, line: 45, baseType: !9, size: 64, offset: 128)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "NumberOfWrites", scope: !39, file: !20, line: 46, baseType: !9, size: 64, offset: 192)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "SMM_FTW_WRITE_HEADER", file: !20, line: 57, baseType: !61)
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SMM_FTW_WRITE_HEADER", file: !20, line: 49, size: 448, elements: !62)
!62 = !{!63, !65, !66, !67, !69, !72, !73}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "Lba", scope: !61, file: !20, line: 50, baseType: !64, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_LBA", file: !26, line: 45, baseType: !11)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !61, file: !20, line: 51, baseType: !9, size: 64, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "PrivateDataSize", scope: !61, file: !20, line: 52, baseType: !9, size: 64, offset: 128)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "FvbBaseAddress", scope: !61, file: !20, line: 53, baseType: !68, size: 64, offset: 192)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_PHYSICAL_ADDRESS", file: !26, line: 50, baseType: !11)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "FvbAttributes", scope: !61, file: !20, line: 54, baseType: !70, size: 32, offset: 256)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FVB_ATTRIBUTES_2", file: !71, line: 30, baseType: !47)
!71 = !DIFile(filename: "MdePkg/Include/Pi/PiFirmwareVolume.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "9a02bea8b9edc1b887ae684c8d405b44")
!72 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !61, file: !20, line: 55, baseType: !9, size: 64, offset: 320)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !61, file: !20, line: 56, baseType: !28, size: 8, offset: 384)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "SMM_FTW_RESTART_HEADER", file: !20, line: 62, baseType: !76)
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SMM_FTW_RESTART_HEADER", file: !20, line: 59, size: 128, elements: !77)
!77 = !{!78, !79}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "FvbBaseAddress", scope: !76, file: !20, line: 60, baseType: !68, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "FvbAttributes", scope: !76, file: !20, line: 61, baseType: !70, size: 32, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "SMM_FTW_GET_LAST_WRITE_HEADER", file: !20, line: 72, baseType: !82)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SMM_FTW_GET_LAST_WRITE_HEADER", file: !20, line: 64, size: 448, elements: !83)
!83 = !{!84, !85, !86, !87, !88, !89, !90}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "CallerId", scope: !82, file: !20, line: 65, baseType: !42, size: 128)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "Lba", scope: !82, file: !20, line: 66, baseType: !64, size: 64, offset: 128)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !82, file: !20, line: 67, baseType: !9, size: 64, offset: 192)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !82, file: !20, line: 68, baseType: !9, size: 64, offset: 256)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "PrivateDataSize", scope: !82, file: !20, line: 69, baseType: !9, size: 64, offset: 320)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "Complete", scope: !82, file: !20, line: 70, baseType: !16, size: 8, offset: 384)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !82, file: !20, line: 71, baseType: !28, size: 8, offset: 392)
!91 = !{!0, !92, !244, !246, !250}
!92 = !DIGlobalVariableExpression(var: !93, expr: !DIExpression())
!93 = distinct !DIGlobalVariable(name: "mFtwDevice", scope: !2, file: !94, line: 60, type: !95, isLocal: false, isDefinition: true)
!94 = !DIFile(filename: "MdeModulePkg/Universal/FaultTolerantWriteDxe/FaultTolerantWriteSmm.c", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "00586fb84857ff06d53e89437be24bfa")
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FTW_DEVICE", file: !97, line: 85, baseType: !98)
!97 = !DIFile(filename: "MdeModulePkg/Universal/FaultTolerantWriteDxe/FaultTolerantWrite.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "4da11e991b3019e04d0946b88847f98b")
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_FTW_DEVICE", file: !97, line: 55, size: 1920, elements: !99)
!99 = !{!100, !101, !103, !143, !144, !145, !146, !147, !148, !149, !150, !151, !167, !179, !192, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", scope: !98, file: !97, line: 56, baseType: !9, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "Handle", scope: !98, file: !97, line: 57, baseType: !102, size: 64, offset: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_HANDLE", file: !26, line: 33, baseType: !6)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "FtwInstance", scope: !98, file: !97, line: 58, baseType: !104, size: 384, offset: 128)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FAULT_TOLERANT_WRITE_PROTOCOL", file: !105, line: 23, baseType: !106)
!105 = !DIFile(filename: "MdeModulePkg/Include/Protocol/FaultTolerantWrite.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "4a945e0bd8a5230eb74cb6bb8127a39f")
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_FAULT_TOLERANT_WRITE_PROTOCOL", file: !105, line: 190, size: 384, elements: !107)
!107 = !{!108, !115, !121, !126, !131, !136}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "GetMaxBlockSize", scope: !106, file: !105, line: 191, baseType: !109, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FAULT_TOLERANT_WRITE_GET_MAX_BLOCK_SIZE", file: !105, line: 39, baseType: !110)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DISubroutineType(types: !112)
!112 = !{!25, !113, !114}
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "Allocate", scope: !106, file: !105, line: 192, baseType: !116, size: 64, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FAULT_TOLERANT_WRITE_ALLOCATE", file: !105, line: 67, baseType: !117)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DISubroutineType(types: !119)
!119 = !{!25, !113, !120, !9, !9}
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "Write", scope: !106, file: !105, line: 193, baseType: !122, size: 64, offset: 128)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FAULT_TOLERANT_WRITE_WRITE", file: !105, line: 103, baseType: !123)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DISubroutineType(types: !125)
!125 = !{!25, !113, !64, !9, !9, !6, !102, !6}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "Restart", scope: !106, file: !105, line: 194, baseType: !127, size: 64, offset: 192)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FAULT_TOLERANT_WRITE_RESTART", file: !105, line: 128, baseType: !128)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DISubroutineType(types: !130)
!130 = !{!25, !113, !102}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "Abort", scope: !106, file: !105, line: 195, baseType: !132, size: 64, offset: 256)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FAULT_TOLERANT_WRITE_ABORT", file: !105, line: 145, baseType: !133)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DISubroutineType(types: !135)
!135 = !{!25, !113}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "GetLastWrite", scope: !106, file: !105, line: 196, baseType: !137, size: 64, offset: 320)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FAULT_TOLERANT_WRITE_GET_LAST_WRITE", file: !105, line: 176, baseType: !138)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DISubroutineType(types: !140)
!140 = !{!25, !113, !120, !141, !114, !114, !114, !6, !142}
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "WorkSpaceAddress", scope: !98, file: !97, line: 59, baseType: !68, size: 64, offset: 512)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "SpareAreaAddress", scope: !98, file: !97, line: 60, baseType: !68, size: 64, offset: 576)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "WorkSpaceLength", scope: !98, file: !97, line: 61, baseType: !9, size: 64, offset: 640)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "NumberOfWorkSpaceBlock", scope: !98, file: !97, line: 62, baseType: !9, size: 64, offset: 704)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "WorkBlockSize", scope: !98, file: !97, line: 63, baseType: !9, size: 64, offset: 768)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "SpareAreaLength", scope: !98, file: !97, line: 64, baseType: !9, size: 64, offset: 832)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "NumberOfSpareBlock", scope: !98, file: !97, line: 65, baseType: !9, size: 64, offset: 896)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "SpareBlockSize", scope: !98, file: !97, line: 66, baseType: !9, size: 64, offset: 960)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "FtwWorkSpaceHeader", scope: !98, file: !97, line: 67, baseType: !152, size: 64, offset: 1024)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FAULT_TOLERANT_WORKING_BLOCK_HEADER", file: !154, line: 62, baseType: !155)
!154 = !DIFile(filename: "MdeModulePkg/Include/Guid/SystemNvDataGuid.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "23e26372a01f5dfd3111902bd0bca353")
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_FAULT_TOLERANT_WORKING_BLOCK_HEADER", file: !154, line: 31, size: 256, elements: !156)
!156 = !{!157, !158, !159, !160, !161, !162, !166}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", scope: !155, file: !154, line: 37, baseType: !42, size: 128)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "Crc", scope: !155, file: !154, line: 41, baseType: !47, size: 32, offset: 128)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "WorkingBlockValid", scope: !155, file: !154, line: 45, baseType: !29, size: 1, offset: 160, flags: DIFlagBitField, extraData: i64 160)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "WorkingBlockInvalid", scope: !155, file: !154, line: 46, baseType: !29, size: 1, offset: 161, flags: DIFlagBitField, extraData: i64 160)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved", scope: !155, file: !154, line: 47, baseType: !29, size: 6, offset: 162, flags: DIFlagBitField, extraData: i64 160)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !155, file: !154, line: 48, baseType: !163, size: 24, offset: 168)
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 24, elements: !164)
!164 = !{!165}
!165 = !DISubrange(count: 3)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "WriteQueueSize", scope: !155, file: !154, line: 52, baseType: !11, size: 64, offset: 192)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "FtwLastWriteHeader", scope: !98, file: !97, line: 68, baseType: !168, size: 64, offset: 1088)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FAULT_TOLERANT_WRITE_HEADER", file: !154, line: 78, baseType: !170)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_FAULT_TOLERANT_WRITE_HEADER", file: !154, line: 70, size: 320, elements: !171)
!171 = !{!172, !173, !174, !175, !176, !177, !178}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "HeaderAllocated", scope: !170, file: !154, line: 71, baseType: !29, size: 1, flags: DIFlagBitField, extraData: i64 0)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "WritesAllocated", scope: !170, file: !154, line: 72, baseType: !29, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "Complete", scope: !170, file: !154, line: 73, baseType: !29, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved", scope: !170, file: !154, line: 74, baseType: !29, size: 5, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "CallerId", scope: !170, file: !154, line: 75, baseType: !42, size: 128, offset: 32)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "NumberOfWrites", scope: !170, file: !154, line: 76, baseType: !11, size: 64, offset: 192)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "PrivateDataSize", scope: !170, file: !154, line: 77, baseType: !11, size: 64, offset: 256)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "FtwLastWriteRecord", scope: !98, file: !97, line: 69, baseType: !180, size: 64, offset: 1152)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FAULT_TOLERANT_WRITE_RECORD", file: !154, line: 98, baseType: !182)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_FAULT_TOLERANT_WRITE_RECORD", file: !154, line: 83, size: 320, elements: !183)
!183 = !{!184, !185, !186, !187, !188, !189, !190, !191}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "BootBlockUpdate", scope: !182, file: !154, line: 84, baseType: !29, size: 1, flags: DIFlagBitField, extraData: i64 0)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "SpareComplete", scope: !182, file: !154, line: 85, baseType: !29, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "DestinationComplete", scope: !182, file: !154, line: 86, baseType: !29, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved", scope: !182, file: !154, line: 87, baseType: !29, size: 5, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "Lba", scope: !182, file: !154, line: 88, baseType: !64, size: 64, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !182, file: !154, line: 89, baseType: !11, size: 64, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !182, file: !154, line: 90, baseType: !11, size: 64, offset: 192)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "RelativeOffset", scope: !182, file: !154, line: 94, baseType: !14, size: 64, offset: 256)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "FtwFvBlock", scope: !98, file: !97, line: 70, baseType: !193, size: 64, offset: 1216)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FIRMWARE_VOLUME_BLOCK_PROTOCOL", file: !195, line: 26, baseType: !196)
!195 = !DIFile(filename: "MdePkg/Include/Protocol/FirmwareVolumeBlock.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "a4ca798c296dfa7ab68d1d2b85c3dd17")
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_FIRMWARE_VOLUME_BLOCK_PROTOCOL", file: !195, line: 335, size: 512, elements: !197)
!197 = !{!198, !207, !209, !215, !220, !226, !228, !233}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "GetAttributes", scope: !196, file: !195, line: 336, baseType: !199, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FVB_GET_ATTRIBUTES", file: !195, line: 47, baseType: !200)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DISubroutineType(types: !202)
!202 = !{!25, !203, !206}
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !205)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FIRMWARE_VOLUME_BLOCK2_PROTOCOL", file: !195, line: 28, baseType: !194)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "SetAttributes", scope: !196, file: !195, line: 337, baseType: !208, size: 64, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FVB_SET_ATTRIBUTES", file: !195, line: 76, baseType: !200)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "GetPhysicalAddress", scope: !196, file: !195, line: 338, baseType: !210, size: 64, offset: 128)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FVB_GET_PHYSICAL_ADDRESS", file: !195, line: 100, baseType: !211)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DISubroutineType(types: !213)
!213 = !{!25, !203, !214}
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "GetBlockSize", scope: !196, file: !195, line: 339, baseType: !216, size: 64, offset: 192)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FVB_GET_BLOCK_SIZE", file: !195, line: 133, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{!25, !203, !64, !114, !114}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "Read", scope: !196, file: !195, line: 340, baseType: !221, size: 64, offset: 256)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FVB_READ", file: !195, line: 189, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DISubroutineType(types: !224)
!224 = !{!25, !203, !64, !9, !114, !225}
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "Write", scope: !196, file: !195, line: 341, baseType: !227, size: 64, offset: 320)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FVB_WRITE", file: !195, line: 258, baseType: !222)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "EraseBlocks", scope: !196, file: !195, line: 342, baseType: !229, size: 64, offset: 384)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FVB_ERASE_BLOCKS", file: !195, line: 321, baseType: !230)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DISubroutineType(types: !232)
!232 = !{!25, !203, null}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "ParentHandle", scope: !196, file: !195, line: 346, baseType: !102, size: 64, offset: 448)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "FtwBackupFvb", scope: !98, file: !97, line: 71, baseType: !193, size: 64, offset: 1280)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "FtwSpareLba", scope: !98, file: !97, line: 72, baseType: !64, size: 64, offset: 1344)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "FtwWorkBlockLba", scope: !98, file: !97, line: 73, baseType: !64, size: 64, offset: 1408)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "NumberOfWorkBlock", scope: !98, file: !97, line: 74, baseType: !9, size: 64, offset: 1472)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "FtwWorkSpaceLba", scope: !98, file: !97, line: 75, baseType: !64, size: 64, offset: 1536)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "FtwWorkSpaceBase", scope: !98, file: !97, line: 76, baseType: !9, size: 64, offset: 1600)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "FtwWorkSpaceSize", scope: !98, file: !97, line: 77, baseType: !9, size: 64, offset: 1664)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "FtwWorkSpaceLbaInSpare", scope: !98, file: !97, line: 78, baseType: !64, size: 64, offset: 1728)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "FtwWorkSpaceBaseInSpare", scope: !98, file: !97, line: 79, baseType: !9, size: 64, offset: 1792)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "FtwWorkSpace", scope: !98, file: !97, line: 80, baseType: !225, size: 64, offset: 1856)
!244 = !DIGlobalVariableExpression(var: !245, expr: !DIExpression())
!245 = distinct !DIGlobalVariable(name: "mEndOfDxe", scope: !2, file: !94, line: 65, type: !16, isLocal: false, isDefinition: true)
!246 = !DIGlobalVariableExpression(var: !247, expr: !DIExpression(DW_OP_constu, 2, DW_OP_stack_value))
!247 = distinct !DIGlobalVariable(name: "ByProtocol", scope: !2, file: !248, line: 1473, type: !249, isLocal: true, isDefinition: true)
!248 = !DIFile(filename: "MdePkg/Include/Uefi/UefiSpec.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "dd07249351b00161d82576c2d3d57d19")
!249 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!250 = !DIGlobalVariableExpression(var: !251, expr: !DIExpression(DW_OP_constu, 0, DW_OP_stack_value))
!251 = distinct !DIGlobalVariable(name: "EFI_NATIVE_INTERFACE", scope: !2, file: !248, line: 1148, type: !249, isLocal: true, isDefinition: true)
!252 = !{i32 2, !"CodeView", i32 1}
!253 = !{i32 2, !"Debug Info Version", i32 3}
!254 = !{i32 1, !"wchar_size", i32 2}
!255 = !{i32 7, !"PIC Level", i32 2}
!256 = !{i32 1, !"Code Model", i32 1}
!257 = !{i32 7, !"uwtable", i32 1}
!258 = !{i32 1, !"ThinLTO", i32 0}
!259 = !{i32 1, !"EnableSplitLTOUnit", i32 1}
!260 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!261 = distinct !DISubprogram(name: "FtwGetFvbByHandle", scope: !94, file: !94, line: 80, type: !262, scopeLine: 84, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !265)
!262 = !DISubroutineType(types: !263)
!263 = !{!25, !102, !264}
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!265 = !{}
!266 = !DILocalVariable(name: "FvBlockHandle", arg: 1, scope: !261, file: !94, line: 81, type: !102)
!267 = !DILocation(line: 81, scope: !261)
!268 = !DILocalVariable(name: "FvBlock", arg: 2, scope: !261, file: !94, line: 82, type: !264)
!269 = !DILocation(line: 82, scope: !261)
!270 = !DILocation(line: 88, scope: !261)
!271 = distinct !DISubprogram(name: "FtwGetSarProtocol", scope: !94, file: !94, line: 106, type: !272, scopeLine: 109, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !265)
!272 = !DISubroutineType(types: !273)
!273 = !{!25, !5}
!274 = !DILocalVariable(name: "SarProtocol", arg: 1, scope: !271, file: !94, line: 107, type: !5)
!275 = !DILocation(line: 107, scope: !271)
!276 = !DILocalVariable(name: "Status", scope: !271, file: !94, line: 110, type: !25)
!277 = !DILocation(line: 110, scope: !271)
!278 = !DILocation(line: 115, scope: !271)
!279 = !DILocation(line: 120, scope: !271)
!280 = distinct !DISubprogram(name: "GetFvbCountAndBuffer", scope: !94, file: !94, line: 139, type: !281, scopeLine: 143, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !265)
!281 = !DISubroutineType(types: !282)
!282 = !{!25, !114, !283}
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!285 = !DILocalVariable(name: "NumberHandles", arg: 1, scope: !280, file: !94, line: 140, type: !114)
!286 = !DILocation(line: 140, scope: !280)
!287 = !DILocalVariable(name: "Buffer", arg: 2, scope: !280, file: !94, line: 141, type: !283)
!288 = !DILocation(line: 141, scope: !280)
!289 = !DILocalVariable(name: "Status", scope: !280, file: !94, line: 144, type: !25)
!290 = !DILocation(line: 144, scope: !280)
!291 = !DILocalVariable(name: "BufferSize", scope: !280, file: !94, line: 145, type: !9)
!292 = !DILocation(line: 145, scope: !280)
!293 = !DILocation(line: 147, scope: !280)
!294 = !DILocation(line: 148, scope: !295)
!295 = distinct !DILexicalBlock(scope: !296, file: !94, line: 147)
!296 = distinct !DILexicalBlock(scope: !280, file: !94, line: 147)
!297 = !DILocation(line: 151, scope: !280)
