; ModuleID = './bcfiles/Ip6Nd.bc'
source_filename = "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main/NetworkPkg/Ip6Dxe/Ip6Nd.c"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-windows-gnu"

%struct.EFI_MAC_ADDRESS = type { [32 x i8] }

!9 = !DIEnumerator(name: "Ip6ConfigPolicyManual", value: 0)
!10 = !DIEnumerator(name: "Ip6ConfigPolicyAutomatic", value: 1)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 25, baseType: !7, size: 32, elements: !12)
!12 = !{!13, !14, !15, !16, !17, !18, !19, !20}
!13 = !DIEnumerator(name: "Ip6ConfigDataTypeInterfaceInfo", value: 0)
!14 = !DIEnumerator(name: "Ip6ConfigDataTypeAltInterfaceId", value: 1)
!15 = !DIEnumerator(name: "Ip6ConfigDataTypePolicy", value: 2)
!16 = !DIEnumerator(name: "Ip6ConfigDataTypeDupAddrDetectTransmits", value: 3)
!17 = !DIEnumerator(name: "Ip6ConfigDataTypeManualAddress", value: 4)
!18 = !DIEnumerator(name: "Ip6ConfigDataTypeGateway", value: 5)
!19 = !DIEnumerator(name: "Ip6ConfigDataTypeDnsServer", value: 6)
!20 = !DIEnumerator(name: "Ip6ConfigDataTypeMaximum", value: 7)
!21 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !22, line: 28, baseType: !7, size: 32, elements: !23)
!22 = !DIFile(filename: "MdePkg/Include/Protocol/Dhcp6.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "bf699e189e28cf80226db9221bce0cd8")
!23 = !{!24, !25, !26, !27, !28, !29, !30, !31, !32}
!24 = !DIEnumerator(name: "Dhcp6Init", value: 0)
!25 = !DIEnumerator(name: "Dhcp6Selecting", value: 1)
!26 = !DIEnumerator(name: "Dhcp6Requesting", value: 2)
!27 = !DIEnumerator(name: "Dhcp6Declining", value: 3)
!28 = !DIEnumerator(name: "Dhcp6Confirming", value: 4)
!29 = !DIEnumerator(name: "Dhcp6Releasing", value: 5)
!30 = !DIEnumerator(name: "Dhcp6Bound", value: 6)
!31 = !DIEnumerator(name: "Dhcp6Renewing", value: 7)
!32 = !DIEnumerator(name: "Dhcp6Rebinding", value: 8)
!33 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !22, line: 76, baseType: !7, size: 32, elements: !34)
!34 = !{!35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45}
!35 = !DIEnumerator(name: "Dhcp6SendSolicit", value: 0)
!36 = !DIEnumerator(name: "Dhcp6RcvdAdvertise", value: 1)
!37 = !DIEnumerator(name: "Dhcp6SelectAdvertise", value: 2)
!38 = !DIEnumerator(name: "Dhcp6SendRequest", value: 3)
!39 = !DIEnumerator(name: "Dhcp6RcvdReply", value: 4)
!40 = !DIEnumerator(name: "Dhcp6RcvdReconfigure", value: 5)
!41 = !DIEnumerator(name: "Dhcp6SendDecline", value: 6)
!42 = !DIEnumerator(name: "Dhcp6SendConfirm", value: 7)
!43 = !DIEnumerator(name: "Dhcp6SendRelease", value: 8)
!44 = !DIEnumerator(name: "Dhcp6EnterRenewing", value: 9)
!45 = !DIEnumerator(name: "Dhcp6EnterRebinding", value: 10)
!46 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !47, line: 249, baseType: !7, size: 32, elements: !48)
!47 = !DIFile(filename: "MdePkg/Include/Protocol/Ip6.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "03feec77f7ef20187070a3208a9b2779")
!48 = !{!49, !50, !51, !52, !53}
!49 = !DIEnumerator(name: "EfiNeighborInComplete", value: 0)
!50 = !DIEnumerator(name: "EfiNeighborReachable", value: 1)
!51 = !DIEnumerator(name: "EfiNeighborStale", value: 2)
!52 = !DIEnumerator(name: "EfiNeighborDelay", value: 3)
!53 = !DIEnumerator(name: "EfiNeighborProbe", value: 4)
!54 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !55, line: 49, baseType: !7, size: 32, elements: !56)
!55 = !DIFile(filename: "MdePkg/Include/Library/UefiLib.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "70b2597622630d198af9ef8e9731274a")
!56 = !{!57, !58, !59}
!57 = !DIEnumerator(name: "EfiLockUninitialized", value: 0)
!58 = !DIEnumerator(name: "EfiLockReleased", value: 1)
!59 = !DIEnumerator(name: "EfiLockAcquired", value: 2)
!60 = !{!61, !62, !65, !70, !903, !67, !906, !116, !916, !84, !112, !1098, !717, !1107, !1108, !212, !1137, !1149, !98, !608, !290, !1159, !129, !1169, !1179}
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "BOOLEAN", file: !63, line: 192, baseType: !64)
!63 = !DIFile(filename: "MdePkg/Include/X64/ProcessorBind.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "ef2524a221fe61206fa09ec88dd4f59b")
!64 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "RETURN_STATUS", file: !66, line: 1026, baseType: !67)
!66 = !DIFile(filename: "MdePkg/Include/Base.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "0c11ea3d1992443d8a8f590a064e50ff")
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINTN", file: !63, line: 211, baseType: !68)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT64", file: !63, line: 162, baseType: !69)
!69 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "IP6_NEIGHBOR_ENTRY", file: !72, line: 142, baseType: !73)
!72 = !DIFile(filename: "NetworkPkg/Ip6Dxe/Ip6Nd.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "2ebe0ba14d20b97439a6b52535745a55")
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IP6_NEIGHBOR_ENTRY", file: !72, line: 126, size: 1088, elements: !74)
!74 = !{!75, !82, !83, !87, !88, !89, !90, !101, !109, !111, !113, !114, !115, !901}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "Link", scope: !73, file: !72, line: 127, baseType: !76, size: 128)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "LIST_ENTRY", file: !66, line: 242, baseType: !77)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_LIST_ENTRY", file: !66, line: 247, size: 128, elements: !78)
!78 = !{!79, !81}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "ForwardLink", scope: !77, file: !66, line: 248, baseType: !80, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "BackLink", scope: !77, file: !66, line: 249, baseType: !80, size: 64, offset: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "ArpList", scope: !73, file: !72, line: 128, baseType: !76, size: 128, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "RefCnt", scope: !73, file: !72, line: 129, baseType: !84, size: 64, offset: 256)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTN", file: !63, line: 216, baseType: !85)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT64", file: !63, line: 166, baseType: !86)
!86 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "IsRouter", scope: !73, file: !72, line: 130, baseType: !62, size: 8, offset: 320)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "ArpFree", scope: !73, file: !72, line: 131, baseType: !62, size: 8, offset: 328)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "Dynamic", scope: !73, file: !72, line: 132, baseType: !62, size: 8, offset: 336)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "Neighbor", scope: !73, file: !72, line: 133, baseType: !91, size: 128, offset: 344)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IPv6_ADDRESS", file: !92, line: 90, baseType: !93)
!92 = !DIFile(filename: "MdePkg/Include/Uefi/UefiBaseType.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "dbec48e65949dff122bc920c9d9d9c6a")
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPv6_ADDRESS", file: !66, line: 232, baseType: !94)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IPv6_ADDRESS", file: !66, line: 230, size: 128, elements: !95)
!95 = !{!96}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "Addr", scope: !94, file: !66, line: 231, baseType: !97, size: 128)
!97 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 128, elements: !99)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT8", file: !63, line: 196, baseType: !64)
!99 = !{!100}
!100 = !DISubrange(count: 16)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "LinkAddress", scope: !73, file: !72, line: 134, baseType: !102, size: 256, offset: 472)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MAC_ADDRESS", file: !92, line: 97, baseType: !103)
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_MAC_ADDRESS", file: !92, line: 95, size: 256, elements: !104)
!104 = !{!105}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "Addr", scope: !103, file: !92, line: 96, baseType: !106, size: 256)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 256, elements: !107)
!107 = !{!108}
!108 = !DISubrange(count: 32)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "State", scope: !73, file: !72, line: 135, baseType: !110, size: 32, offset: 736)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP6_NEIGHBOR_STATE", file: !47, line: 279, baseType: !46)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "Transmit", scope: !73, file: !72, line: 136, baseType: !112, size: 32, offset: 768)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT32", file: !63, line: 170, baseType: !7)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "Ticks", scope: !73, file: !72, line: 137, baseType: !112, size: 32, offset: 800)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "Frames", scope: !73, file: !72, line: 139, baseType: !76, size: 128, offset: 832)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "Interface", scope: !73, file: !72, line: 140, baseType: !116, size: 64, offset: 960)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "IP6_INTERFACE", file: !118, line: 62, baseType: !119)
!118 = !DIFile(filename: "NetworkPkg/Ip6Dxe/Ip6Common.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "e95ac4a10d1410e9027ad7650b72a5b6")
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IP6_INTERFACE", file: !120, line: 96, size: 1408, elements: !121)
!120 = !DIFile(filename: "NetworkPkg/Ip6Dxe/Ip6If.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "56e72ad482f6058d797f6e2e7949f2ac")
!121 = !{!122, !123, !124, !125, !126, !127, !128, !892, !893, !894, !895, !896, !897, !898, !899, !900}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", scope: !119, file: !120, line: 97, baseType: !112, size: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "Link", scope: !119, file: !120, line: 98, baseType: !76, size: 128, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "RefCnt", scope: !119, file: !120, line: 99, baseType: !84, size: 64, offset: 192)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "AddressList", scope: !119, file: !120, line: 105, baseType: !76, size: 128, offset: 256)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "AddressCount", scope: !119, file: !120, line: 106, baseType: !112, size: 32, offset: 384)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "Configured", scope: !119, file: !120, line: 107, baseType: !62, size: 8, offset: 416)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "Service", scope: !119, file: !120, line: 109, baseType: !129, size: 64, offset: 448)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "IP6_SERVICE", file: !118, line: 64, baseType: !131)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IP6_SERVICE", file: !132, line: 160, size: 33536, elements: !133)
!132 = !DIFile(filename: "NetworkPkg/Ip6Dxe/Ip6Impl.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "b89560ec6bc4ea24e929562477a41d4a")
!133 = !{!134, !135, !154, !155, !156, !157, !158, !159, !181, !371, !380, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !505, !506, !507, !508, !509, !889, !890, !891}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", scope: !131, file: !132, line: 161, baseType: !112, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "ServiceBinding", scope: !131, file: !132, line: 162, baseType: !136, size: 128, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SERVICE_BINDING_PROTOCOL", file: !137, line: 19, baseType: !138)
!137 = !DIFile(filename: "MdePkg/Include/Protocol/ServiceBinding.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "ea68c59cdcea108c5697eda607991864")
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_SERVICE_BINDING_PROTOCOL", file: !137, line: 83, size: 128, elements: !139)
!139 = !{!140, !149}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "CreateChild", scope: !138, file: !137, line: 84, baseType: !141, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SERVICE_BINDING_CREATE_CHILD", file: !137, line: 42, baseType: !142)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DISubroutineType(types: !144)
!144 = !{!145, !146, !147}
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_STATUS", file: !92, line: 29, baseType: !65)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_HANDLE", file: !92, line: 33, baseType: !61)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "DestroyChild", scope: !138, file: !137, line: 85, baseType: !150, size: 64, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SERVICE_BINDING_DESTROY_CHILD", file: !137, line: 67, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DISubroutineType(types: !153)
!153 = !{!145, !146, !148}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "State", scope: !131, file: !132, line: 163, baseType: !84, size: 64, offset: 192)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "NumChildren", scope: !131, file: !132, line: 169, baseType: !67, size: 64, offset: 256)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "Children", scope: !131, file: !132, line: 170, baseType: !76, size: 128, offset: 320)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "Interfaces", scope: !131, file: !132, line: 172, baseType: !76, size: 128, offset: 448)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "DefaultInterface", scope: !131, file: !132, line: 174, baseType: !116, size: 64, offset: 576)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "RouteTable", scope: !131, file: !132, line: 175, baseType: !160, size: 64, offset: 640)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "IP6_ROUTE_TABLE", file: !162, line: 61, baseType: !163)
!162 = !DIFile(filename: "NetworkPkg/Ip6Dxe/Ip6Route.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "0582ffe40bab8b79f336023ffa012e68")
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IP6_ROUTE_TABLE", file: !162, line: 56, size: 20864, elements: !164)
!164 = !{!165, !166, !167, !171}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "RefCnt", scope: !163, file: !162, line: 57, baseType: !84, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "TotalNum", scope: !163, file: !162, line: 58, baseType: !112, size: 32, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "RouteArea", scope: !163, file: !162, line: 59, baseType: !168, size: 16512, offset: 128)
!168 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 16512, elements: !169)
!169 = !{!170}
!170 = !DISubrange(count: 129)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "Cache", scope: !163, file: !162, line: 60, baseType: !172, size: 4224, offset: 16640)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "IP6_ROUTE_CACHE", file: !162, line: 45, baseType: !173)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IP6_ROUTE_CACHE", file: !162, line: 42, size: 4224, elements: !174)
!174 = !{!175, !179}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "CacheBucket", scope: !173, file: !162, line: 43, baseType: !176, size: 3968)
!176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 3968, elements: !177)
!177 = !{!178}
!178 = !DISubrange(count: 31)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "CacheNum", scope: !173, file: !162, line: 44, baseType: !180, size: 248, offset: 3968)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 248, elements: !177)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "RecvRequest", scope: !131, file: !132, line: 177, baseType: !182, size: 384, offset: 704)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "IP6_LINK_RX_TOKEN", file: !120, line: 53, baseType: !183)
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IP6_LINK_RX_TOKEN", file: !120, line: 48, size: 384, elements: !184)
!184 = !{!185, !186, !305, !306}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", scope: !183, file: !120, line: 49, baseType: !112, size: 32)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "CallBack", scope: !183, file: !120, line: 50, baseType: !187, size: 64, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "IP6_FRAME_CALLBACK", file: !120, line: 35, baseType: !188)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DISubroutineType(types: !190)
!190 = !{null, !191, !145, !112, !61}
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_BUF", file: !193, line: 1612, baseType: !194)
!193 = !DIFile(filename: "NetworkPkg/Include/Library/NetLib.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "9ef5aa6e52119eac072123f1d7d223d9")
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NET_BUF", file: !193, line: 1597, size: 1408, elements: !195)
!195 = !{!196, !197, !198, !199, !237, !254, !263, !267, !293, !294, !295}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", scope: !194, file: !193, line: 1598, baseType: !112, size: 32)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "RefCnt", scope: !194, file: !193, line: 1599, baseType: !84, size: 64, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "List", scope: !194, file: !193, line: 1600, baseType: !76, size: 128, offset: 128)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "Ip", scope: !194, file: !193, line: 1602, baseType: !200, size: 64, offset: 256)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_IP_HEAD", file: !193, line: 1585, baseType: !201)
!201 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "NET_IP_HEAD", file: !193, line: 1582, size: 64, elements: !202)
!202 = !{!203, !222}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "Ip4", scope: !201, file: !193, line: 1583, baseType: !204, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "IP4_HEAD", file: !193, line: 140, baseType: !206)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IP4_HEAD", file: !193, line: 128, size: 160, elements: !207)
!207 = !{!208, !209, !210, !211, !214, !215, !216, !217, !218, !219, !221}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "HeadLen", scope: !206, file: !193, line: 129, baseType: !98, size: 4, flags: DIFlagBitField, extraData: i64 0)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "Ver", scope: !206, file: !193, line: 130, baseType: !98, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "Tos", scope: !206, file: !193, line: 131, baseType: !98, size: 8, offset: 8)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "TotalLen", scope: !206, file: !193, line: 132, baseType: !212, size: 16, offset: 16)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT16", file: !63, line: 178, baseType: !213)
!213 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "Id", scope: !206, file: !193, line: 133, baseType: !212, size: 16, offset: 32)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "Fragment", scope: !206, file: !193, line: 134, baseType: !212, size: 16, offset: 48)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "Ttl", scope: !206, file: !193, line: 135, baseType: !98, size: 8, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "Protocol", scope: !206, file: !193, line: 136, baseType: !98, size: 8, offset: 72)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "Checksum", scope: !206, file: !193, line: 137, baseType: !212, size: 16, offset: 80)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "Src", scope: !206, file: !193, line: 138, baseType: !220, size: 32, offset: 96)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "IP4_ADDR", file: !193, line: 18, baseType: !112)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "Dst", scope: !206, file: !193, line: 139, baseType: !220, size: 32, offset: 128)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "Ip6", scope: !201, file: !193, line: 1584, baseType: !223, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP6_HEADER", file: !47, line: 406, baseType: !225)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_IP6_HEADER", file: !47, line: 395, size: 320, elements: !226)
!226 = !{!227, !228, !229, !230, !231, !232, !233, !234, !235, !236}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "TrafficClassH", scope: !225, file: !47, line: 396, baseType: !98, size: 4, flags: DIFlagBitField, extraData: i64 0)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "Version", scope: !225, file: !47, line: 397, baseType: !98, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "FlowLabelH", scope: !225, file: !47, line: 398, baseType: !98, size: 4, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "TrafficClassL", scope: !225, file: !47, line: 399, baseType: !98, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 8)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "FlowLabelL", scope: !225, file: !47, line: 400, baseType: !212, size: 16, offset: 16)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "PayloadLength", scope: !225, file: !47, line: 401, baseType: !212, size: 16, offset: 32)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "NextHeader", scope: !225, file: !47, line: 402, baseType: !98, size: 8, offset: 48)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "HopLimit", scope: !225, file: !47, line: 403, baseType: !98, size: 8, offset: 56)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "SourceAddress", scope: !225, file: !47, line: 404, baseType: !91, size: 128, offset: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "DestinationAddress", scope: !225, file: !47, line: 405, baseType: !91, size: 128, offset: 192)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "Tcp", scope: !194, file: !193, line: 1603, baseType: !238, size: 64, offset: 320)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "TCP_HEAD", file: !193, line: 205, baseType: !240)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TCP_HEAD", file: !193, line: 194, size: 160, elements: !241)
!241 = !{!242, !244, !245, !247, !248, !249, !250, !251, !252, !253}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "SrcPort", scope: !240, file: !193, line: 195, baseType: !243, size: 16)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "TCP_PORTNO", file: !193, line: 20, baseType: !212)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "DstPort", scope: !240, file: !193, line: 196, baseType: !243, size: 16, offset: 16)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "Seq", scope: !240, file: !193, line: 197, baseType: !246, size: 32, offset: 32)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "TCP_SEQNO", file: !193, line: 19, baseType: !112)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "Ack", scope: !240, file: !193, line: 198, baseType: !246, size: 32, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "Res", scope: !240, file: !193, line: 199, baseType: !98, size: 4, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "HeadLen", scope: !240, file: !193, line: 200, baseType: !98, size: 4, offset: 100, flags: DIFlagBitField, extraData: i64 96)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "Flag", scope: !240, file: !193, line: 201, baseType: !98, size: 8, offset: 104)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "Wnd", scope: !240, file: !193, line: 202, baseType: !212, size: 16, offset: 112)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "Checksum", scope: !240, file: !193, line: 203, baseType: !212, size: 16, offset: 128)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "Urg", scope: !240, file: !193, line: 204, baseType: !212, size: 16, offset: 144)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "Udp", scope: !194, file: !193, line: 1604, baseType: !255, size: 64, offset: 384)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_UDP_HEADER", file: !193, line: 189, baseType: !257)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_UDP_HEADER", file: !193, line: 184, size: 64, elements: !258)
!258 = !{!259, !260, !261, !262}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "SrcPort", scope: !257, file: !193, line: 185, baseType: !212, size: 16)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "DstPort", scope: !257, file: !193, line: 186, baseType: !212, size: 16, offset: 16)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !257, file: !193, line: 187, baseType: !212, size: 16, offset: 32)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "Checksum", scope: !257, file: !193, line: 188, baseType: !212, size: 16, offset: 48)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoData", scope: !194, file: !193, line: 1605, baseType: !264, size: 512, offset: 448)
!264 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 512, elements: !265)
!265 = !{!266}
!266 = !DISubrange(count: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "Vector", scope: !194, file: !193, line: 1607, baseType: !268, size: 64, offset: 960)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_VECTOR", file: !193, line: 1568, baseType: !270)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NET_VECTOR", file: !193, line: 1558, size: 512, elements: !271)
!271 = !{!272, !273, !274, !279, !280, !281, !282, !283}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", scope: !270, file: !193, line: 1559, baseType: !112, size: 32)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "RefCnt", scope: !270, file: !193, line: 1560, baseType: !84, size: 64, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "Free", scope: !270, file: !193, line: 1561, baseType: !275, size: 64, offset: 128)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_VECTOR_EXT_FREE", file: !193, line: 1551, baseType: !276)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DISubroutineType(types: !278)
!278 = !{null, !61}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "Arg", scope: !270, file: !193, line: 1562, baseType: !61, size: 64, offset: 192)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "Flag", scope: !270, file: !193, line: 1563, baseType: !112, size: 32, offset: 256)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "Len", scope: !270, file: !193, line: 1564, baseType: !112, size: 32, offset: 288)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "BlockNum", scope: !270, file: !193, line: 1566, baseType: !112, size: 32, offset: 320)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "Block", scope: !270, file: !193, line: 1567, baseType: !284, size: 128, offset: 384)
!284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !285, size: 128, elements: !291)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_BLOCK", file: !193, line: 1549, baseType: !286)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NET_BLOCK", file: !193, line: 1546, size: 128, elements: !287)
!287 = !{!288, !289}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "Len", scope: !286, file: !193, line: 1547, baseType: !112, size: 32)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "Bulk", scope: !286, file: !193, line: 1548, baseType: !290, size: 64, offset: 64)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!291 = !{!292}
!292 = !DISubrange(count: 1)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "BlockOpNum", scope: !194, file: !193, line: 1609, baseType: !112, size: 32, offset: 1024)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "TotalSize", scope: !194, file: !193, line: 1610, baseType: !112, size: 32, offset: 1056)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "BlockOp", scope: !194, file: !193, line: 1611, baseType: !296, size: 320, offset: 1088)
!296 = !DICompositeType(tag: DW_TAG_array_type, baseType: !297, size: 320, elements: !291)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_BLOCK_OP", file: !193, line: 1580, baseType: !298)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NET_BLOCK_OP", file: !193, line: 1574, size: 320, elements: !299)
!299 = !{!300, !301, !302, !303, !304}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "BlockHead", scope: !298, file: !193, line: 1575, baseType: !290, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "BlockTail", scope: !298, file: !193, line: 1576, baseType: !290, size: 64, offset: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "Head", scope: !298, file: !193, line: 1577, baseType: !290, size: 64, offset: 128)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "Tail", scope: !298, file: !193, line: 1578, baseType: !290, size: 64, offset: 192)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !298, file: !193, line: 1579, baseType: !112, size: 32, offset: 256)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "Context", scope: !183, file: !120, line: 51, baseType: !61, size: 64, offset: 128)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "MnpToken", scope: !183, file: !120, line: 52, baseType: !307, size: 192, offset: 192)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MANAGED_NETWORK_COMPLETION_TOKEN", file: !308, line: 141, baseType: !309)
!308 = !DIFile(filename: "MdePkg/Include/Protocol/ManagedNetwork.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "8951452d2c79255944d265d14ed27585")
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_MANAGED_NETWORK_COMPLETION_TOKEN", file: !308, line: 118, size: 192, elements: !310)
!310 = !{!311, !313, !314, !370}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "Event", scope: !309, file: !308, line: 125, baseType: !312, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_EVENT", file: !92, line: 37, baseType: !61)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "Status", scope: !309, file: !308, line: 130, baseType: !145, size: 64, offset: 64)
!314 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !309, file: !308, line: 131, size: 64, elements: !315)
!315 = !{!316, !351}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "RxData", scope: !314, file: !308, line: 135, baseType: !317, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MANAGED_NETWORK_RECEIVE_DATA", file: !308, line: 101, baseType: !319)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_MANAGED_NETWORK_RECEIVE_DATA", file: !308, line: 86, size: 640, elements: !320)
!320 = !{!321, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "Timestamp", scope: !319, file: !308, line: 87, baseType: !322, size: 128)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TIME", file: !92, line: 80, baseType: !323)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_TIME", file: !92, line: 68, size: 128, elements: !324)
!324 = !{!325, !326, !327, !328, !329, !330, !331, !332, !333, !336, !337}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "Year", scope: !323, file: !92, line: 69, baseType: !212, size: 16)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "Month", scope: !323, file: !92, line: 70, baseType: !98, size: 8, offset: 16)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "Day", scope: !323, file: !92, line: 71, baseType: !98, size: 8, offset: 24)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "Hour", scope: !323, file: !92, line: 72, baseType: !98, size: 8, offset: 32)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "Minute", scope: !323, file: !92, line: 73, baseType: !98, size: 8, offset: 40)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "Second", scope: !323, file: !92, line: 74, baseType: !98, size: 8, offset: 48)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "Pad1", scope: !323, file: !92, line: 75, baseType: !98, size: 8, offset: 56)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "Nanosecond", scope: !323, file: !92, line: 76, baseType: !112, size: 32, offset: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "TimeZone", scope: !323, file: !92, line: 77, baseType: !334, size: 16, offset: 96)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT16", file: !63, line: 187, baseType: !335)
!335 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "Daylight", scope: !323, file: !92, line: 78, baseType: !98, size: 8, offset: 112)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "Pad2", scope: !323, file: !92, line: 79, baseType: !98, size: 8, offset: 120)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "RecycleEvent", scope: !319, file: !308, line: 88, baseType: !312, size: 64, offset: 128)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "PacketLength", scope: !319, file: !308, line: 89, baseType: !112, size: 32, offset: 192)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "HeaderLength", scope: !319, file: !308, line: 90, baseType: !112, size: 32, offset: 224)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "AddressLength", scope: !319, file: !308, line: 91, baseType: !112, size: 32, offset: 256)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "DataLength", scope: !319, file: !308, line: 92, baseType: !112, size: 32, offset: 288)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "BroadcastFlag", scope: !319, file: !308, line: 93, baseType: !62, size: 8, offset: 320)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "MulticastFlag", scope: !319, file: !308, line: 94, baseType: !62, size: 8, offset: 328)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "PromiscuousFlag", scope: !319, file: !308, line: 95, baseType: !62, size: 8, offset: 336)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "ProtocolType", scope: !319, file: !308, line: 96, baseType: !212, size: 16, offset: 352)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "DestinationAddress", scope: !319, file: !308, line: 97, baseType: !61, size: 64, offset: 384)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "SourceAddress", scope: !319, file: !308, line: 98, baseType: !61, size: 64, offset: 448)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "MediaHeader", scope: !319, file: !308, line: 99, baseType: !61, size: 64, offset: 512)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "PacketData", scope: !319, file: !308, line: 100, baseType: !61, size: 64, offset: 576)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "TxData", scope: !314, file: !308, line: 139, baseType: !352, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MANAGED_NETWORK_TRANSMIT_DATA", file: !308, line: 116, baseType: !354)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_MANAGED_NETWORK_TRANSMIT_DATA", file: !308, line: 108, size: 384, elements: !355)
!355 = !{!356, !358, !359, !360, !361, !362, !363}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "DestinationAddress", scope: !354, file: !308, line: 109, baseType: !357, size: 64)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "SourceAddress", scope: !354, file: !308, line: 110, baseType: !357, size: 64, offset: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "ProtocolType", scope: !354, file: !308, line: 111, baseType: !212, size: 16, offset: 128)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "DataLength", scope: !354, file: !308, line: 112, baseType: !112, size: 32, offset: 160)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "HeaderLength", scope: !354, file: !308, line: 113, baseType: !212, size: 16, offset: 192)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "FragmentCount", scope: !354, file: !308, line: 114, baseType: !212, size: 16, offset: 208)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "FragmentTable", scope: !354, file: !308, line: 115, baseType: !364, size: 128, offset: 256)
!364 = !DICompositeType(tag: DW_TAG_array_type, baseType: !365, size: 128, elements: !291)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MANAGED_NETWORK_FRAGMENT_DATA", file: !308, line: 106, baseType: !366)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_MANAGED_NETWORK_FRAGMENT_DATA", file: !308, line: 103, size: 128, elements: !367)
!367 = !{!368, !369}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "FragmentLength", scope: !366, file: !308, line: 104, baseType: !112, size: 32)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "FragmentBuffer", scope: !366, file: !308, line: 105, baseType: !61, size: 64, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "Packet", scope: !309, file: !308, line: 140, baseType: !314, size: 64, offset: 128)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "Assemble", scope: !131, file: !132, line: 182, baseType: !372, size: 16256, offset: 1088)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "IP6_ASSEMBLE_TABLE", file: !373, line: 91, baseType: !374)
!373 = !DIFile(filename: "NetworkPkg/Ip6Dxe/Ip6Input.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "fb9ea47cb89320f0121ec3c9055d6294")
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IP6_ASSEMBLE_TABLE", file: !373, line: 89, size: 16256, elements: !375)
!375 = !{!376}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "Bucket", scope: !374, file: !373, line: 90, baseType: !377, size: 16256)
!377 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 16256, elements: !378)
!378 = !{!379}
!379 = !DISubrange(count: 127)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "MldCtrl", scope: !131, file: !132, line: 183, baseType: !381, size: 192, offset: 17344)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "IP6_MLD_SERVICE_DATA", file: !382, line: 47, baseType: !383)
!382 = !DIFile(filename: "NetworkPkg/Ip6Dxe/Ip6Mld.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "39ef0ea2dead418ac9a39c4086900b0b")
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IP6_MLD_SERVICE_DATA", file: !382, line: 44, size: 192, elements: !384)
!384 = !{!385, !386}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "Mldv1QuerySeen", scope: !383, file: !382, line: 45, baseType: !84, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "Groups", scope: !383, file: !382, line: 46, baseType: !76, size: 128, offset: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "LinkLocalAddr", scope: !131, file: !132, line: 185, baseType: !91, size: 128, offset: 17536)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "LinkLocalOk", scope: !131, file: !132, line: 186, baseType: !62, size: 8, offset: 17664)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "LinkLocalDadFail", scope: !131, file: !132, line: 187, baseType: !62, size: 8, offset: 17672)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "Dhcp6NeedStart", scope: !131, file: !132, line: 188, baseType: !62, size: 8, offset: 17680)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "Dhcp6NeedInfoRequest", scope: !131, file: !132, line: 189, baseType: !62, size: 8, offset: 17688)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "CurHopLimit", scope: !131, file: !132, line: 194, baseType: !98, size: 8, offset: 17696)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "LinkMTU", scope: !131, file: !132, line: 195, baseType: !112, size: 32, offset: 17728)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "BaseReachableTime", scope: !131, file: !132, line: 196, baseType: !112, size: 32, offset: 17760)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "ReachableTime", scope: !131, file: !132, line: 197, baseType: !112, size: 32, offset: 17792)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "RetransTimer", scope: !131, file: !132, line: 198, baseType: !112, size: 32, offset: 17824)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "NeighborTable", scope: !131, file: !132, line: 199, baseType: !76, size: 128, offset: 17856)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "OnlinkPrefix", scope: !131, file: !132, line: 201, baseType: !76, size: 128, offset: 17984)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "AutonomousPrefix", scope: !131, file: !132, line: 202, baseType: !76, size: 128, offset: 18112)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "DefaultRouterList", scope: !131, file: !132, line: 204, baseType: !76, size: 128, offset: 18240)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "RoundRobin", scope: !131, file: !132, line: 205, baseType: !112, size: 32, offset: 18368)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "InterfaceIdLen", scope: !131, file: !132, line: 207, baseType: !98, size: 8, offset: 18400)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "InterfaceId", scope: !131, file: !132, line: 208, baseType: !290, size: 64, offset: 18432)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "RouterAdvertiseReceived", scope: !131, file: !132, line: 210, baseType: !62, size: 8, offset: 18496)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "SolicitTimer", scope: !131, file: !132, line: 211, baseType: !98, size: 8, offset: 18504)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "Ticks", scope: !131, file: !132, line: 212, baseType: !112, size: 32, offset: 18528)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !131, file: !132, line: 217, baseType: !148, size: 64, offset: 18560)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "Controller", scope: !131, file: !132, line: 218, baseType: !148, size: 64, offset: 18624)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "MnpChildHandle", scope: !131, file: !132, line: 220, baseType: !148, size: 64, offset: 18688)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "Mnp", scope: !131, file: !132, line: 221, baseType: !411, size: 64, offset: 18752)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MANAGED_NETWORK_PROTOCOL", file: !308, line: 28, baseType: !413)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_MANAGED_NETWORK_PROTOCOL", file: !308, line: 350, size: 512, elements: !414)
!414 = !{!415, !459, !464, !485, !490, !496, !498, !500}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "GetModeData", scope: !413, file: !308, line: 351, baseType: !416, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MANAGED_NETWORK_GET_MODE_DATA", file: !308, line: 160, baseType: !417)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DISubroutineType(types: !419)
!419 = !{!145, !411, !420, !434}
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MANAGED_NETWORK_CONFIG_DATA", file: !308, line: 84, baseType: !422)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_MANAGED_NETWORK_CONFIG_DATA", file: !308, line: 30, size: 160, elements: !423)
!423 = !{!424, !425, !426, !427, !428, !429, !430, !431, !432, !433}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "ReceivedQueueTimeoutValue", scope: !422, file: !308, line: 35, baseType: !112, size: 32)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "TransmitQueueTimeoutValue", scope: !422, file: !308, line: 40, baseType: !112, size: 32, offset: 32)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "ProtocolTypeFilter", scope: !422, file: !308, line: 45, baseType: !212, size: 16, offset: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "EnableUnicastReceive", scope: !422, file: !308, line: 50, baseType: !62, size: 8, offset: 80)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "EnableMulticastReceive", scope: !422, file: !308, line: 55, baseType: !62, size: 8, offset: 88)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "EnableBroadcastReceive", scope: !422, file: !308, line: 60, baseType: !62, size: 8, offset: 96)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "EnablePromiscuousReceive", scope: !422, file: !308, line: 65, baseType: !62, size: 8, offset: 104)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "FlushQueuesOnReset", scope: !422, file: !308, line: 70, baseType: !62, size: 8, offset: 112)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "EnableReceiveTimestamps", scope: !422, file: !308, line: 76, baseType: !62, size: 8, offset: 120)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "DisableBackgroundPolling", scope: !422, file: !308, line: 83, baseType: !62, size: 8, offset: 128)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_NETWORK_MODE", file: !436, line: 242, baseType: !437)
!436 = !DIFile(filename: "MdePkg/Include/Protocol/SimpleNetwork.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "ce4888de327acb559b98965e4f2a0a5b")
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_SIMPLE_NETWORK_MODE", file: !436, line: 162, size: 5248, elements: !438)
!438 = !{!439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !451, !452, !453, !454, !455, !456, !457, !458}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "State", scope: !437, file: !436, line: 166, baseType: !112, size: 32)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "HwAddressSize", scope: !437, file: !436, line: 170, baseType: !112, size: 32, offset: 32)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "MediaHeaderSize", scope: !437, file: !436, line: 174, baseType: !112, size: 32, offset: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "MaxPacketSize", scope: !437, file: !436, line: 178, baseType: !112, size: 32, offset: 96)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "NvRamSize", scope: !437, file: !436, line: 182, baseType: !112, size: 32, offset: 128)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "NvRamAccessSize", scope: !437, file: !436, line: 189, baseType: !112, size: 32, offset: 160)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "ReceiveFilterMask", scope: !437, file: !436, line: 193, baseType: !112, size: 32, offset: 192)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "ReceiveFilterSetting", scope: !437, file: !436, line: 197, baseType: !112, size: 32, offset: 224)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "MaxMCastFilterCount", scope: !437, file: !436, line: 201, baseType: !112, size: 32, offset: 256)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "MCastFilterCount", scope: !437, file: !436, line: 205, baseType: !112, size: 32, offset: 288)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "MCastFilter", scope: !437, file: !436, line: 209, baseType: !450, size: 4096, offset: 320)
!450 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 4096, elements: !99)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "CurrentAddress", scope: !437, file: !436, line: 213, baseType: !102, size: 256, offset: 4416)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "BroadcastAddress", scope: !437, file: !436, line: 217, baseType: !102, size: 256, offset: 4672)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "PermanentAddress", scope: !437, file: !436, line: 221, baseType: !102, size: 256, offset: 4928)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "IfType", scope: !437, file: !436, line: 225, baseType: !98, size: 8, offset: 5184)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "MacAddressChangeable", scope: !437, file: !436, line: 229, baseType: !62, size: 8, offset: 5192)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "MultipleTxSupported", scope: !437, file: !436, line: 233, baseType: !62, size: 8, offset: 5200)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "MediaPresentSupported", scope: !437, file: !436, line: 237, baseType: !62, size: 8, offset: 5208)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "MediaPresent", scope: !437, file: !436, line: 241, baseType: !62, size: 8, offset: 5216)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "Configure", scope: !413, file: !308, line: 352, baseType: !460, size: 64, offset: 64)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MANAGED_NETWORK_CONFIGURE", file: !308, line: 187, baseType: !461)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DISubroutineType(types: !463)
!463 = !{!145, !411, !420}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "McastIpToMac", scope: !413, file: !308, line: 353, baseType: !465, size: 64, offset: 128)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MANAGED_NETWORK_MCAST_IP_TO_MAC", file: !308, line: 215, baseType: !466)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DISubroutineType(types: !468)
!468 = !{!145, !411, !62, !469, !357}
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP_ADDRESS", file: !92, line: 107, baseType: !471)
!471 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "EFI_IP_ADDRESS", file: !92, line: 103, size: 128, elements: !472)
!472 = !{!473, !477, !484}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "Addr", scope: !471, file: !92, line: 104, baseType: !474, size: 128)
!474 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 128, elements: !475)
!475 = !{!476}
!476 = !DISubrange(count: 4)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !471, file: !92, line: 105, baseType: !478, size: 32)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IPv4_ADDRESS", file: !92, line: 85, baseType: !479)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPv4_ADDRESS", file: !66, line: 225, baseType: !480)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IPv4_ADDRESS", file: !66, line: 223, size: 32, elements: !481)
!481 = !{!482}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "Addr", scope: !480, file: !66, line: 224, baseType: !483, size: 32)
!483 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 32, elements: !475)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !471, file: !92, line: 106, baseType: !91, size: 128)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "Groups", scope: !413, file: !308, line: 354, baseType: !486, size: 64, offset: 192)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MANAGED_NETWORK_GROUPS", file: !308, line: 245, baseType: !487)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DISubroutineType(types: !489)
!489 = !{!145, !411, !62, !357}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "Transmit", scope: !413, file: !308, line: 355, baseType: !491, size: 64, offset: 256)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MANAGED_NETWORK_TRANSMIT", file: !308, line: 269, baseType: !492)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DISubroutineType(types: !494)
!494 = !{!145, !411, !495}
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "Receive", scope: !413, file: !308, line: 356, baseType: !497, size: 64, offset: 320)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MANAGED_NETWORK_RECEIVE", file: !308, line: 295, baseType: !492)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "Cancel", scope: !413, file: !308, line: 357, baseType: !499, size: 64, offset: 384)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MANAGED_NETWORK_CANCEL", file: !308, line: 321, baseType: !492)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "Poll", scope: !413, file: !308, line: 358, baseType: !501, size: 64, offset: 448)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MANAGED_NETWORK_POLL", file: !308, line: 342, baseType: !502)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DISubroutineType(types: !504)
!504 = !{!145, !411}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "MnpConfigData", scope: !131, file: !132, line: 223, baseType: !421, size: 160, offset: 18816)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "SnpMode", scope: !131, file: !132, line: 224, baseType: !435, size: 5248, offset: 18976)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "Timer", scope: !131, file: !132, line: 226, baseType: !312, size: 64, offset: 24256)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "FasterTimer", scope: !131, file: !132, line: 227, baseType: !312, size: 64, offset: 24320)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "Ip6ConfigInstance", scope: !131, file: !132, line: 232, baseType: !510, size: 9024, offset: 24384)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "IP6_CONFIG_INSTANCE", file: !511, line: 25, baseType: !512)
!511 = !DIFile(filename: "NetworkPkg/Ip6Dxe/Ip6ConfigImpl.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "1b2f10d4268c1155d940016774bdc9c5")
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IP6_CONFIG_INSTANCE", file: !511, line: 177, size: 9024, elements: !513)
!513 = !{!514, !515, !516, !517, !518, !545, !553, !555, !560, !613, !614, !615, !638, !639, !640, !641, !776, !777, !778, !779, !780, !781, !782, !876}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", scope: !512, file: !511, line: 178, baseType: !112, size: 32)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "Configured", scope: !512, file: !511, line: 179, baseType: !62, size: 8, offset: 32)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "Link", scope: !512, file: !511, line: 180, baseType: !76, size: 128, offset: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "IfIndex", scope: !512, file: !511, line: 181, baseType: !212, size: 16, offset: 192)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "InterfaceInfo", scope: !512, file: !511, line: 183, baseType: !519, size: 1088, offset: 256)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP6_CONFIG_INTERFACE_INFO", file: !6, line: 139, baseType: !520)
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_IP6_CONFIG_INTERFACE_INFO", file: !6, line: 102, size: 1088, elements: !521)
!521 = !{!522, !525, !526, !527, !528, !529, !536, !537}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "Name", scope: !520, file: !6, line: 106, baseType: !523, size: 512)
!523 = !DICompositeType(tag: DW_TAG_array_type, baseType: !524, size: 512, elements: !107)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHAR16", file: !63, line: 183, baseType: !213)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "IfType", scope: !520, file: !6, line: 110, baseType: !98, size: 8, offset: 512)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "HwAddressSize", scope: !520, file: !6, line: 114, baseType: !112, size: 32, offset: 544)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "HwAddress", scope: !520, file: !6, line: 118, baseType: !102, size: 256, offset: 576)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "AddressInfoCount", scope: !520, file: !6, line: 122, baseType: !112, size: 32, offset: 832)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "AddressInfo", scope: !520, file: !6, line: 129, baseType: !530, size: 64, offset: 896)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP6_ADDRESS_INFO", file: !47, line: 223, baseType: !532)
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_IP6_ADDRESS_INFO", file: !47, line: 220, size: 136, elements: !533)
!533 = !{!534, !535}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "Address", scope: !532, file: !47, line: 221, baseType: !91, size: 128)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "PrefixLength", scope: !532, file: !47, line: 222, baseType: !98, size: 8, offset: 128)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "RouteCount", scope: !520, file: !6, line: 133, baseType: !112, size: 32, offset: 960)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "RouteTable", scope: !520, file: !6, line: 138, baseType: !538, size: 64, offset: 1024)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP6_ROUTE_TABLE", file: !47, line: 244, baseType: !540)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_IP6_ROUTE_TABLE", file: !47, line: 229, size: 264, elements: !541)
!541 = !{!542, !543, !544}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "Gateway", scope: !540, file: !47, line: 235, baseType: !91, size: 128)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "Destination", scope: !540, file: !47, line: 239, baseType: !91, size: 128, offset: 128)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "PrefixLength", scope: !540, file: !47, line: 243, baseType: !98, size: 8, offset: 256)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "AltIfId", scope: !512, file: !511, line: 184, baseType: !546, size: 64, offset: 1344)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP6_CONFIG_INTERFACE_ID", file: !6, line: 147, baseType: !547)
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_IP6_CONFIG_INTERFACE_ID", file: !6, line: 145, size: 64, elements: !548)
!548 = !{!549}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "Id", scope: !547, file: !6, line: 146, baseType: !550, size: 64)
!550 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 64, elements: !551)
!551 = !{!552}
!552 = !DISubrange(count: 8)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "Policy", scope: !512, file: !511, line: 185, baseType: !554, size: 32, offset: 1408)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP6_CONFIG_POLICY", file: !6, line: 176, baseType: !5)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "DadXmits", scope: !512, file: !511, line: 186, baseType: !556, size: 32, offset: 1440)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP6_CONFIG_DUP_ADDR_DETECT_TRANSMITS", file: !6, line: 186, baseType: !557)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_IP6_CONFIG_DUP_ADDR_DETECT_TRANSMITS", file: !6, line: 184, size: 32, elements: !558)
!558 = !{!559}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "DupAddrDetectTransmits", scope: !557, file: !6, line: 185, baseType: !112, size: 32)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "DataItem", scope: !512, file: !511, line: 188, baseType: !561, size: 4928, offset: 1472)
!561 = !DICompositeType(tag: DW_TAG_array_type, baseType: !562, size: 4928, elements: !611)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "IP6_CONFIG_DATA_ITEM", file: !511, line: 119, baseType: !563)
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IP6_CONFIG_DATA_ITEM", file: !511, line: 111, size: 704, elements: !564)
!564 = !{!565, !571, !577, !578, !579, !586, !610}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "SetData", scope: !563, file: !511, line: 112, baseType: !566, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "IP6_CONFIG_SET_DATA", file: !511, line: 70, baseType: !567)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DISubroutineType(types: !569)
!569 = !{!145, !570, !67, !61}
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "GetData", scope: !563, file: !511, line: 113, baseType: !572, size: 64, offset: 64)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "IP6_CONFIG_GET_DATA", file: !511, line: 94, baseType: !573)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = !DISubroutineType(types: !575)
!575 = !{!145, !570, !576, !61}
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "Status", scope: !563, file: !511, line: 114, baseType: !145, size: 64, offset: 128)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "Attribute", scope: !563, file: !511, line: 115, baseType: !98, size: 8, offset: 192)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "EventMap", scope: !563, file: !511, line: 116, baseType: !580, size: 320, offset: 256)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_MAP", file: !193, line: 799, baseType: !581)
!581 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NET_MAP", file: !193, line: 795, size: 320, elements: !582)
!582 = !{!583, !584, !585}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "Used", scope: !581, file: !193, line: 796, baseType: !76, size: 128)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "Recycled", scope: !581, file: !193, line: 797, baseType: !76, size: 128, offset: 128)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "Count", scope: !581, file: !193, line: 798, baseType: !67, size: 64, offset: 256)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !563, file: !511, line: 117, baseType: !587, size: 64, offset: 576)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "IP6_CONFIG_DATA", file: !511, line: 109, baseType: !588)
!588 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "IP6_CONFIG_DATA", file: !511, line: 100, size: 64, elements: !589)
!589 = !{!590, !591, !593, !595, !597, !599, !607, !609}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "Ptr", scope: !588, file: !511, line: 101, baseType: !61, size: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "IfInfo", scope: !588, file: !511, line: 102, baseType: !592, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "AltIfId", scope: !588, file: !511, line: 103, baseType: !594, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "Policy", scope: !588, file: !511, line: 104, baseType: !596, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "DadXmits", scope: !588, file: !511, line: 105, baseType: !598, size: 64)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "ManualAddress", scope: !588, file: !511, line: 106, baseType: !600, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP6_CONFIG_MANUAL_ADDRESS", file: !6, line: 197, baseType: !602)
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_IP6_CONFIG_MANUAL_ADDRESS", file: !6, line: 193, size: 144, elements: !603)
!603 = !{!604, !605, !606}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "Address", scope: !602, file: !6, line: 194, baseType: !91, size: 128)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "IsAnycast", scope: !602, file: !6, line: 195, baseType: !62, size: 8, offset: 128)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "PrefixLength", scope: !602, file: !6, line: 196, baseType: !98, size: 8, offset: 136)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "Gateway", scope: !588, file: !511, line: 107, baseType: !608, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "DnsServers", scope: !588, file: !511, line: 108, baseType: !608, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "DataSize", scope: !563, file: !511, line: 118, baseType: !67, size: 64, offset: 640)
!611 = !{!612}
!612 = !DISubrange(count: 7)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "DadFailedMap", scope: !512, file: !511, line: 189, baseType: !580, size: 320, offset: 6400)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "DadPassedMap", scope: !512, file: !511, line: 190, baseType: !580, size: 320, offset: 6720)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "Ip6Config", scope: !512, file: !511, line: 192, baseType: !616, size: 256, offset: 7040)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP6_CONFIG_PROTOCOL", file: !6, line: 20, baseType: !617)
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_IP6_CONFIG_PROTOCOL", file: !6, line: 358, size: 256, elements: !618)
!618 = !{!619, !626, !631, !636}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "SetData", scope: !617, file: !6, line: 359, baseType: !620, size: 64)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP6_CONFIG_SET_DATA", file: !6, line: 248, baseType: !621)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DISubroutineType(types: !623)
!623 = !{!145, !624, !625, !67, !61}
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP6_CONFIG_DATA_TYPE", file: !6, line: 95, baseType: !11)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "GetData", scope: !617, file: !6, line: 360, baseType: !627, size: 64, offset: 64)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP6_CONFIG_GET_DATA", file: !6, line: 294, baseType: !628)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DISubroutineType(types: !630)
!630 = !{!145, !624, !625, !576, !61}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "RegisterDataNotify", scope: !617, file: !6, line: 361, baseType: !632, size: 64, offset: 128)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP6_CONFIG_REGISTER_NOTIFY", file: !6, line: 325, baseType: !633)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DISubroutineType(types: !635)
!635 = !{!145, !624, !625, !312}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "UnregisterDataNotify", scope: !617, file: !6, line: 362, baseType: !637, size: 64, offset: 192)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP6_CONFIG_UNREGISTER_NOTIFY", file: !6, line: 348, baseType: !633)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "Dhcp6SbNotifyEvent", scope: !512, file: !511, line: 194, baseType: !312, size: 64, offset: 7296)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "Registration", scope: !512, file: !511, line: 195, baseType: !61, size: 64, offset: 7360)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "Dhcp6Handle", scope: !512, file: !511, line: 196, baseType: !148, size: 64, offset: 7424)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "Dhcp6", scope: !512, file: !511, line: 197, baseType: !642, size: 64, offset: 7488)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP6_PROTOCOL", file: !22, line: 26, baseType: !644)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_DHCP6_PROTOCOL", file: !22, line: 765, size: 576, elements: !645)
!645 = !{!646, !737, !742, !747, !756, !761, !766, !768, !770}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "GetModeData", scope: !644, file: !22, line: 766, baseType: !647, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP6_GET_MODE_DATA", file: !22, line: 421, baseType: !648)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DISubroutineType(types: !650)
!650 = !{!145, !642, !651, !702}
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP6_MODE_DATA", file: !22, line: 294, baseType: !653)
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_DHCP6_MODE_DATA", file: !22, line: 284, size: 128, elements: !654)
!654 = !{!655, !663}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "ClientId", scope: !653, file: !22, line: 288, baseType: !656, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP6_DUID", file: !22, line: 214, baseType: !658)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_DHCP6_DUID", file: !22, line: 205, size: 32, elements: !659)
!659 = !{!660, !661}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !658, file: !22, line: 209, baseType: !212, size: 16)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "Duid", scope: !658, file: !22, line: 213, baseType: !662, size: 8, offset: 16)
!662 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 8, elements: !291)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "Ia", scope: !653, file: !22, line: 293, baseType: !664, size: 64, offset: 64)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP6_IA", file: !22, line: 282, baseType: !666)
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_DHCP6_IA", file: !22, line: 260, size: 448, elements: !667)
!667 = !{!668, !674, !676, !693, !694}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "Descriptor", scope: !666, file: !22, line: 264, baseType: !669, size: 64)
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP6_IA_DESCRIPTOR", file: !22, line: 258, baseType: !670)
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_DHCP6_IA_DESCRIPTOR", file: !22, line: 255, size: 64, elements: !671)
!671 = !{!672, !673}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !670, file: !22, line: 256, baseType: !212, size: 16)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "IaId", scope: !670, file: !22, line: 257, baseType: !112, size: 32, offset: 32)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "State", scope: !666, file: !22, line: 268, baseType: !675, size: 32, offset: 64)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP6_STATE", file: !22, line: 74, baseType: !21)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "ReplyPacket", scope: !666, file: !22, line: 272, baseType: !677, size: 64, offset: 128)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP6_PACKET", file: !22, line: 201, baseType: !679)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_DHCP6_PACKET", file: !22, line: 181, size: 104, elements: !680)
!680 = !{!681, !682, !683, !692}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !679, file: !22, line: 185, baseType: !112, size: 32)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !679, file: !22, line: 190, baseType: !112, size: 32, offset: 32)
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !679, file: !22, line: 191, size: 40, elements: !684)
!684 = !{!685, !691}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "Header", scope: !683, file: !22, line: 195, baseType: !686, size: 32)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP6_HEADER", file: !22, line: 175, baseType: !687)
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_DHCP6_HEADER", file: !22, line: 166, size: 32, elements: !688)
!688 = !{!689, !690}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "MessageType", scope: !687, file: !22, line: 170, baseType: !112, size: 8, flags: DIFlagBitField, extraData: i64 0)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "TransactionId", scope: !687, file: !22, line: 174, baseType: !112, size: 24, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "Option", scope: !683, file: !22, line: 199, baseType: !662, size: 8, offset: 32)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "Dhcp6", scope: !679, file: !22, line: 200, baseType: !683, size: 40, offset: 64)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "IaAddressCount", scope: !666, file: !22, line: 276, baseType: !112, size: 32, offset: 192)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "IaAddress", scope: !666, file: !22, line: 281, baseType: !695, size: 192, offset: 224)
!695 = !DICompositeType(tag: DW_TAG_array_type, baseType: !696, size: 192, elements: !291)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP6_IA_ADDRESS", file: !22, line: 253, baseType: !697)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_DHCP6_IA_ADDRESS", file: !22, line: 240, size: 192, elements: !698)
!698 = !{!699, !700, !701}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "IpAddress", scope: !697, file: !22, line: 244, baseType: !91, size: 128)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "PreferredLifetime", scope: !697, file: !22, line: 248, baseType: !112, size: 32, offset: 128)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "ValidLifetime", scope: !697, file: !22, line: 252, baseType: !112, size: 32, offset: 160)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP6_CONFIG_DATA", file: !22, line: 378, baseType: !704)
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_DHCP6_CONFIG_DATA", file: !22, line: 327, size: 512, elements: !705)
!705 = !{!706, !713, !714, !715, !724, !725, !726, !727, !728}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "Dhcp6Callback", scope: !704, file: !22, line: 332, baseType: !707, size: 64)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP6_CALLBACK", file: !22, line: 318, baseType: !708)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DISubroutineType(types: !710)
!710 = !{!145, !642, !61, !675, !711, !677, !712}
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP6_EVENT", file: !22, line: 129, baseType: !33)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "CallbackContext", scope: !704, file: !22, line: 336, baseType: !61, size: 64, offset: 64)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "OptionCount", scope: !704, file: !22, line: 340, baseType: !112, size: 32, offset: 128)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "OptionList", scope: !704, file: !22, line: 348, baseType: !716, size: 64, offset: 192)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP6_PACKET_OPTION", file: !22, line: 160, baseType: !719)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_DHCP6_PACKET_OPTION", file: !22, line: 146, size: 40, elements: !720)
!720 = !{!721, !722, !723}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "OpCode", scope: !719, file: !22, line: 150, baseType: !212, size: 16)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "OpLen", scope: !719, file: !22, line: 155, baseType: !212, size: 16, offset: 16)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !719, file: !22, line: 159, baseType: !662, size: 8, offset: 32)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "IaDescriptor", scope: !704, file: !22, line: 352, baseType: !669, size: 64, offset: 256)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "IaInfoEvent", scope: !704, file: !22, line: 360, baseType: !312, size: 64, offset: 320)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "ReconfigureAccept", scope: !704, file: !22, line: 366, baseType: !62, size: 8, offset: 384)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "RapidCommit", scope: !704, file: !22, line: 372, baseType: !62, size: 8, offset: 392)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "SolicitRetransmission", scope: !704, file: !22, line: 377, baseType: !729, size: 64, offset: 448)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP6_RETRANSMISSION", file: !22, line: 238, baseType: !731)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_DHCP6_RETRANSMISSION", file: !22, line: 216, size: 128, elements: !732)
!732 = !{!733, !734, !735, !736}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "Irt", scope: !731, file: !22, line: 220, baseType: !112, size: 32)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "Mrc", scope: !731, file: !22, line: 225, baseType: !112, size: 32, offset: 32)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "Mrt", scope: !731, file: !22, line: 231, baseType: !112, size: 32, offset: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "Mrd", scope: !731, file: !22, line: 237, baseType: !112, size: 32, offset: 96)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "Configure", scope: !644, file: !22, line: 767, baseType: !738, size: 64, offset: 64)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP6_CONFIGURE", file: !22, line: 465, baseType: !739)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DISubroutineType(types: !741)
!741 = !{!145, !642, !702}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "Start", scope: !644, file: !22, line: 768, baseType: !743, size: 64, offset: 128)
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP6_START", file: !22, line: 506, baseType: !744)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DISubroutineType(types: !746)
!746 = !{!145, !642}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "InfoRequest", scope: !644, file: !22, line: 769, baseType: !748, size: 64, offset: 192)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP6_INFO_REQUEST", file: !22, line: 569, baseType: !749)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DISubroutineType(types: !751)
!751 = !{!145, !642, !62, !717, !112, !716, !729, !312, !752, !61}
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP6_INFO_CALLBACK", file: !22, line: 397, baseType: !753)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DISubroutineType(types: !755)
!755 = !{!145, !642, !61, !677}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "RenewRebind", scope: !644, file: !22, line: 770, baseType: !757, size: 64, offset: 256)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP6_RENEW_REBIND", file: !22, line: 623, baseType: !758)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = !DISubroutineType(types: !760)
!760 = !{!145, !642, !62}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "Decline", scope: !644, file: !22, line: 771, baseType: !762, size: 64, offset: 320)
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP6_DECLINE", file: !22, line: 661, baseType: !763)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DISubroutineType(types: !765)
!765 = !{!145, !642, !112, !608}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "Release", scope: !644, file: !22, line: 772, baseType: !767, size: 64, offset: 384)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP6_RELEASE", file: !22, line: 699, baseType: !763)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "Stop", scope: !644, file: !22, line: 773, baseType: !769, size: 64, offset: 448)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP6_STOP", file: !22, line: 724, baseType: !744)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "Parse", scope: !644, file: !22, line: 774, baseType: !771, size: 64, offset: 512)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP6_PARSE", file: !22, line: 754, baseType: !772)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DISubroutineType(types: !774)
!774 = !{!145, !642, !677, !775, !716}
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "OtherInfoOnly", scope: !512, file: !511, line: 198, baseType: !62, size: 8, offset: 7552)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "IaId", scope: !512, file: !511, line: 199, baseType: !112, size: 32, offset: 7584)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "Dhcp6Event", scope: !512, file: !511, line: 200, baseType: !312, size: 64, offset: 7616)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "FailedIaAddressCount", scope: !512, file: !511, line: 201, baseType: !112, size: 32, offset: 7680)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "DeclineAddress", scope: !512, file: !511, line: 202, baseType: !608, size: 64, offset: 7744)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "DeclineAddressCount", scope: !512, file: !511, line: 203, baseType: !112, size: 32, offset: 7808)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "CallbackInfo", scope: !512, file: !511, line: 205, baseType: !783, size: 448, offset: 7872)
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "IP6_FORM_CALLBACK_INFO", file: !511, line: 175, baseType: !784)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IP6_FORM_CALLBACK_INFO", file: !511, line: 169, size: 448, elements: !785)
!785 = !{!786, !787, !788, !862, !874}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", scope: !784, file: !511, line: 170, baseType: !112, size: 32)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "ChildHandle", scope: !784, file: !511, line: 171, baseType: !148, size: 64, offset: 64)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "HiiConfigAccess", scope: !784, file: !511, line: 172, baseType: !789, size: 192, offset: 128)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_HII_CONFIG_ACCESS_PROTOCOL", file: !790, line: 24, baseType: !791)
!790 = !DIFile(filename: "MdePkg/Include/Protocol/HiiConfigAccess.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "28aca70a815c585de93fddb87adfb5f2")
!791 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_HII_CONFIG_ACCESS_PROTOCOL", file: !790, line: 208, size: 192, elements: !792)
!792 = !{!793, !805, !810}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "ExtractConfig", scope: !791, file: !790, line: 209, baseType: !794, size: 64)
!794 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_HII_ACCESS_EXTRACT_CONFIG", file: !790, line: 111, baseType: !795)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = !DISubroutineType(types: !797)
!797 = !{!145, !798, !800, !804, !804}
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !789)
!800 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !801)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_STRING", file: !802, line: 24, baseType: !803)
!802 = !DIFile(filename: "MdePkg/Include/Uefi/UefiInternalFormRepresentation.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "3f1e22c0ac6212323904b532b580b845")
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "RouteConfig", scope: !791, file: !790, line: 210, baseType: !806, size: 64, offset: 64)
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_HII_ACCESS_ROUTE_CONFIG", file: !790, line: 160, baseType: !807)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = !DISubroutineType(types: !809)
!809 = !{!145, !798, !800, !804}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "Callback", scope: !791, file: !790, line: 211, baseType: !811, size: 64, offset: 128)
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_HII_ACCESS_FORM_CALLBACK", file: !790, line: 193, baseType: !812)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!813 = !DISubroutineType(types: !814)
!814 = !{!145, !798, !815, !816, !98, !817, !859}
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_BROWSER_ACTION", file: !790, line: 26, baseType: !67)
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_QUESTION_ID", file: !802, line: 26, baseType: !212)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IFR_TYPE_VALUE", file: !802, line: 687, baseType: !819)
!819 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "EFI_IFR_TYPE_VALUE", file: !802, line: 676, size: 176, elements: !820)
!820 = !{!821, !822, !823, !824, !825, !826, !833, !840, !842}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "u8", scope: !819, file: !802, line: 677, baseType: !98, size: 8)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "u16", scope: !819, file: !802, line: 678, baseType: !212, size: 16)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "u32", scope: !819, file: !802, line: 679, baseType: !112, size: 32)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "u64", scope: !819, file: !802, line: 680, baseType: !68, size: 64)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !819, file: !802, line: 681, baseType: !62, size: 8)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !819, file: !802, line: 682, baseType: !827, size: 24)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_HII_TIME", file: !802, line: 661, baseType: !828)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_HII_TIME", file: !802, line: 657, size: 24, elements: !829)
!829 = !{!830, !831, !832}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "Hour", scope: !828, file: !802, line: 658, baseType: !98, size: 8)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "Minute", scope: !828, file: !802, line: 659, baseType: !98, size: 8, offset: 8)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "Second", scope: !828, file: !802, line: 660, baseType: !98, size: 8, offset: 16)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !819, file: !802, line: 683, baseType: !834, size: 32)
!834 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_HII_DATE", file: !802, line: 667, baseType: !835)
!835 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_HII_DATE", file: !802, line: 663, size: 32, elements: !836)
!836 = !{!837, !838, !839}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "Year", scope: !835, file: !802, line: 664, baseType: !212, size: 16)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "Month", scope: !835, file: !802, line: 665, baseType: !98, size: 8, offset: 16)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "Day", scope: !835, file: !802, line: 666, baseType: !98, size: 8, offset: 24)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !819, file: !802, line: 684, baseType: !841, size: 16)
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_STRING_ID", file: !802, line: 27, baseType: !212)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !819, file: !802, line: 685, baseType: !843, size: 176)
!843 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_HII_REF", file: !802, line: 674, baseType: !844)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_HII_REF", file: !802, line: 669, size: 176, elements: !845)
!845 = !{!846, !847, !849, !858}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "QuestionId", scope: !844, file: !802, line: 670, baseType: !816, size: 16)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "FormId", scope: !844, file: !802, line: 671, baseType: !848, size: 16, offset: 16)
!848 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FORM_ID", file: !802, line: 28, baseType: !212)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "FormSetGuid", scope: !844, file: !802, line: 672, baseType: !850, size: 128, offset: 32)
!850 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GUID", file: !92, line: 25, baseType: !851)
!851 = !DIDerivedType(tag: DW_TAG_typedef, name: "GUID", file: !66, line: 218, baseType: !852)
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GUID", file: !66, line: 213, size: 128, elements: !853)
!853 = !{!854, !855, !856, !857}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "Data1", scope: !852, file: !66, line: 214, baseType: !112, size: 32)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "Data2", scope: !852, file: !66, line: 215, baseType: !212, size: 16, offset: 32)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "Data3", scope: !852, file: !66, line: 216, baseType: !212, size: 16, offset: 48)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "Data4", scope: !852, file: !66, line: 217, baseType: !550, size: 64, offset: 64)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "DevicePath", scope: !844, file: !802, line: 673, baseType: !841, size: 16, offset: 160)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_BROWSER_ACTION_REQUEST", file: !861, line: 47, baseType: !67)
!861 = !DIFile(filename: "MdePkg/Include/Protocol/FormBrowser2.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "b7f330cf1dae8202fd9efd87534c32b7")
!862 = !DIDerivedType(tag: DW_TAG_member, name: "HiiVendorDevicePath", scope: !784, file: !511, line: 173, baseType: !863, size: 64, offset: 320)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DEVICE_PATH_PROTOCOL", file: !865, line: 58, baseType: !866)
!865 = !DIFile(filename: "MdePkg/Include/Protocol/DevicePath.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "6b6d593d171f69b933a87911e52d4607")
!866 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_DEVICE_PATH_PROTOCOL", file: !865, line: 43, size: 32, elements: !867)
!867 = !{!868, !869, !870}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !866, file: !865, line: 44, baseType: !98, size: 8)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "SubType", scope: !866, file: !865, line: 51, baseType: !98, size: 8, offset: 8)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !866, file: !865, line: 56, baseType: !871, size: 16, offset: 16)
!871 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 16, elements: !872)
!872 = !{!873}
!873 = !DISubrange(count: 2)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "RegisteredHandle", scope: !784, file: !511, line: 174, baseType: !875, size: 64, offset: 384)
!875 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_HII_HANDLE", file: !802, line: 23, baseType: !61)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "Ip6NvData", scope: !512, file: !511, line: 206, baseType: !877, size: 704, offset: 8320)
!877 = !DIDerivedType(tag: DW_TAG_typedef, name: "IP6_CONFIG_NVDATA", file: !511, line: 167, baseType: !878)
!878 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IP6_CONFIG_NVDATA", file: !511, line: 157, size: 704, elements: !879)
!879 = !{!880, !881, !882, !883, !884, !885, !886, !887, !888}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "Policy", scope: !878, file: !511, line: 158, baseType: !554, size: 32)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "DadTransmitCount", scope: !878, file: !511, line: 159, baseType: !556, size: 32, offset: 32)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "InterfaceId", scope: !878, file: !511, line: 160, baseType: !546, size: 64, offset: 64)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "ManualAddress", scope: !878, file: !511, line: 161, baseType: !76, size: 128, offset: 128)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "ManualAddressCount", scope: !878, file: !511, line: 162, baseType: !112, size: 32, offset: 256)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "GatewayAddress", scope: !878, file: !511, line: 163, baseType: !76, size: 128, offset: 320)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "GatewayAddressCount", scope: !878, file: !511, line: 164, baseType: !112, size: 32, offset: 448)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "DnsAddress", scope: !878, file: !511, line: 165, baseType: !76, size: 128, offset: 512)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "DnsAddressCount", scope: !878, file: !511, line: 166, baseType: !112, size: 32, offset: 640)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "MacString", scope: !131, file: !132, line: 238, baseType: !803, size: 64, offset: 33408)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "MaxPacketSize", scope: !131, file: !132, line: 239, baseType: !112, size: 32, offset: 33472)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "OldMaxPacketSize", scope: !131, file: !132, line: 240, baseType: !112, size: 32, offset: 33504)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "Controller", scope: !119, file: !120, line: 111, baseType: !148, size: 64, offset: 512)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !119, file: !120, line: 112, baseType: !148, size: 64, offset: 576)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "ArpQues", scope: !119, file: !120, line: 117, baseType: !76, size: 128, offset: 640)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "SentFrames", scope: !119, file: !120, line: 118, baseType: !76, size: 128, offset: 768)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "DupAddrDetect", scope: !119, file: !120, line: 123, baseType: !112, size: 32, offset: 896)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "DupAddrDetectList", scope: !119, file: !120, line: 124, baseType: !76, size: 128, offset: 960)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "DelayJoinList", scope: !119, file: !120, line: 125, baseType: !76, size: 128, offset: 1088)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "IpInstances", scope: !119, file: !120, line: 132, baseType: !76, size: 128, offset: 1216)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "PromiscRecv", scope: !119, file: !120, line: 133, baseType: !62, size: 8, offset: 1344)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "CallBack", scope: !73, file: !72, line: 141, baseType: !902, size: 64, offset: 1024)
!902 = !DIDerivedType(tag: DW_TAG_typedef, name: "IP6_ARP_CALLBACK", file: !72, line: 55, baseType: !276)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64)
!904 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHAR8", file: !63, line: 200, baseType: !905)
!905 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64)
!907 = !DIDerivedType(tag: DW_TAG_typedef, name: "IP6_PREFIX_LIST_ENTRY", file: !72, line: 159, baseType: !908)
!908 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IP6_PREFIX_LIST_ENTRY", file: !72, line: 152, size: 448, elements: !909)
!909 = !{!910, !911, !912, !913, !914, !915}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "Link", scope: !908, file: !72, line: 153, baseType: !76, size: 128)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "RefCnt", scope: !908, file: !72, line: 154, baseType: !84, size: 64, offset: 128)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "ValidLifetime", scope: !908, file: !72, line: 155, baseType: !112, size: 32, offset: 192)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "PreferredLifetime", scope: !908, file: !72, line: 156, baseType: !112, size: 32, offset: 224)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "PrefixLength", scope: !908, file: !72, line: 157, baseType: !98, size: 8, offset: 256)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "Prefix", scope: !908, file: !72, line: 158, baseType: !91, size: 128, offset: 264)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DIDerivedType(tag: DW_TAG_typedef, name: "IP6_LINK_TX_TOKEN", file: !120, line: 73, baseType: !918)
!918 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IP6_LINK_TX_TOKEN", file: !120, line: 59, size: 1536, elements: !919)
!919 = !{!920, !921, !922, !1091, !1092, !1093, !1094, !1095, !1096, !1097}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", scope: !918, file: !120, line: 60, baseType: !112, size: 32)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "Link", scope: !918, file: !120, line: 61, baseType: !76, size: 128, offset: 64)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "IpInstance", scope: !918, file: !120, line: 63, baseType: !923, size: 64, offset: 192)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!924 = !DIDerivedType(tag: DW_TAG_typedef, name: "IP6_PROTOCOL", file: !118, line: 63, baseType: !925)
!925 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IP6_PROTOCOL", file: !132, line: 130, size: 2880, elements: !926)
!926 = !{!927, !928, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1085, !1086, !1087, !1088, !1089, !1090}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", scope: !925, file: !132, line: 131, baseType: !112, size: 32)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "Ip6Proto", scope: !925, file: !132, line: 133, baseType: !929, size: 576, offset: 64)
!929 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP6_PROTOCOL", file: !47, line: 36, baseType: !930)
!930 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_IP6_PROTOCOL", file: !47, line: 931, size: 576, elements: !931)
!931 = !{!932, !985, !991, !996, !1001, !1006, !1058, !1060, !1062}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "GetModeData", scope: !930, file: !47, line: 932, baseType: !933, size: 64)
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP6_GET_MODE_DATA", file: !47, line: 568, baseType: !934)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!935 = !DISubroutineType(types: !936)
!936 = !{!145, !937, !938, !420, !434}
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64)
