; ModuleID = 'PiSmmCpuDxeSmm.bc'
source_filename = "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main/UefiCpuPkg/PiSmmCpuDxeSmm/PiSmmCpuDxeSmm.c"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-windows-gnu"

%struct.SMM_CPU_PRIVATE_DATA = type { i64, i8*, %struct.EFI_PROCESSOR_INFORMATION*, i32*, i64*, i8**, [1 x %struct._EFI_SMM_RESERVED_SMRAM_REGION], %struct._EFI_SMM_ENTRY_CONTEXT, void (%struct._EFI_SMM_ENTRY_CONTEXT*)*, %struct._EFI_SMM_CONFIGURATION_PROTOCOL, %struct.PROCEDURE_WRAPPER*, %struct._LIST_ENTRY, %struct._LIST_ENTRY* }
%struct.EFI_PROCESSOR_INFORMATION = type { i64, i32, %struct.EFI_CPU_PHYSICAL_LOCATION, %union.EXTENDED_PROCESSOR_INFORMATION }
%struct.EFI_CPU_PHYSICAL_LOCATION = type { i32, i32, i32 }
%union.EXTENDED_PROCESSOR_INFORMATION = type { %struct.EFI_CPU_PHYSICAL_LOCATION2 }
%struct.EFI_CPU_PHYSICAL_LOCATION2 = type { i32, i32, i32, i32, i32, i32 }
%struct._EFI_SMM_RESERVED_SMRAM_REGION = type { i64, i64 }
%struct._EFI_SMM_ENTRY_CONTEXT = type { i64 (void (i8*)*, i64, i8*)*, i64, i64, i64*, i8** }
%struct._EFI_SMM_CONFIGURATION_PROTOCOL = type { %struct._EFI_SMM_RESERVED_SMRAM_REGION*, i64 (%struct._EFI_SMM_CONFIGURATION_PROTOCOL*, void (%struct._EFI_SMM_ENTRY_CONTEXT*)*)* }
%struct.PROCEDURE_WRAPPER = type { void (i8*)*, i8* }
%struct._LIST_ENTRY = type { %struct._LIST_ENTRY*, %struct._LIST_ENTRY* }

!82 = !DIEnumerator(name: "EFI_MM_SAVE_STATE_REGISTER_XMM12", value: 284)
!83 = !DIEnumerator(name: "EFI_MM_SAVE_STATE_REGISTER_XMM13", value: 285)
!84 = !DIEnumerator(name: "EFI_MM_SAVE_STATE_REGISTER_XMM14", value: 286)
!85 = !DIEnumerator(name: "EFI_MM_SAVE_STATE_REGISTER_XMM15", value: 287)
!86 = !DIEnumerator(name: "EFI_MM_SAVE_STATE_REGISTER_IO", value: 512)
!87 = !DIEnumerator(name: "EFI_MM_SAVE_STATE_REGISTER_LMA", value: 513)
!88 = !DIEnumerator(name: "EFI_MM_SAVE_STATE_REGISTER_PROCESSOR_ID", value: 514)
!89 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !90, line: 117, baseType: !7, size: 32, elements: !91)
!90 = !DIFile(filename: "MdePkg/Include/Uefi/UefiMultiPhase.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "321376346bf760b12510b9ae9d8f46f8")
!91 = !{!92, !93, !94, !95}
!92 = !DIEnumerator(name: "EfiResetCold", value: 0)
!93 = !DIEnumerator(name: "EfiResetWarm", value: 1)
!94 = !DIEnumerator(name: "EfiResetShutdown", value: 2)
!95 = !DIEnumerator(name: "EfiResetPlatformSpecific", value: 3)
!96 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !97, line: 29, baseType: !7, size: 32, elements: !98)
!97 = !DIFile(filename: "MdePkg/Include/Uefi/UefiSpec.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "dd07249351b00161d82576c2d3d57d19")
!98 = !{!99, !100, !101, !102}
!99 = !DIEnumerator(name: "AllocateAnyPages", value: 0)
!100 = !DIEnumerator(name: "AllocateMaxAddress", value: 1)
!101 = !DIEnumerator(name: "AllocateAddress", value: 2)
!102 = !DIEnumerator(name: "MaxAllocateType", value: 3)
!103 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !90, line: 38, baseType: !7, size: 32, elements: !104)
!104 = !{!105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121}
!105 = !DIEnumerator(name: "EfiReservedMemoryType", value: 0)
!106 = !DIEnumerator(name: "EfiLoaderCode", value: 1)
!107 = !DIEnumerator(name: "EfiLoaderData", value: 2)
!108 = !DIEnumerator(name: "EfiBootServicesCode", value: 3)
!109 = !DIEnumerator(name: "EfiBootServicesData", value: 4)
!110 = !DIEnumerator(name: "EfiRuntimeServicesCode", value: 5)
!111 = !DIEnumerator(name: "EfiRuntimeServicesData", value: 6)
!112 = !DIEnumerator(name: "EfiConventionalMemory", value: 7)
!113 = !DIEnumerator(name: "EfiUnusableMemory", value: 8)
!114 = !DIEnumerator(name: "EfiACPIReclaimMemory", value: 9)
!115 = !DIEnumerator(name: "EfiACPIMemoryNVS", value: 10)
!116 = !DIEnumerator(name: "EfiMemoryMappedIO", value: 11)
!117 = !DIEnumerator(name: "EfiMemoryMappedIOPortSpace", value: 12)
!118 = !DIEnumerator(name: "EfiPalCode", value: 13)
!119 = !DIEnumerator(name: "EfiPersistentMemory", value: 14)
!120 = !DIEnumerator(name: "EfiUnacceptedMemoryType", value: 15)
!121 = !DIEnumerator(name: "EfiMaxMemoryType", value: 16)
!122 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !97, line: 506, baseType: !7, size: 32, elements: !123)
!123 = !{!124, !125, !126}
!124 = !DIEnumerator(name: "TimerCancel", value: 0)
!125 = !DIEnumerator(name: "TimerPeriodic", value: 1)
!126 = !DIEnumerator(name: "TimerRelative", value: 2)
!127 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !97, line: 1144, baseType: !7, size: 32, elements: !128)
!128 = !{!129}
!129 = !DIEnumerator(name: "EFI_NATIVE_INTERFACE", value: 0)
!130 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !97, line: 1460, baseType: !7, size: 32, elements: !131)
!131 = !{!132, !133, !134}
!132 = !DIEnumerator(name: "AllHandles", value: 0)
!133 = !DIEnumerator(name: "ByRegisterNotify", value: 1)
!134 = !DIEnumerator(name: "ByProtocol", value: 2)
!135 = !{!136, !140, !142, !143, !146, !148, !157, !158, !159, !160, !162, !292, !293, !138, !294, !322, !324, !325, !327, !337}
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINTN", file: !137, line: 211, baseType: !138)
!137 = !DIFile(filename: "MdePkg/Include/X64/ProcessorBind.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "ef2524a221fe61206fa09ec88dd4f59b")
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT64", file: !137, line: 162, baseType: !139)
!139 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "BOOLEAN", file: !137, line: 192, baseType: !141)
!141 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTN", file: !137, line: 216, baseType: !144)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT64", file: !137, line: 166, baseType: !145)
!145 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "RETURN_STATUS", file: !147, line: 1026, baseType: !136)
!147 = !DIFile(filename: "MdePkg/Include/Base.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "0c11ea3d1992443d8a8f590a064e50ff")
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "IA32_DESCRIPTOR", file: !150, line: 5173, baseType: !151)
!150 = !DIFile(filename: "MdePkg/Include/Library/BaseLib.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "32e6c3eada24149729a92978a9875182")
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IA32_DESCRIPTOR", file: !150, line: 5170, size: 80, elements: !152)
!152 = !{!153, !156}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "Limit", scope: !151, file: !150, line: 5171, baseType: !154, size: 16)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT16", file: !137, line: 178, baseType: !155)
!155 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "Base", scope: !151, file: !150, line: 5172, baseType: !136, size: 64, offset: 16)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT32", file: !137, line: 170, baseType: !7)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT8", file: !137, line: 196, baseType: !141)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "SMRAM_SAVE_STATE_MAP", file: !164, line: 142, baseType: !165)
!164 = !DIFile(filename: "MdePkg/Include/Register/Intel/SmramSaveStateMap.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "8b9adcb491439c749870ea864df2c98d")
!165 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "SMRAM_SAVE_STATE_MAP", file: !164, line: 139, size: 8192, elements: !166)
!166 = !{!167, !211}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "x86", scope: !165, file: !164, line: 140, baseType: !168, size: 8192)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "SMRAM_SAVE_STATE_MAP32", file: !164, line: 72, baseType: !169)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SMRAM_SAVE_STATE_MAP32", file: !164, line: 38, size: 8192, elements: !170)
!170 = !{!171, !175, !179, !180, !181, !182, !183, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved", scope: !169, file: !164, line: 39, baseType: !172, size: 4096)
!172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 4096, elements: !173)
!173 = !{!174}
!174 = !DISubrange(count: 512)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !169, file: !164, line: 42, baseType: !176, size: 1984, offset: 4096)
!176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 1984, elements: !177)
!177 = !{!178}
!178 = !DISubrange(count: 248)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "SMBASE", scope: !169, file: !164, line: 43, baseType: !158, size: 32, offset: 6080)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "SMMRevId", scope: !169, file: !164, line: 44, baseType: !158, size: 32, offset: 6112)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "IORestart", scope: !169, file: !164, line: 45, baseType: !154, size: 16, offset: 6144)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "AutoHALTRestart", scope: !169, file: !164, line: 46, baseType: !154, size: 16, offset: 6160)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !169, file: !164, line: 47, baseType: !184, size: 1248, offset: 6176)
!184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 1248, elements: !185)
!185 = !{!186}
!186 = !DISubrange(count: 156)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "IOMemAddr", scope: !169, file: !164, line: 48, baseType: !158, size: 32, offset: 7424)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "IOMisc", scope: !169, file: !164, line: 49, baseType: !158, size: 32, offset: 7456)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_ES", scope: !169, file: !164, line: 50, baseType: !158, size: 32, offset: 7488)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_CS", scope: !169, file: !164, line: 51, baseType: !158, size: 32, offset: 7520)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_SS", scope: !169, file: !164, line: 52, baseType: !158, size: 32, offset: 7552)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_DS", scope: !169, file: !164, line: 53, baseType: !158, size: 32, offset: 7584)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_FS", scope: !169, file: !164, line: 54, baseType: !158, size: 32, offset: 7616)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_GS", scope: !169, file: !164, line: 55, baseType: !158, size: 32, offset: 7648)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !169, file: !164, line: 56, baseType: !158, size: 32, offset: 7680)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_TR", scope: !169, file: !164, line: 57, baseType: !158, size: 32, offset: 7712)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_DR7", scope: !169, file: !164, line: 58, baseType: !158, size: 32, offset: 7744)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_DR6", scope: !169, file: !164, line: 59, baseType: !158, size: 32, offset: 7776)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_EAX", scope: !169, file: !164, line: 60, baseType: !158, size: 32, offset: 7808)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_ECX", scope: !169, file: !164, line: 61, baseType: !158, size: 32, offset: 7840)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_EDX", scope: !169, file: !164, line: 62, baseType: !158, size: 32, offset: 7872)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_EBX", scope: !169, file: !164, line: 63, baseType: !158, size: 32, offset: 7904)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_ESP", scope: !169, file: !164, line: 64, baseType: !158, size: 32, offset: 7936)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_EBP", scope: !169, file: !164, line: 65, baseType: !158, size: 32, offset: 7968)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_ESI", scope: !169, file: !164, line: 66, baseType: !158, size: 32, offset: 8000)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_EDI", scope: !169, file: !164, line: 67, baseType: !158, size: 32, offset: 8032)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_EIP", scope: !169, file: !164, line: 68, baseType: !158, size: 32, offset: 8064)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_EFLAGS", scope: !169, file: !164, line: 69, baseType: !158, size: 32, offset: 8096)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_CR3", scope: !169, file: !164, line: 70, baseType: !158, size: 32, offset: 8128)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_CR0", scope: !169, file: !164, line: 71, baseType: !158, size: 32, offset: 8160)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "x64", scope: !165, file: !164, line: 141, baseType: !212, size: 8192)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "SMRAM_SAVE_STATE_MAP64", file: !164, line: 134, baseType: !213)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SMRAM_SAVE_STATE_MAP64", file: !164, line: 77, size: 8192, elements: !214)
!214 = !{!215, !219, !220, !221, !222, !226, !227, !231, !232, !236, !237, !238, !239, !240, !241, !245, !246, !247, !251, !252, !253, !254, !255, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !213, file: !164, line: 78, baseType: !216, size: 3712)
!216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 3712, elements: !217)
!217 = !{!218}
!218 = !DISubrange(count: 464)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "GdtBaseHiDword", scope: !213, file: !164, line: 79, baseType: !158, size: 32, offset: 3712)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "LdtBaseHiDword", scope: !213, file: !164, line: 80, baseType: !158, size: 32, offset: 3744)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "IdtBaseHiDword", scope: !213, file: !164, line: 81, baseType: !158, size: 32, offset: 3776)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !213, file: !164, line: 82, baseType: !223, size: 96, offset: 3808)
!223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 96, elements: !224)
!224 = !{!225}
!225 = !DISubrange(count: 12)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "IO_EIP", scope: !213, file: !164, line: 83, baseType: !138, size: 64, offset: 3904)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !213, file: !164, line: 84, baseType: !228, size: 640, offset: 3968)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 640, elements: !229)
!229 = !{!230}
!230 = !DISubrange(count: 80)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "_CR4", scope: !213, file: !164, line: 85, baseType: !158, size: 32, offset: 4608)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !213, file: !164, line: 86, baseType: !233, size: 576, offset: 4640)
!233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 576, elements: !234)
!234 = !{!235}
!235 = !DISubrange(count: 72)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "GdtBaseLoDword", scope: !213, file: !164, line: 87, baseType: !158, size: 32, offset: 5216)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !213, file: !164, line: 88, baseType: !158, size: 32, offset: 5248)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "IdtBaseLoDword", scope: !213, file: !164, line: 89, baseType: !158, size: 32, offset: 5280)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved6", scope: !213, file: !164, line: 90, baseType: !158, size: 32, offset: 5312)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "LdtBaseLoDword", scope: !213, file: !164, line: 91, baseType: !158, size: 32, offset: 5344)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved7", scope: !213, file: !164, line: 92, baseType: !242, size: 448, offset: 5376)
!242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 448, elements: !243)
!243 = !{!244}
!244 = !DISubrange(count: 56)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "EptVmxControl", scope: !213, file: !164, line: 93, baseType: !138, size: 64, offset: 5824)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "EnEptVmxControl", scope: !213, file: !164, line: 94, baseType: !158, size: 32, offset: 5888)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved8", scope: !213, file: !164, line: 95, baseType: !248, size: 160, offset: 5920)
!248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 160, elements: !249)
!249 = !{!250}
!250 = !DISubrange(count: 20)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "SMBASE", scope: !213, file: !164, line: 96, baseType: !158, size: 32, offset: 6080)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "SMMRevId", scope: !213, file: !164, line: 97, baseType: !158, size: 32, offset: 6112)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "IORestart", scope: !213, file: !164, line: 98, baseType: !154, size: 16, offset: 6144)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "AutoHALTRestart", scope: !213, file: !164, line: 99, baseType: !154, size: 16, offset: 6160)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved9", scope: !213, file: !164, line: 100, baseType: !256, size: 192, offset: 6176)
!256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 192, elements: !257)
!257 = !{!258}
!258 = !DISubrange(count: 24)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_R15", scope: !213, file: !164, line: 101, baseType: !138, size: 64, offset: 6368)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_R14", scope: !213, file: !164, line: 102, baseType: !138, size: 64, offset: 6432)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_R13", scope: !213, file: !164, line: 103, baseType: !138, size: 64, offset: 6496)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_R12", scope: !213, file: !164, line: 104, baseType: !138, size: 64, offset: 6560)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_R11", scope: !213, file: !164, line: 105, baseType: !138, size: 64, offset: 6624)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_R10", scope: !213, file: !164, line: 106, baseType: !138, size: 64, offset: 6688)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_R9", scope: !213, file: !164, line: 107, baseType: !138, size: 64, offset: 6752)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_R8", scope: !213, file: !164, line: 108, baseType: !138, size: 64, offset: 6816)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_RAX", scope: !213, file: !164, line: 109, baseType: !138, size: 64, offset: 6880)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_RCX", scope: !213, file: !164, line: 110, baseType: !138, size: 64, offset: 6944)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_RDX", scope: !213, file: !164, line: 111, baseType: !138, size: 64, offset: 7008)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_RBX", scope: !213, file: !164, line: 112, baseType: !138, size: 64, offset: 7072)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_RSP", scope: !213, file: !164, line: 113, baseType: !138, size: 64, offset: 7136)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_RBP", scope: !213, file: !164, line: 114, baseType: !138, size: 64, offset: 7200)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_RSI", scope: !213, file: !164, line: 115, baseType: !138, size: 64, offset: 7264)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_RDI", scope: !213, file: !164, line: 116, baseType: !138, size: 64, offset: 7328)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "IOMemAddr", scope: !213, file: !164, line: 117, baseType: !138, size: 64, offset: 7392)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "IOMisc", scope: !213, file: !164, line: 118, baseType: !158, size: 32, offset: 7456)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_ES", scope: !213, file: !164, line: 119, baseType: !158, size: 32, offset: 7488)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_CS", scope: !213, file: !164, line: 120, baseType: !158, size: 32, offset: 7520)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_SS", scope: !213, file: !164, line: 121, baseType: !158, size: 32, offset: 7552)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_DS", scope: !213, file: !164, line: 122, baseType: !158, size: 32, offset: 7584)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_FS", scope: !213, file: !164, line: 123, baseType: !158, size: 32, offset: 7616)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_GS", scope: !213, file: !164, line: 124, baseType: !158, size: 32, offset: 7648)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_LDTR", scope: !213, file: !164, line: 125, baseType: !158, size: 32, offset: 7680)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_TR", scope: !213, file: !164, line: 126, baseType: !158, size: 32, offset: 7712)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_DR7", scope: !213, file: !164, line: 127, baseType: !138, size: 64, offset: 7744)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_DR6", scope: !213, file: !164, line: 128, baseType: !138, size: 64, offset: 7808)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_RIP", scope: !213, file: !164, line: 129, baseType: !138, size: 64, offset: 7872)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "IA32_EFER", scope: !213, file: !164, line: 130, baseType: !138, size: 64, offset: 7936)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_RFLAGS", scope: !213, file: !164, line: 131, baseType: !138, size: 64, offset: 8000)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_CR3", scope: !213, file: !164, line: 132, baseType: !138, size: 64, offset: 8064)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_CR0", scope: !213, file: !164, line: 133, baseType: !138, size: 64, offset: 8128)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_PROCESSOR_INFORMATION", file: !296, line: 183, baseType: !297)
!296 = !DIFile(filename: "MdePkg/Include/Protocol/MpService.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "d2ab05100ab150e9edf2c423a5bfc369")
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_PROCESSOR_INFORMATION", file: !296, line: 146, size: 384, elements: !298)
!298 = !{!299, !300, !301, !308}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "ProcessorId", scope: !297, file: !296, line: 153, baseType: !138, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "StatusFlag", scope: !297, file: !296, line: 172, baseType: !158, size: 32, offset: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "Location", scope: !297, file: !296, line: 178, baseType: !302, size: 96, offset: 96)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CPU_PHYSICAL_LOCATION", file: !296, line: 102, baseType: !303)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_CPU_PHYSICAL_LOCATION", file: !296, line: 89, size: 96, elements: !304)
!304 = !{!305, !306, !307}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "Package", scope: !303, file: !296, line: 93, baseType: !158, size: 32)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "Core", scope: !303, file: !296, line: 97, baseType: !158, size: 32, offset: 32)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "Thread", scope: !303, file: !296, line: 101, baseType: !158, size: 32, offset: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "ExtendedInformation", scope: !297, file: !296, line: 182, baseType: !309, size: 192, offset: 192)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "EXTENDED_PROCESSOR_INFORMATION", file: !296, line: 141, baseType: !310)
!310 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "EXTENDED_PROCESSOR_INFORMATION", file: !296, line: 134, size: 192, elements: !311)
!311 = !{!312}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "Location2", scope: !310, file: !296, line: 140, baseType: !313, size: 192)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CPU_PHYSICAL_LOCATION2", file: !296, line: 132, baseType: !314)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_CPU_PHYSICAL_LOCATION2", file: !296, line: 107, size: 192, elements: !315)
!315 = !{!316, !317, !318, !319, !320, !321}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "Package", scope: !314, file: !296, line: 111, baseType: !158, size: 32)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "Module", scope: !314, file: !296, line: 115, baseType: !158, size: 32, offset: 32)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "Tile", scope: !314, file: !296, line: 119, baseType: !158, size: 32, offset: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "Die", scope: !314, file: !296, line: 123, baseType: !158, size: 32, offset: 96)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "Core", scope: !314, file: !296, line: 127, baseType: !158, size: 32, offset: 128)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "Thread", scope: !314, file: !296, line: 131, baseType: !158, size: 32, offset: 160)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "SMM_CPU_OPERATION", file: !6, line: 17, baseType: !5)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_PHYSICAL_ADDRESS", file: !326, line: 50, baseType: !138)
!326 = !DIFile(filename: "MdePkg/Include/Uefi/UefiBaseType.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "dbec48e65949dff122bc920c9d9d9c6a")
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SMRAM_DESCRIPTOR", file: !329, line: 134, baseType: !330)
!329 = !DIFile(filename: "MdePkg/Include/Pi/PiMultiPhase.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "f007ff34f79c38f5620bc144199a0556")
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MMRAM_DESCRIPTOR", file: !329, line: 132, baseType: !331)
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_MMRAM_DESCRIPTOR", file: !329, line: 109, size: 256, elements: !332)
!332 = !{!333, !334, !335, !336}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "PhysicalStart", scope: !331, file: !329, line: 115, baseType: !325, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "CpuStart", scope: !331, file: !329, line: 120, baseType: !325, size: 64, offset: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "PhysicalSize", scope: !331, file: !329, line: 124, baseType: !138, size: 64, offset: 128)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "RegionState", scope: !331, file: !329, line: 131, baseType: !138, size: 64, offset: 192)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "BASE_SORT_COMPARE", file: !150, line: 2914, baseType: !338)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DISubroutineType(types: !340)
!340 = !{!143, !341, !341}
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!343 = !{!0, !344, !358, !438, !440, !460, !479, !481, !485, !487, !489, !491, !493, !495, !497, !499, !505, !508, !511, !513, !515, !518, !520, !522, !524, !1044, !1046, !1048, !1050, !1052, !1054, !1056, !1058, !1060}
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(name: "mCpuHotPlugData", scope: !2, file: !346, line: 44, type: !347, isLocal: false, isDefinition: true)
!346 = !DIFile(filename: "UefiCpuPkg/PiSmmCpuDxeSmm/PiSmmCpuDxeSmm.c", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "3244833ab0c5708258de09fb7eb66b50")
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "CPU_HOT_PLUG_DATA", file: !348, line: 25, baseType: !349)
!348 = !DIFile(filename: "UefiCpuPkg/Include/CpuHotPlugData.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "59f549241a71b232e98e7747459031a8")
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CPU_HOT_PLUG_DATA", file: !348, line: 14, size: 320, elements: !350)
!350 = !{!351, !352, !353, !354, !355, !356, !357}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "Revision", scope: !349, file: !348, line: 15, baseType: !158, size: 32)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "ArrayLength", scope: !349, file: !348, line: 16, baseType: !158, size: 32, offset: 32)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "ApicId", scope: !349, file: !348, line: 20, baseType: !157, size: 64, offset: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "SmBase", scope: !349, file: !348, line: 21, baseType: !324, size: 64, offset: 128)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved", scope: !349, file: !348, line: 22, baseType: !158, size: 32, offset: 192)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "SmrrBase", scope: !349, file: !348, line: 23, baseType: !158, size: 32, offset: 224)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "SmrrSize", scope: !349, file: !348, line: 24, baseType: !158, size: 32, offset: 256)
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(name: "gSmmCpuPrivate", scope: !2, file: !346, line: 57, type: !360, isLocal: false, isDefinition: true)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "SMM_CPU_PRIVATE_DATA", file: !362, line: 259, baseType: !363)
!362 = !DIFile(filename: "UefiCpuPkg/PiSmmCpuDxeSmm/PiSmmCpuDxeSmm.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "7aaf116ee7e69b05ef04613c7458dc52")
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SMM_CPU_PRIVATE_DATA", file: !362, line: 240, size: 1280, elements: !364)
!364 = !{!365, !366, !368, !369, !370, !371, !372, !382, !403, !410, !423, !430, !437}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", scope: !363, file: !362, line: 241, baseType: !136, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "SmmCpuHandle", scope: !363, file: !362, line: 243, baseType: !367, size: 64, offset: 64)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_HANDLE", file: !326, line: 33, baseType: !142)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "ProcessorInfo", scope: !363, file: !362, line: 245, baseType: !294, size: 64, offset: 128)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "Operation", scope: !363, file: !362, line: 246, baseType: !322, size: 64, offset: 192)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "CpuSaveStateSize", scope: !363, file: !362, line: 247, baseType: !324, size: 64, offset: 256)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "CpuSaveState", scope: !363, file: !362, line: 248, baseType: !292, size: 64, offset: 320)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "SmmReservedSmramRegion", scope: !363, file: !362, line: 250, baseType: !373, size: 128, offset: 384)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !374, size: 128, elements: !380)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SMM_RESERVED_SMRAM_REGION", file: !375, line: 36, baseType: !376)
!375 = !DIFile(filename: "MdePkg/Include/Protocol/SmmConfiguration.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "186ab6c20b7ccddfeb40016180c021bf")
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_SMM_RESERVED_SMRAM_REGION", file: !375, line: 25, size: 128, elements: !377)
!377 = !{!378, !379}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "SmramReservedStart", scope: !376, file: !375, line: 30, baseType: !325, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "SmramReservedSize", scope: !376, file: !375, line: 35, baseType: !138, size: 64, offset: 64)
!380 = !{!381}
!381 = !DISubrange(count: 1)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "SmmCoreEntryContext", scope: !363, file: !362, line: 251, baseType: !383, size: 320, offset: 512)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SMM_ENTRY_CONTEXT", file: !384, line: 87, baseType: !385)
!384 = !DIFile(filename: "MdePkg/Include/Pi/PiSmmCis.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "26f8805d33aa377abd8e63bed8e50f01")
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_SMM_ENTRY_CONTEXT", file: !384, line: 63, size: 320, elements: !386)
!386 = !{!387, !399, !400, !401, !402}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "SmmStartupThisAp", scope: !385, file: !384, line: 64, baseType: !388, size: 64)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SMM_STARTUP_THIS_AP", file: !384, line: 52, baseType: !389)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MM_STARTUP_THIS_AP", file: !390, line: 74, baseType: !391)
!390 = !DIFile(filename: "MdePkg/Include/Pi/PiMmCis.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "82364cafffe22fadeeaa767af7242f69")
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DISubroutineType(types: !393)
!393 = !{!394, !395, !136, !142}
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_STATUS", file: !326, line: 29, baseType: !146)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_AP_PROCEDURE", file: !329, line: 191, baseType: !396)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DISubroutineType(types: !398)
!398 = !{null, !142}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "CurrentlyExecutingCpu", scope: !385, file: !384, line: 69, baseType: !136, size: 64, offset: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "NumberOfCpus", scope: !385, file: !384, line: 74, baseType: !136, size: 64, offset: 128)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "CpuSaveStateSize", scope: !385, file: !384, line: 80, baseType: !324, size: 64, offset: 192)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "CpuSaveState", scope: !385, file: !384, line: 86, baseType: !292, size: 64, offset: 256)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "SmmCoreEntry", scope: !363, file: !362, line: 252, baseType: !404, size: 64, offset: 832)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SMM_ENTRY_POINT", file: !384, line: 96, baseType: !405)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DISubroutineType(types: !407)
!407 = !{null, !408}
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !383)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "SmmConfiguration", scope: !363, file: !362, line: 254, baseType: !411, size: 128, offset: 896)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SMM_CONFIGURATION_PROTOCOL", file: !375, line: 38, baseType: !412)
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_SMM_CONFIGURATION_PROTOCOL", file: !375, line: 67, size: 128, elements: !413)
!413 = !{!414, !416}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "SmramReservedRegions", scope: !412, file: !375, line: 71, baseType: !415, size: 64)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "RegisterSmmEntry", scope: !412, file: !375, line: 72, baseType: !417, size: 64, offset: 64)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SMM_REGISTER_SMM_ENTRY", file: !375, line: 54, baseType: !418)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DISubroutineType(types: !420)
!420 = !{!394, !421, !404}
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !411)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "ApWrapperFunc", scope: !363, file: !362, line: 256, baseType: !424, size: 64, offset: 1024)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "PROCEDURE_WRAPPER", file: !362, line: 208, baseType: !426)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PROCEDURE_WRAPPER", file: !362, line: 205, size: 128, elements: !427)
!427 = !{!428, !429}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "Procedure", scope: !426, file: !362, line: 206, baseType: !395, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "ProcedureArgument", scope: !426, file: !362, line: 207, baseType: !142, size: 64, offset: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "TokenList", scope: !363, file: !362, line: 257, baseType: !431, size: 128, offset: 1088)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "LIST_ENTRY", file: !147, line: 242, baseType: !432)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_LIST_ENTRY", file: !147, line: 247, size: 128, elements: !433)
!433 = !{!434, !436}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "ForwardLink", scope: !432, file: !147, line: 248, baseType: !435, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "BackLink", scope: !432, file: !147, line: 249, baseType: !435, size: 64, offset: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "FirstFreeToken", scope: !363, file: !362, line: 258, baseType: !435, size: 64, offset: 1216)
!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(name: "mSmmCpuHandle", scope: !2, file: !346, line: 67, type: !367, isLocal: false, isDefinition: true)
!440 = !DIGlobalVariableExpression(var: !441, expr: !DIExpression())
!441 = distinct !DIGlobalVariable(name: "mSmmCpu", scope: !2, file: !346, line: 72, type: !442, isLocal: false, isDefinition: true)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SMM_CPU_PROTOCOL", file: !443, line: 120, baseType: !444)
!443 = !DIFile(filename: "MdePkg/Include/Protocol/SmmCpu.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "03846e6aa88d529e65d068e928429a89")
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MM_CPU_PROTOCOL", file: !14, line: 164, baseType: !445)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_MM_CPU_PROTOCOL", file: !14, line: 232, size: 128, elements: !446)
!446 = !{!447, !455}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "ReadSaveState", scope: !445, file: !14, line: 233, baseType: !448, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MM_READ_SAVE_STATE", file: !14, line: 187, baseType: !449)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DISubroutineType(types: !451)
!451 = !{!394, !452, !136, !454, !136, !142}
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !444)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MM_SAVE_STATE_REGISTER", file: !14, line: 105, baseType: !13)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "WriteSaveState", scope: !445, file: !14, line: 234, baseType: !456, size: 64, offset: 64)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MM_WRITE_SAVE_STATE", file: !14, line: 216, baseType: !457)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DISubroutineType(types: !459)
!459 = !{!394, !452, !136, !454, !136, !341}
!460 = !DIGlobalVariableExpression(var: !461, expr: !DIExpression())
!461 = distinct !DIGlobalVariable(name: "mSmmMemoryAttribute", scope: !2, file: !346, line: 80, type: !462, isLocal: false, isDefinition: true)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "EDKII_SMM_MEMORY_ATTRIBUTE_PROTOCOL", file: !463, line: 19, baseType: !464)
!463 = !DIFile(filename: "MdeModulePkg/Include/Protocol/SmmMemoryAttribute.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "0c6d1fe511b821ab9390589b9c438a26")
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EDKII_SMM_MEMORY_ATTRIBUTE_PROTOCOL", file: !463, line: 119, size: 192, elements: !465)
!465 = !{!466, !472, !477}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "GetMemoryAttributes", scope: !464, file: !463, line: 120, baseType: !467, size: 64)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "EDKII_SMM_GET_MEMORY_ATTRIBUTES", file: !463, line: 108, baseType: !468)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DISubroutineType(types: !470)
!470 = !{!394, !471, !325, !138, !157}
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "SetMemoryAttributes", scope: !464, file: !463, line: 121, baseType: !473, size: 64, offset: 64)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "EDKII_SMM_SET_MEMORY_ATTRIBUTES", file: !463, line: 46, baseType: !474)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DISubroutineType(types: !476)
!476 = !{!394, !471, !325, !138, !138}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "ClearMemoryAttributes", scope: !464, file: !463, line: 122, baseType: !478, size: 64, offset: 128)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "EDKII_SMM_CLEAR_MEMORY_ATTRIBUTES", file: !463, line: 78, baseType: !474)
!479 = !DIGlobalVariableExpression(var: !480, expr: !DIExpression())
!480 = distinct !DIGlobalVariable(name: "mSmmRelocated", scope: !2, file: !346, line: 88, type: !140, isLocal: false, isDefinition: true)
!481 = !DIGlobalVariableExpression(var: !482, expr: !DIExpression())
!482 = distinct !DIGlobalVariable(name: "mSmmInitialized", scope: !2, file: !346, line: 89, type: !483, isLocal: false, isDefinition: true)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !140)
!485 = !DIGlobalVariableExpression(var: !486, expr: !DIExpression())
!486 = distinct !DIGlobalVariable(name: "mBspApicId", scope: !2, file: !346, line: 90, type: !158, isLocal: false, isDefinition: true)
!487 = !DIGlobalVariableExpression(var: !488, expr: !DIExpression())
!488 = distinct !DIGlobalVariable(name: "mCetSupported", scope: !2, file: !346, line: 100, type: !140, isLocal: false, isDefinition: true)
!489 = !DIGlobalVariableExpression(var: !490, expr: !DIExpression())
!490 = distinct !DIGlobalVariable(name: "mMaxNumberOfCpus", scope: !2, file: !346, line: 102, type: !136, isLocal: false, isDefinition: true)
!491 = !DIGlobalVariableExpression(var: !492, expr: !DIExpression())
!492 = distinct !DIGlobalVariable(name: "mNumberOfCpus", scope: !2, file: !346, line: 103, type: !136, isLocal: false, isDefinition: true)
!493 = !DIGlobalVariableExpression(var: !494, expr: !DIExpression())
!494 = distinct !DIGlobalVariable(name: "mSmmReadyToLock", scope: !2, file: !346, line: 108, type: !140, isLocal: false, isDefinition: true)
!495 = !DIGlobalVariableExpression(var: !496, expr: !DIExpression())
!496 = distinct !DIGlobalVariable(name: "mSmmCodeAccessCheckEnable", scope: !2, file: !346, line: 113, type: !140, isLocal: false, isDefinition: true)
!497 = !DIGlobalVariableExpression(var: !498, expr: !DIExpression())
!498 = distinct !DIGlobalVariable(name: "mAddressEncMask", scope: !2, file: !346, line: 118, type: !138, isLocal: false, isDefinition: true)
!499 = !DIGlobalVariableExpression(var: !500, expr: !DIExpression())
!500 = distinct !DIGlobalVariable(name: "mConfigSmmCodeAccessCheckLock", scope: !2, file: !346, line: 123, type: !501, isLocal: false, isDefinition: true)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "SPIN_LOCK", file: !503, line: 15, baseType: !504)
!503 = !DIFile(filename: "MdePkg/Include/Library/SynchronizationLib.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "a932a5fe14cca85fd65df8c571bfd064")
!504 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !136)
!505 = !DIGlobalVariableExpression(var: !506, expr: !DIExpression(DW_OP_constu, 514, DW_OP_stack_value))
!506 = distinct !DIGlobalVariable(name: "EFI_MM_SAVE_STATE_REGISTER_PROCESSOR_ID", scope: !2, file: !14, line: 104, type: !507, isLocal: true, isDefinition: true)
!507 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!508 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression(DW_OP_constu, 0, DW_OP_stack_value))
!509 = distinct !DIGlobalVariable(name: "SmmMpProcedureIdSmmInitHandler", scope: !2, file: !510, line: 29, type: !507, isLocal: true, isDefinition: true)
!510 = !DIFile(filename: "UefiCpuPkg/PiSmmCpuDxeSmm/SmmMpPerf.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "921dd23d3cd38714f47c8d49c3690963")
!511 = !DIGlobalVariableExpression(var: !512, expr: !DIExpression(DW_OP_constu, 0, DW_OP_stack_value))
!512 = distinct !DIGlobalVariable(name: "SmmCpuNone", scope: !2, file: !6, line: 13, type: !507, isLocal: true, isDefinition: true)
!513 = !DIGlobalVariableExpression(var: !514, expr: !DIExpression(DW_OP_constu, 0, DW_OP_stack_value))
!514 = distinct !DIGlobalVariable(name: "EFI_NATIVE_INTERFACE", scope: !2, file: !97, line: 1148, type: !507, isLocal: true, isDefinition: true)
!515 = !DIGlobalVariableExpression(var: !516, expr: !DIExpression(DW_OP_constu, 0, DW_OP_stack_value))
!516 = distinct !DIGlobalVariable(name: "SmmRegFeatureControl", scope: !2, file: !517, line: 27, type: !507, isLocal: true, isDefinition: true)
!517 = !DIFile(filename: "UefiCpuPkg/Include/Library/SmmCpuFeaturesLib.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "ec734536da86a1cb36c66ea6dd843e23")
!518 = !DIGlobalVariableExpression(var: !519, expr: !DIExpression(DW_OP_constu, 0, DW_OP_stack_value))
!519 = distinct !DIGlobalVariable(name: "AllocateAnyPages", scope: !2, file: !97, line: 33, type: !507, isLocal: true, isDefinition: true)
!520 = !DIGlobalVariableExpression(var: !521, expr: !DIExpression(DW_OP_constu, 5, DW_OP_stack_value))
!521 = distinct !DIGlobalVariable(name: "EfiRuntimeServicesCode", scope: !2, file: !90, line: 65, type: !507, isLocal: true, isDefinition: true)
!522 = !DIGlobalVariableExpression(var: !523, expr: !DIExpression())
!523 = distinct !DIGlobalVariable(name: "mRebased", scope: !2, file: !346, line: 62, type: !483, isLocal: false, isDefinition: true)
!524 = !DIGlobalVariableExpression(var: !525, expr: !DIExpression())
!525 = distinct !DIGlobalVariable(name: "mExternalVectorTable", scope: !2, file: !346, line: 86, type: !526, isLocal: false, isDefinition: true)
!526 = !DICompositeType(tag: DW_TAG_array_type, baseType: !527, size: 2048, elements: !1042)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CPU_INTERRUPT_HANDLER", file: !528, line: 52, baseType: !529)
!528 = !DIFile(filename: "MdePkg/Include/Protocol/Cpu.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "7b7a3f5666fc8baf64b77895779039e1")
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DISubroutineType(types: !531)
!531 = !{null, !532, !535}
!532 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !533)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_EXCEPTION_TYPE", file: !534, line: 35, baseType: !143)
!534 = !DIFile(filename: "MdePkg/Include/Protocol/DebugSupport.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "b28d80535dfaadefd5691a8e3f795059")
!535 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !536)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SYSTEM_CONTEXT", file: !534, line: 787, baseType: !537)
!537 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "EFI_SYSTEM_CONTEXT", file: !534, line: 778, size: 64, elements: !538)
!538 = !{!539, !555, !646, !732, !856, !882, !956, !996}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "SystemContextEbc", scope: !537, file: !534, line: 779, baseType: !540, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SYSTEM_CONTEXT_EBC", file: !534, line: 468, baseType: !542)
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_SYSTEM_CONTEXT_EBC", file: !534, line: 456, size: 704, elements: !543)
!543 = !{!544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "R0", scope: !542, file: !534, line: 457, baseType: !138, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "R1", scope: !542, file: !534, line: 458, baseType: !138, size: 64, offset: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "R2", scope: !542, file: !534, line: 459, baseType: !138, size: 64, offset: 128)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "R3", scope: !542, file: !534, line: 460, baseType: !138, size: 64, offset: 192)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "R4", scope: !542, file: !534, line: 461, baseType: !138, size: 64, offset: 256)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "R5", scope: !542, file: !534, line: 462, baseType: !138, size: 64, offset: 320)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "R6", scope: !542, file: !534, line: 463, baseType: !138, size: 64, offset: 384)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "R7", scope: !542, file: !534, line: 464, baseType: !138, size: 64, offset: 448)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !542, file: !534, line: 465, baseType: !138, size: 64, offset: 512)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "ControlFlags", scope: !542, file: !534, line: 466, baseType: !138, size: 64, offset: 576)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "Ip", scope: !542, file: !534, line: 467, baseType: !138, size: 64, offset: 640)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "SystemContextIa32", scope: !537, file: !534, line: 780, baseType: !556, size: 64)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SYSTEM_CONTEXT_IA32", file: !534, line: 129, baseType: !558)
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_SYSTEM_CONTEXT_IA32", file: !534, line: 95, size: 5184, elements: !559)
!559 = !{!560, !561, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "ExceptionData", scope: !558, file: !534, line: 96, baseType: !158, size: 32)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "FxSaveState", scope: !558, file: !534, line: 97, baseType: !562, size: 4096, offset: 32)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FX_SAVE_STATE_IA32", file: !534, line: 90, baseType: !563)
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_FX_SAVE_STATE_IA32", file: !534, line: 62, size: 4096, elements: !564)
!564 = !{!565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !578, !579, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !601, !602, !603, !604, !605, !606, !607, !608}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "Fcw", scope: !563, file: !534, line: 63, baseType: !154, size: 16)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "Fsw", scope: !563, file: !534, line: 64, baseType: !154, size: 16, offset: 16)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "Ftw", scope: !563, file: !534, line: 65, baseType: !154, size: 16, offset: 32)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "Opcode", scope: !563, file: !534, line: 66, baseType: !154, size: 16, offset: 48)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "Eip", scope: !563, file: !534, line: 67, baseType: !158, size: 32, offset: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "Cs", scope: !563, file: !534, line: 68, baseType: !154, size: 16, offset: 96)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !563, file: !534, line: 69, baseType: !154, size: 16, offset: 112)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "DataOffset", scope: !563, file: !534, line: 70, baseType: !158, size: 32, offset: 128)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "Ds", scope: !563, file: !534, line: 71, baseType: !154, size: 16, offset: 160)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !563, file: !534, line: 72, baseType: !575, size: 80, offset: 176)
!575 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 80, elements: !576)
!576 = !{!577}
!577 = !DISubrange(count: 10)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "St0Mm0", scope: !563, file: !534, line: 73, baseType: !575, size: 80, offset: 256)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !563, file: !534, line: 73, baseType: !580, size: 48, offset: 336)
!580 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 48, elements: !581)
!581 = !{!582}
!582 = !DISubrange(count: 6)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "St1Mm1", scope: !563, file: !534, line: 74, baseType: !575, size: 80, offset: 384)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !563, file: !534, line: 74, baseType: !580, size: 48, offset: 464)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "St2Mm2", scope: !563, file: !534, line: 75, baseType: !575, size: 80, offset: 512)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !563, file: !534, line: 75, baseType: !580, size: 48, offset: 592)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "St3Mm3", scope: !563, file: !534, line: 76, baseType: !575, size: 80, offset: 640)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved6", scope: !563, file: !534, line: 76, baseType: !580, size: 48, offset: 720)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "St4Mm4", scope: !563, file: !534, line: 77, baseType: !575, size: 80, offset: 768)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved7", scope: !563, file: !534, line: 77, baseType: !580, size: 48, offset: 848)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "St5Mm5", scope: !563, file: !534, line: 78, baseType: !575, size: 80, offset: 896)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved8", scope: !563, file: !534, line: 78, baseType: !580, size: 48, offset: 976)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "St6Mm6", scope: !563, file: !534, line: 79, baseType: !575, size: 80, offset: 1024)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved9", scope: !563, file: !534, line: 79, baseType: !580, size: 48, offset: 1104)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "St7Mm7", scope: !563, file: !534, line: 80, baseType: !575, size: 80, offset: 1152)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved10", scope: !563, file: !534, line: 80, baseType: !580, size: 48, offset: 1232)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "Xmm0", scope: !563, file: !534, line: 81, baseType: !598, size: 128, offset: 1280)
!598 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 128, elements: !599)
!599 = !{!600}
!600 = !DISubrange(count: 16)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "Xmm1", scope: !563, file: !534, line: 82, baseType: !598, size: 128, offset: 1408)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "Xmm2", scope: !563, file: !534, line: 83, baseType: !598, size: 128, offset: 1536)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "Xmm3", scope: !563, file: !534, line: 84, baseType: !598, size: 128, offset: 1664)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "Xmm4", scope: !563, file: !534, line: 85, baseType: !598, size: 128, offset: 1792)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "Xmm5", scope: !563, file: !534, line: 86, baseType: !598, size: 128, offset: 1920)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "Xmm6", scope: !563, file: !534, line: 87, baseType: !598, size: 128, offset: 2048)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "Xmm7", scope: !563, file: !534, line: 88, baseType: !598, size: 128, offset: 2176)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved11", scope: !563, file: !534, line: 89, baseType: !609, size: 1792, offset: 2304)
!609 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 1792, elements: !610)
!610 = !{!611}
!611 = !DISubrange(count: 224)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "Dr0", scope: !558, file: !534, line: 98, baseType: !158, size: 32, offset: 4128)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "Dr1", scope: !558, file: !534, line: 99, baseType: !158, size: 32, offset: 4160)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "Dr2", scope: !558, file: !534, line: 100, baseType: !158, size: 32, offset: 4192)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "Dr3", scope: !558, file: !534, line: 101, baseType: !158, size: 32, offset: 4224)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "Dr6", scope: !558, file: !534, line: 102, baseType: !158, size: 32, offset: 4256)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "Dr7", scope: !558, file: !534, line: 103, baseType: !158, size: 32, offset: 4288)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "Cr0", scope: !558, file: !534, line: 104, baseType: !158, size: 32, offset: 4320)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "Cr1", scope: !558, file: !534, line: 105, baseType: !158, size: 32, offset: 4352)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "Cr2", scope: !558, file: !534, line: 106, baseType: !158, size: 32, offset: 4384)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "Cr3", scope: !558, file: !534, line: 107, baseType: !158, size: 32, offset: 4416)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "Cr4", scope: !558, file: !534, line: 108, baseType: !158, size: 32, offset: 4448)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "Eflags", scope: !558, file: !534, line: 109, baseType: !158, size: 32, offset: 4480)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "Ldtr", scope: !558, file: !534, line: 110, baseType: !158, size: 32, offset: 4512)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "Tr", scope: !558, file: !534, line: 111, baseType: !158, size: 32, offset: 4544)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "Gdtr", scope: !558, file: !534, line: 112, baseType: !627, size: 64, offset: 4576)
!627 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 64, elements: !628)
!628 = !{!629}
!629 = !DISubrange(count: 2)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "Idtr", scope: !558, file: !534, line: 113, baseType: !627, size: 64, offset: 4640)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "Eip", scope: !558, file: !534, line: 114, baseType: !158, size: 32, offset: 4704)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "Gs", scope: !558, file: !534, line: 115, baseType: !158, size: 32, offset: 4736)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "Fs", scope: !558, file: !534, line: 116, baseType: !158, size: 32, offset: 4768)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "Es", scope: !558, file: !534, line: 117, baseType: !158, size: 32, offset: 4800)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "Ds", scope: !558, file: !534, line: 118, baseType: !158, size: 32, offset: 4832)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "Cs", scope: !558, file: !534, line: 119, baseType: !158, size: 32, offset: 4864)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "Ss", scope: !558, file: !534, line: 120, baseType: !158, size: 32, offset: 4896)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "Edi", scope: !558, file: !534, line: 121, baseType: !158, size: 32, offset: 4928)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "Esi", scope: !558, file: !534, line: 122, baseType: !158, size: 32, offset: 4960)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "Ebp", scope: !558, file: !534, line: 123, baseType: !158, size: 32, offset: 4992)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "Esp", scope: !558, file: !534, line: 124, baseType: !158, size: 32, offset: 5024)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "Ebx", scope: !558, file: !534, line: 125, baseType: !158, size: 32, offset: 5056)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "Edx", scope: !558, file: !534, line: 126, baseType: !158, size: 32, offset: 5088)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "Ecx", scope: !558, file: !534, line: 127, baseType: !158, size: 32, offset: 5120)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "Eax", scope: !558, file: !534, line: 128, baseType: !158, size: 32, offset: 5152)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "SystemContextX64", scope: !537, file: !534, line: 781, baseType: !647, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SYSTEM_CONTEXT_X64", file: !534, line: 232, baseType: !649)
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_SYSTEM_CONTEXT_X64", file: !534, line: 189, size: 6848, elements: !650)
!650 = !{!651, !652, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "ExceptionData", scope: !649, file: !534, line: 190, baseType: !138, size: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "FxSaveState", scope: !649, file: !534, line: 191, baseType: !653, size: 4096, offset: 64)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FX_SAVE_STATE_X64", file: !534, line: 184, baseType: !654)
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_FX_SAVE_STATE_X64", file: !534, line: 156, size: 4096, elements: !655)
!655 = !{!656, !657, !658, !659, !660, !661, !662, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "Fcw", scope: !654, file: !534, line: 157, baseType: !154, size: 16)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "Fsw", scope: !654, file: !534, line: 158, baseType: !154, size: 16, offset: 16)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "Ftw", scope: !654, file: !534, line: 159, baseType: !154, size: 16, offset: 32)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "Opcode", scope: !654, file: !534, line: 160, baseType: !154, size: 16, offset: 48)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "Rip", scope: !654, file: !534, line: 161, baseType: !138, size: 64, offset: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "DataOffset", scope: !654, file: !534, line: 162, baseType: !138, size: 64, offset: 128)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !654, file: !534, line: 163, baseType: !663, size: 64, offset: 192)
!663 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 64, elements: !664)
!664 = !{!665}
!665 = !DISubrange(count: 8)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "St0Mm0", scope: !654, file: !534, line: 164, baseType: !575, size: 80, offset: 256)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !654, file: !534, line: 164, baseType: !580, size: 48, offset: 336)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "St1Mm1", scope: !654, file: !534, line: 165, baseType: !575, size: 80, offset: 384)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !654, file: !534, line: 165, baseType: !580, size: 48, offset: 464)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "St2Mm2", scope: !654, file: !534, line: 166, baseType: !575, size: 80, offset: 512)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !654, file: !534, line: 166, baseType: !580, size: 48, offset: 592)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "St3Mm3", scope: !654, file: !534, line: 167, baseType: !575, size: 80, offset: 640)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !654, file: !534, line: 167, baseType: !580, size: 48, offset: 720)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "St4Mm4", scope: !654, file: !534, line: 168, baseType: !575, size: 80, offset: 768)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved6", scope: !654, file: !534, line: 168, baseType: !580, size: 48, offset: 848)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "St5Mm5", scope: !654, file: !534, line: 169, baseType: !575, size: 80, offset: 896)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved7", scope: !654, file: !534, line: 169, baseType: !580, size: 48, offset: 976)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "St6Mm6", scope: !654, file: !534, line: 170, baseType: !575, size: 80, offset: 1024)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved8", scope: !654, file: !534, line: 170, baseType: !580, size: 48, offset: 1104)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "St7Mm7", scope: !654, file: !534, line: 171, baseType: !575, size: 80, offset: 1152)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved9", scope: !654, file: !534, line: 171, baseType: !580, size: 48, offset: 1232)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "Xmm0", scope: !654, file: !534, line: 172, baseType: !598, size: 128, offset: 1280)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "Xmm1", scope: !654, file: !534, line: 173, baseType: !598, size: 128, offset: 1408)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "Xmm2", scope: !654, file: !534, line: 174, baseType: !598, size: 128, offset: 1536)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "Xmm3", scope: !654, file: !534, line: 175, baseType: !598, size: 128, offset: 1664)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "Xmm4", scope: !654, file: !534, line: 176, baseType: !598, size: 128, offset: 1792)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "Xmm5", scope: !654, file: !534, line: 177, baseType: !598, size: 128, offset: 1920)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "Xmm6", scope: !654, file: !534, line: 178, baseType: !598, size: 128, offset: 2048)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "Xmm7", scope: !654, file: !534, line: 179, baseType: !598, size: 128, offset: 2176)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved11", scope: !654, file: !534, line: 183, baseType: !609, size: 1792, offset: 2304)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "Dr0", scope: !649, file: !534, line: 192, baseType: !138, size: 64, offset: 4160)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "Dr1", scope: !649, file: !534, line: 193, baseType: !138, size: 64, offset: 4224)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "Dr2", scope: !649, file: !534, line: 194, baseType: !138, size: 64, offset: 4288)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "Dr3", scope: !649, file: !534, line: 195, baseType: !138, size: 64, offset: 4352)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "Dr6", scope: !649, file: !534, line: 196, baseType: !138, size: 64, offset: 4416)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "Dr7", scope: !649, file: !534, line: 197, baseType: !138, size: 64, offset: 4480)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "Cr0", scope: !649, file: !534, line: 198, baseType: !138, size: 64, offset: 4544)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "Cr1", scope: !649, file: !534, line: 199, baseType: !138, size: 64, offset: 4608)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "Cr2", scope: !649, file: !534, line: 200, baseType: !138, size: 64, offset: 4672)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "Cr3", scope: !649, file: !534, line: 201, baseType: !138, size: 64, offset: 4736)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "Cr4", scope: !649, file: !534, line: 202, baseType: !138, size: 64, offset: 4800)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "Cr8", scope: !649, file: !534, line: 203, baseType: !138, size: 64, offset: 4864)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "Rflags", scope: !649, file: !534, line: 204, baseType: !138, size: 64, offset: 4928)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "Ldtr", scope: !649, file: !534, line: 205, baseType: !138, size: 64, offset: 4992)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "Tr", scope: !649, file: !534, line: 206, baseType: !138, size: 64, offset: 5056)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "Gdtr", scope: !649, file: !534, line: 207, baseType: !707, size: 128, offset: 5120)
!707 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 128, elements: !628)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "Idtr", scope: !649, file: !534, line: 208, baseType: !707, size: 128, offset: 5248)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "Rip", scope: !649, file: !534, line: 209, baseType: !138, size: 64, offset: 5376)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "Gs", scope: !649, file: !534, line: 210, baseType: !138, size: 64, offset: 5440)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "Fs", scope: !649, file: !534, line: 211, baseType: !138, size: 64, offset: 5504)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "Es", scope: !649, file: !534, line: 212, baseType: !138, size: 64, offset: 5568)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "Ds", scope: !649, file: !534, line: 213, baseType: !138, size: 64, offset: 5632)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "Cs", scope: !649, file: !534, line: 214, baseType: !138, size: 64, offset: 5696)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "Ss", scope: !649, file: !534, line: 215, baseType: !138, size: 64, offset: 5760)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "Rdi", scope: !649, file: !534, line: 216, baseType: !138, size: 64, offset: 5824)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "Rsi", scope: !649, file: !534, line: 217, baseType: !138, size: 64, offset: 5888)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "Rbp", scope: !649, file: !534, line: 218, baseType: !138, size: 64, offset: 5952)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "Rsp", scope: !649, file: !534, line: 219, baseType: !138, size: 64, offset: 6016)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "Rbx", scope: !649, file: !534, line: 220, baseType: !138, size: 64, offset: 6080)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "Rdx", scope: !649, file: !534, line: 221, baseType: !138, size: 64, offset: 6144)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "Rcx", scope: !649, file: !534, line: 222, baseType: !138, size: 64, offset: 6208)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "Rax", scope: !649, file: !534, line: 223, baseType: !138, size: 64, offset: 6272)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "R8", scope: !649, file: !534, line: 224, baseType: !138, size: 64, offset: 6336)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "R9", scope: !649, file: !534, line: 225, baseType: !138, size: 64, offset: 6400)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "R10", scope: !649, file: !534, line: 226, baseType: !138, size: 64, offset: 6464)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "R11", scope: !649, file: !534, line: 227, baseType: !138, size: 64, offset: 6528)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "R12", scope: !649, file: !534, line: 228, baseType: !138, size: 64, offset: 6592)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "R13", scope: !649, file: !534, line: 229, baseType: !138, size: 64, offset: 6656)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "R14", scope: !649, file: !534, line: 230, baseType: !138, size: 64, offset: 6720)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "R15", scope: !649, file: !534, line: 231, baseType: !138, size: 64, offset: 6784)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "SystemContextIpf", scope: !537, file: !534, line: 782, baseType: !733, size: 64)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SYSTEM_CONTEXT_IPF", file: !534, line: 432, baseType: !735)
!735 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_SYSTEM_CONTEXT_IPF", file: !534, line: 282, size: 9536, elements: !736)
!736 = !{!737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved", scope: !735, file: !534, line: 287, baseType: !138, size: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "R1", scope: !735, file: !534, line: 288, baseType: !138, size: 64, offset: 64)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "R2", scope: !735, file: !534, line: 289, baseType: !138, size: 64, offset: 128)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "R3", scope: !735, file: !534, line: 290, baseType: !138, size: 64, offset: 192)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "R4", scope: !735, file: !534, line: 291, baseType: !138, size: 64, offset: 256)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "R5", scope: !735, file: !534, line: 292, baseType: !138, size: 64, offset: 320)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "R6", scope: !735, file: !534, line: 293, baseType: !138, size: 64, offset: 384)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "R7", scope: !735, file: !534, line: 294, baseType: !138, size: 64, offset: 448)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "R8", scope: !735, file: !534, line: 295, baseType: !138, size: 64, offset: 512)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "R9", scope: !735, file: !534, line: 296, baseType: !138, size: 64, offset: 576)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "R10", scope: !735, file: !534, line: 297, baseType: !138, size: 64, offset: 640)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "R11", scope: !735, file: !534, line: 298, baseType: !138, size: 64, offset: 704)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "R12", scope: !735, file: !534, line: 299, baseType: !138, size: 64, offset: 768)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "R13", scope: !735, file: !534, line: 300, baseType: !138, size: 64, offset: 832)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "R14", scope: !735, file: !534, line: 301, baseType: !138, size: 64, offset: 896)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "R15", scope: !735, file: !534, line: 302, baseType: !138, size: 64, offset: 960)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "R16", scope: !735, file: !534, line: 303, baseType: !138, size: 64, offset: 1024)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "R17", scope: !735, file: !534, line: 304, baseType: !138, size: 64, offset: 1088)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "R18", scope: !735, file: !534, line: 305, baseType: !138, size: 64, offset: 1152)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "R19", scope: !735, file: !534, line: 306, baseType: !138, size: 64, offset: 1216)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "R20", scope: !735, file: !534, line: 307, baseType: !138, size: 64, offset: 1280)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "R21", scope: !735, file: !534, line: 308, baseType: !138, size: 64, offset: 1344)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "R22", scope: !735, file: !534, line: 309, baseType: !138, size: 64, offset: 1408)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "R23", scope: !735, file: !534, line: 310, baseType: !138, size: 64, offset: 1472)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "R24", scope: !735, file: !534, line: 311, baseType: !138, size: 64, offset: 1536)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "R25", scope: !735, file: !534, line: 312, baseType: !138, size: 64, offset: 1600)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "R26", scope: !735, file: !534, line: 313, baseType: !138, size: 64, offset: 1664)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "R27", scope: !735, file: !534, line: 314, baseType: !138, size: 64, offset: 1728)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "R28", scope: !735, file: !534, line: 315, baseType: !138, size: 64, offset: 1792)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "R29", scope: !735, file: !534, line: 316, baseType: !138, size: 64, offset: 1856)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "R30", scope: !735, file: !534, line: 317, baseType: !138, size: 64, offset: 1920)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "R31", scope: !735, file: !534, line: 318, baseType: !138, size: 64, offset: 1984)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "F2", scope: !735, file: !534, line: 320, baseType: !707, size: 128, offset: 2048)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "F3", scope: !735, file: !534, line: 321, baseType: !707, size: 128, offset: 2176)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "F4", scope: !735, file: !534, line: 322, baseType: !707, size: 128, offset: 2304)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "F5", scope: !735, file: !534, line: 323, baseType: !707, size: 128, offset: 2432)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "F6", scope: !735, file: !534, line: 324, baseType: !707, size: 128, offset: 2560)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "F7", scope: !735, file: !534, line: 325, baseType: !707, size: 128, offset: 2688)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "F8", scope: !735, file: !534, line: 326, baseType: !707, size: 128, offset: 2816)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "F9", scope: !735, file: !534, line: 327, baseType: !707, size: 128, offset: 2944)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "F10", scope: !735, file: !534, line: 328, baseType: !707, size: 128, offset: 3072)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "F11", scope: !735, file: !534, line: 329, baseType: !707, size: 128, offset: 3200)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "F12", scope: !735, file: !534, line: 330, baseType: !707, size: 128, offset: 3328)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "F13", scope: !735, file: !534, line: 331, baseType: !707, size: 128, offset: 3456)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "F14", scope: !735, file: !534, line: 332, baseType: !707, size: 128, offset: 3584)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "F15", scope: !735, file: !534, line: 333, baseType: !707, size: 128, offset: 3712)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "F16", scope: !735, file: !534, line: 334, baseType: !707, size: 128, offset: 3840)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "F17", scope: !735, file: !534, line: 335, baseType: !707, size: 128, offset: 3968)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "F18", scope: !735, file: !534, line: 336, baseType: !707, size: 128, offset: 4096)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "F19", scope: !735, file: !534, line: 337, baseType: !707, size: 128, offset: 4224)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "F20", scope: !735, file: !534, line: 338, baseType: !707, size: 128, offset: 4352)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "F21", scope: !735, file: !534, line: 339, baseType: !707, size: 128, offset: 4480)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "F22", scope: !735, file: !534, line: 340, baseType: !707, size: 128, offset: 4608)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "F23", scope: !735, file: !534, line: 341, baseType: !707, size: 128, offset: 4736)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "F24", scope: !735, file: !534, line: 342, baseType: !707, size: 128, offset: 4864)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "F25", scope: !735, file: !534, line: 343, baseType: !707, size: 128, offset: 4992)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "F26", scope: !735, file: !534, line: 344, baseType: !707, size: 128, offset: 5120)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "F27", scope: !735, file: !534, line: 345, baseType: !707, size: 128, offset: 5248)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "F28", scope: !735, file: !534, line: 346, baseType: !707, size: 128, offset: 5376)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "F29", scope: !735, file: !534, line: 347, baseType: !707, size: 128, offset: 5504)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "F30", scope: !735, file: !534, line: 348, baseType: !707, size: 128, offset: 5632)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "F31", scope: !735, file: !534, line: 349, baseType: !707, size: 128, offset: 5760)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "Pr", scope: !735, file: !534, line: 351, baseType: !138, size: 64, offset: 5888)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "B0", scope: !735, file: !534, line: 353, baseType: !138, size: 64, offset: 5952)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "B1", scope: !735, file: !534, line: 354, baseType: !138, size: 64, offset: 6016)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "B2", scope: !735, file: !534, line: 355, baseType: !138, size: 64, offset: 6080)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "B3", scope: !735, file: !534, line: 356, baseType: !138, size: 64, offset: 6144)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "B4", scope: !735, file: !534, line: 357, baseType: !138, size: 64, offset: 6208)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "B5", scope: !735, file: !534, line: 358, baseType: !138, size: 64, offset: 6272)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "B6", scope: !735, file: !534, line: 359, baseType: !138, size: 64, offset: 6336)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "B7", scope: !735, file: !534, line: 360, baseType: !138, size: 64, offset: 6400)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "ArRsc", scope: !735, file: !534, line: 365, baseType: !138, size: 64, offset: 6464)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "ArBsp", scope: !735, file: !534, line: 366, baseType: !138, size: 64, offset: 6528)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "ArBspstore", scope: !735, file: !534, line: 367, baseType: !138, size: 64, offset: 6592)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "ArRnat", scope: !735, file: !534, line: 368, baseType: !138, size: 64, offset: 6656)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "ArFcr", scope: !735, file: !534, line: 370, baseType: !138, size: 64, offset: 6720)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "ArEflag", scope: !735, file: !534, line: 372, baseType: !138, size: 64, offset: 6784)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "ArCsd", scope: !735, file: !534, line: 373, baseType: !138, size: 64, offset: 6848)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "ArSsd", scope: !735, file: !534, line: 374, baseType: !138, size: 64, offset: 6912)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "ArCflg", scope: !735, file: !534, line: 375, baseType: !138, size: 64, offset: 6976)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "ArFsr", scope: !735, file: !534, line: 376, baseType: !138, size: 64, offset: 7040)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "ArFir", scope: !735, file: !534, line: 377, baseType: !138, size: 64, offset: 7104)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "ArFdr", scope: !735, file: !534, line: 378, baseType: !138, size: 64, offset: 7168)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "ArCcv", scope: !735, file: !534, line: 380, baseType: !138, size: 64, offset: 7232)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "ArUnat", scope: !735, file: !534, line: 382, baseType: !138, size: 64, offset: 7296)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "ArFpsr", scope: !735, file: !534, line: 384, baseType: !138, size: 64, offset: 7360)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "ArPfs", scope: !735, file: !534, line: 386, baseType: !138, size: 64, offset: 7424)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "ArLc", scope: !735, file: !534, line: 387, baseType: !138, size: 64, offset: 7488)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "ArEc", scope: !735, file: !534, line: 388, baseType: !138, size: 64, offset: 7552)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "CrDcr", scope: !735, file: !534, line: 393, baseType: !138, size: 64, offset: 7616)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "CrItm", scope: !735, file: !534, line: 394, baseType: !138, size: 64, offset: 7680)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "CrIva", scope: !735, file: !534, line: 395, baseType: !138, size: 64, offset: 7744)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "CrPta", scope: !735, file: !534, line: 396, baseType: !138, size: 64, offset: 7808)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "CrIpsr", scope: !735, file: !534, line: 397, baseType: !138, size: 64, offset: 7872)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "CrIsr", scope: !735, file: !534, line: 398, baseType: !138, size: 64, offset: 7936)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "CrIip", scope: !735, file: !534, line: 399, baseType: !138, size: 64, offset: 8000)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "CrIfa", scope: !735, file: !534, line: 400, baseType: !138, size: 64, offset: 8064)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "CrItir", scope: !735, file: !534, line: 401, baseType: !138, size: 64, offset: 8128)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "CrIipa", scope: !735, file: !534, line: 402, baseType: !138, size: 64, offset: 8192)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "CrIfs", scope: !735, file: !534, line: 403, baseType: !138, size: 64, offset: 8256)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "CrIim", scope: !735, file: !534, line: 404, baseType: !138, size: 64, offset: 8320)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "CrIha", scope: !735, file: !534, line: 405, baseType: !138, size: 64, offset: 8384)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "Dbr0", scope: !735, file: !534, line: 410, baseType: !138, size: 64, offset: 8448)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "Dbr1", scope: !735, file: !534, line: 411, baseType: !138, size: 64, offset: 8512)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "Dbr2", scope: !735, file: !534, line: 412, baseType: !138, size: 64, offset: 8576)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "Dbr3", scope: !735, file: !534, line: 413, baseType: !138, size: 64, offset: 8640)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "Dbr4", scope: !735, file: !534, line: 414, baseType: !138, size: 64, offset: 8704)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "Dbr5", scope: !735, file: !534, line: 415, baseType: !138, size: 64, offset: 8768)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "Dbr6", scope: !735, file: !534, line: 416, baseType: !138, size: 64, offset: 8832)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "Dbr7", scope: !735, file: !534, line: 417, baseType: !138, size: 64, offset: 8896)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "Ibr0", scope: !735, file: !534, line: 419, baseType: !138, size: 64, offset: 8960)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "Ibr1", scope: !735, file: !534, line: 420, baseType: !138, size: 64, offset: 9024)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "Ibr2", scope: !735, file: !534, line: 421, baseType: !138, size: 64, offset: 9088)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "Ibr3", scope: !735, file: !534, line: 422, baseType: !138, size: 64, offset: 9152)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "Ibr4", scope: !735, file: !534, line: 423, baseType: !138, size: 64, offset: 9216)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "Ibr5", scope: !735, file: !534, line: 424, baseType: !138, size: 64, offset: 9280)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "Ibr6", scope: !735, file: !534, line: 425, baseType: !138, size: 64, offset: 9344)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "Ibr7", scope: !735, file: !534, line: 426, baseType: !138, size: 64, offset: 9408)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "IntNat", scope: !735, file: !534, line: 431, baseType: !138, size: 64, offset: 9472)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "SystemContextArm", scope: !537, file: !534, line: 783, baseType: !857, size: 64)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SYSTEM_CONTEXT_ARM", file: !534, line: 512, baseType: !859)
!859 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_SYSTEM_CONTEXT_ARM", file: !534, line: 490, size: 672, elements: !860)
!860 = !{!861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "R0", scope: !859, file: !534, line: 491, baseType: !158, size: 32)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "R1", scope: !859, file: !534, line: 492, baseType: !158, size: 32, offset: 32)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "R2", scope: !859, file: !534, line: 493, baseType: !158, size: 32, offset: 64)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "R3", scope: !859, file: !534, line: 494, baseType: !158, size: 32, offset: 96)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "R4", scope: !859, file: !534, line: 495, baseType: !158, size: 32, offset: 128)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "R5", scope: !859, file: !534, line: 496, baseType: !158, size: 32, offset: 160)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "R6", scope: !859, file: !534, line: 497, baseType: !158, size: 32, offset: 192)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "R7", scope: !859, file: !534, line: 498, baseType: !158, size: 32, offset: 224)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "R8", scope: !859, file: !534, line: 499, baseType: !158, size: 32, offset: 256)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "R9", scope: !859, file: !534, line: 500, baseType: !158, size: 32, offset: 288)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "R10", scope: !859, file: !534, line: 501, baseType: !158, size: 32, offset: 320)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "R11", scope: !859, file: !534, line: 502, baseType: !158, size: 32, offset: 352)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "R12", scope: !859, file: !534, line: 503, baseType: !158, size: 32, offset: 384)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "SP", scope: !859, file: !534, line: 504, baseType: !158, size: 32, offset: 416)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "LR", scope: !859, file: !534, line: 505, baseType: !158, size: 32, offset: 448)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "PC", scope: !859, file: !534, line: 506, baseType: !158, size: 32, offset: 480)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "CPSR", scope: !859, file: !534, line: 507, baseType: !158, size: 32, offset: 512)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !859, file: !534, line: 508, baseType: !158, size: 32, offset: 544)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "DFAR", scope: !859, file: !534, line: 509, baseType: !158, size: 32, offset: 576)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "IFSR", scope: !859, file: !534, line: 510, baseType: !158, size: 32, offset: 608)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "IFAR", scope: !859, file: !534, line: 511, baseType: !158, size: 32, offset: 640)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "SystemContextAArch64", scope: !537, file: !534, line: 784, baseType: !883, size: 64)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!884 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SYSTEM_CONTEXT_AARCH64", file: !534, line: 601, baseType: !885)
!885 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_SYSTEM_CONTEXT_AARCH64", file: !534, line: 527, size: 6464, elements: !886)
!886 = !{!887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "X0", scope: !885, file: !534, line: 529, baseType: !138, size: 64)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "X1", scope: !885, file: !534, line: 530, baseType: !138, size: 64, offset: 64)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "X2", scope: !885, file: !534, line: 531, baseType: !138, size: 64, offset: 128)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "X3", scope: !885, file: !534, line: 532, baseType: !138, size: 64, offset: 192)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "X4", scope: !885, file: !534, line: 533, baseType: !138, size: 64, offset: 256)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "X5", scope: !885, file: !534, line: 534, baseType: !138, size: 64, offset: 320)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "X6", scope: !885, file: !534, line: 535, baseType: !138, size: 64, offset: 384)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "X7", scope: !885, file: !534, line: 536, baseType: !138, size: 64, offset: 448)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "X8", scope: !885, file: !534, line: 537, baseType: !138, size: 64, offset: 512)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "X9", scope: !885, file: !534, line: 538, baseType: !138, size: 64, offset: 576)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "X10", scope: !885, file: !534, line: 539, baseType: !138, size: 64, offset: 640)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "X11", scope: !885, file: !534, line: 540, baseType: !138, size: 64, offset: 704)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "X12", scope: !885, file: !534, line: 541, baseType: !138, size: 64, offset: 768)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "X13", scope: !885, file: !534, line: 542, baseType: !138, size: 64, offset: 832)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "X14", scope: !885, file: !534, line: 543, baseType: !138, size: 64, offset: 896)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "X15", scope: !885, file: !534, line: 544, baseType: !138, size: 64, offset: 960)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "X16", scope: !885, file: !534, line: 545, baseType: !138, size: 64, offset: 1024)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "X17", scope: !885, file: !534, line: 546, baseType: !138, size: 64, offset: 1088)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "X18", scope: !885, file: !534, line: 547, baseType: !138, size: 64, offset: 1152)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "X19", scope: !885, file: !534, line: 548, baseType: !138, size: 64, offset: 1216)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "X20", scope: !885, file: !534, line: 549, baseType: !138, size: 64, offset: 1280)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "X21", scope: !885, file: !534, line: 550, baseType: !138, size: 64, offset: 1344)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "X22", scope: !885, file: !534, line: 551, baseType: !138, size: 64, offset: 1408)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "X23", scope: !885, file: !534, line: 552, baseType: !138, size: 64, offset: 1472)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "X24", scope: !885, file: !534, line: 553, baseType: !138, size: 64, offset: 1536)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "X25", scope: !885, file: !534, line: 554, baseType: !138, size: 64, offset: 1600)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "X26", scope: !885, file: !534, line: 555, baseType: !138, size: 64, offset: 1664)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "X27", scope: !885, file: !534, line: 556, baseType: !138, size: 64, offset: 1728)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "X28", scope: !885, file: !534, line: 557, baseType: !138, size: 64, offset: 1792)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "FP", scope: !885, file: !534, line: 558, baseType: !138, size: 64, offset: 1856)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "LR", scope: !885, file: !534, line: 559, baseType: !138, size: 64, offset: 1920)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "SP", scope: !885, file: !534, line: 560, baseType: !138, size: 64, offset: 1984)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "V0", scope: !885, file: !534, line: 563, baseType: !707, size: 128, offset: 2048)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "V1", scope: !885, file: !534, line: 564, baseType: !707, size: 128, offset: 2176)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "V2", scope: !885, file: !534, line: 565, baseType: !707, size: 128, offset: 2304)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "V3", scope: !885, file: !534, line: 566, baseType: !707, size: 128, offset: 2432)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "V4", scope: !885, file: !534, line: 567, baseType: !707, size: 128, offset: 2560)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "V5", scope: !885, file: !534, line: 568, baseType: !707, size: 128, offset: 2688)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "V6", scope: !885, file: !534, line: 569, baseType: !707, size: 128, offset: 2816)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "V7", scope: !885, file: !534, line: 570, baseType: !707, size: 128, offset: 2944)
