; ModuleID = 'PiSmmCore.bc'
source_filename = "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main/MdeModulePkg/Core/PiSmmCore/PiSmmCore.c"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-windows-gnu"

%struct.EFI_TABLE_HEADER = type { i64, i32, i32, i32, i32 }
%struct._EFI_SMM_SYSTEM_TABLE2 = type { %struct.EFI_TABLE_HEADER, i16*, i32, {}*, %struct._EFI_MM_CPU_IO_PROTOCOL, i64 (i32, i64, i8**)*, i64 (i8*)*, i64 (i32, i32, i64, i64*)*, i64 (i64, i64)*, i64 (void (i8*)*, i64, i8*)*, i64, i64, i64*, i8**, i64, %struct.EFI_CONFIGURATION_TABLE*, i64 (i8**, %struct.GUID*, i32, i8*)*, i64 (i8*, %struct.GUID*, i8*)*, i64 (i8*, %struct.GUID*, i8**)*, i64 (%struct.GUID*, i64 (%struct.GUID*, i8*, i8*)*, i8**)*, i64 (i32, %struct.GUID*, i8*, i64*, i8**)*, i64 (%struct.GUID*, i8*, i8**)*, i64 (%struct.GUID*, i8*, i8*, i64*)*, i64 (i64 (i8*, i8*, i8*, i64*)*, %struct.GUID*, i8**)*, i64 (i8*)* }
%struct.GUID = type { i32, i16, i16, [8 x i8] }
%struct._EFI_MM_CPU_IO_PROTOCOL = type { %struct.EFI_MM_IO_ACCESS, %struct.EFI_MM_IO_ACCESS }
%struct.EFI_MM_IO_ACCESS = type { i64 (%struct._EFI_MM_CPU_IO_PROTOCOL*, i32, i64, i64, i8*)*, i64 (%struct._EFI_MM_CPU_IO_PROTOCOL*, i32, i64, i64, i8*)* }
%struct.EFI_CONFIGURATION_TABLE = type { %struct.GUID, i8* }
%struct.SMM_CORE_SMI_HANDLERS = type { i64 (i8*, i8*, i8*, i64*)*, %struct.GUID*, i8*, i8 }

!34 = !DIFile(filename: "MdePkg/Include/Uefi/UefiSpec.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "dd07249351b00161d82576c2d3d57d19")
!35 = !{!36, !37, !38, !39}
!36 = !DIEnumerator(name: "AllocateAnyPages", value: 0)
!37 = !DIEnumerator(name: "AllocateMaxAddress", value: 1)
!38 = !DIEnumerator(name: "AllocateAddress", value: 2)
!39 = !DIEnumerator(name: "MaxAllocateType", value: 3)
!40 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !34, line: 1144, baseType: !7, size: 32, elements: !41)
!41 = !{!42}
!42 = !DIEnumerator(name: "EFI_NATIVE_INTERFACE", value: 0)
!43 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !34, line: 1460, baseType: !7, size: 32, elements: !44)
!44 = !{!45, !46, !47}
!45 = !DIEnumerator(name: "AllHandles", value: 0)
!46 = !DIEnumerator(name: "ByRegisterNotify", value: 1)
!47 = !DIEnumerator(name: "ByProtocol", value: 2)
!48 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !49, line: 25, baseType: !7, size: 32, elements: !50)
!49 = !DIFile(filename: "MdePkg/Include/Protocol/MmSxDispatch.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "854999adfec95397706dcae75abccf45")
!50 = !{!51, !52, !53, !54, !55, !56, !57}
!51 = !DIEnumerator(name: "SxS0", value: 0)
!52 = !DIEnumerator(name: "SxS1", value: 1)
!53 = !DIEnumerator(name: "SxS2", value: 2)
!54 = !DIEnumerator(name: "SxS3", value: 3)
!55 = !DIEnumerator(name: "SxS4", value: 4)
!56 = !DIEnumerator(name: "SxS5", value: 5)
!57 = !DIEnumerator(name: "EfiMaximumSleepType", value: 6)
!58 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !49, line: 38, baseType: !7, size: 32, elements: !59)
!59 = !{!60, !61, !62}
!60 = !DIEnumerator(name: "SxEntry", value: 0)
!61 = !DIEnumerator(name: "SxExit", value: 1)
!62 = !DIEnumerator(name: "EfiMaximumPhase", value: 2)
!63 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !14, line: 117, baseType: !7, size: 32, elements: !64)
!64 = !{!65, !66, !67, !68}
!65 = !DIEnumerator(name: "EfiResetCold", value: 0)
!66 = !DIEnumerator(name: "EfiResetWarm", value: 1)
!67 = !DIEnumerator(name: "EfiResetShutdown", value: 2)
!68 = !DIEnumerator(name: "EfiResetPlatformSpecific", value: 3)
!69 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !34, line: 506, baseType: !7, size: 32, elements: !70)
!70 = !{!71, !72, !73}
!71 = !DIEnumerator(name: "TimerCancel", value: 0)
!72 = !DIEnumerator(name: "TimerPeriodic", value: 1)
!73 = !DIEnumerator(name: "TimerRelative", value: 2)
!74 = !{!75, !76, !79, !84, !87, !81, !88, !90, !118}
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "BOOLEAN", file: !77, line: 192, baseType: !78)
!77 = !DIFile(filename: "MdePkg/Include/X64/ProcessorBind.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "ef2524a221fe61206fa09ec88dd4f59b")
!78 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "RETURN_STATUS", file: !80, line: 1026, baseType: !81)
!80 = !DIFile(filename: "MdePkg/Include/Base.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "0c11ea3d1992443d8a8f590a064e50ff")
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINTN", file: !77, line: 211, baseType: !82)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT64", file: !77, line: 162, baseType: !83)
!83 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTN", file: !77, line: 216, baseType: !85)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT64", file: !77, line: 166, baseType: !86)
!86 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT8", file: !77, line: 196, baseType: !78)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SMM_COMMUNICATE_HEADER", file: !92, line: 17, baseType: !93)
!92 = !DIFile(filename: "MdePkg/Include/Protocol/SmmCommunication.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "9caca2959a048506d44db17576284075")
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MM_COMMUNICATE_HEADER", file: !94, line: 34, baseType: !95)
!94 = !DIFile(filename: "MdePkg/Include/Protocol/MmCommunication.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "f75635d145543cd744523801edc6e57b")
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_MM_COMMUNICATE_HEADER", file: !94, line: 21, size: 200, elements: !96)
!96 = !{!97, !113, !114}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "HeaderGuid", scope: !95, file: !94, line: 25, baseType: !98, size: 128)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GUID", file: !99, line: 25, baseType: !100)
!99 = !DIFile(filename: "MdePkg/Include/Uefi/UefiBaseType.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "dbec48e65949dff122bc920c9d9d9c6a")
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "GUID", file: !80, line: 218, baseType: !101)
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GUID", file: !80, line: 213, size: 128, elements: !102)
!102 = !{!103, !105, !108, !109}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "Data1", scope: !101, file: !80, line: 214, baseType: !104, size: 32)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT32", file: !77, line: 170, baseType: !7)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "Data2", scope: !101, file: !80, line: 215, baseType: !106, size: 16, offset: 32)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT16", file: !77, line: 178, baseType: !107)
!107 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "Data3", scope: !101, file: !80, line: 216, baseType: !106, size: 16, offset: 48)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "Data4", scope: !101, file: !80, line: 217, baseType: !110, size: 64, offset: 64)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 64, elements: !111)
!111 = !{!112}
!112 = !DISubrange(count: 8)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "MessageLength", scope: !95, file: !94, line: 29, baseType: !81, size: 64, offset: 128)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !95, file: !94, line: 33, baseType: !115, size: 8, offset: 192)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 8, elements: !116)
!116 = !{!117}
!117 = !DISubrange(count: 1)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "SMM_CORE_PRIVATE_DATA", file: !120, line: 117, baseType: !121)
!120 = !DIFile(filename: "MdeModulePkg/Core/PiSmmCore/PiSmmCorePrivateData.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "7758483ef0303df1f84e962d95159671")
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SMM_CORE_PRIVATE_DATA", file: !120, line: 44, size: 832, elements: !122)
!122 = !{!123, !124, !126, !127, !139, !167, !168, !169, !315, !316, !317, !318, !319, !320}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", scope: !121, file: !120, line: 45, baseType: !81, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "SmmIplImageHandle", scope: !121, file: !120, line: 52, baseType: !125, size: 64, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_HANDLE", file: !99, line: 33, baseType: !75)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "SmramRangeCount", scope: !121, file: !120, line: 58, baseType: !81, size: 64, offset: 128)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "SmramRanges", scope: !121, file: !120, line: 64, baseType: !128, size: 64, offset: 192)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SMRAM_DESCRIPTOR", file: !130, line: 134, baseType: !131)
!130 = !DIFile(filename: "MdePkg/Include/Pi/PiMultiPhase.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "f007ff34f79c38f5620bc144199a0556")
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MMRAM_DESCRIPTOR", file: !130, line: 132, baseType: !132)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_MMRAM_DESCRIPTOR", file: !130, line: 109, size: 256, elements: !133)
!133 = !{!134, !136, !137, !138}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "PhysicalStart", scope: !132, file: !130, line: 115, baseType: !135, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_PHYSICAL_ADDRESS", file: !99, line: 50, baseType: !82)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "CpuStart", scope: !132, file: !130, line: 120, baseType: !135, size: 64, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "PhysicalSize", scope: !132, file: !130, line: 124, baseType: !82, size: 64, offset: 128)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "RegionState", scope: !132, file: !130, line: 131, baseType: !82, size: 64, offset: 192)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "SmmEntryPoint", scope: !121, file: !120, line: 75, baseType: !140, size: 64, offset: 256)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SMM_ENTRY_POINT", file: !141, line: 96, baseType: !142)
!141 = !DIFile(filename: "MdePkg/Include/Pi/PiSmmCis.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "26f8805d33aa377abd8e63bed8e50f01")
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DISubroutineType(types: !144)
!144 = !{null, !145}
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !147)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SMM_ENTRY_CONTEXT", file: !141, line: 87, baseType: !148)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_SMM_ENTRY_CONTEXT", file: !141, line: 63, size: 320, elements: !149)
!149 = !{!150, !162, !163, !164, !166}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "SmmStartupThisAp", scope: !148, file: !141, line: 64, baseType: !151, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SMM_STARTUP_THIS_AP", file: !141, line: 52, baseType: !152)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MM_STARTUP_THIS_AP", file: !153, line: 74, baseType: !154)
!153 = !DIFile(filename: "MdePkg/Include/Pi/PiMmCis.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "82364cafffe22fadeeaa767af7242f69")
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DISubroutineType(types: !156)
!156 = !{!157, !158, !81, !75}
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_STATUS", file: !99, line: 29, baseType: !79)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_AP_PROCEDURE", file: !130, line: 191, baseType: !159)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DISubroutineType(types: !161)
!161 = !{null, !75}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "CurrentlyExecutingCpu", scope: !148, file: !141, line: 69, baseType: !81, size: 64, offset: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "NumberOfCpus", scope: !148, file: !141, line: 74, baseType: !81, size: 64, offset: 128)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "CpuSaveStateSize", scope: !148, file: !141, line: 80, baseType: !165, size: 64, offset: 192)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "CpuSaveState", scope: !148, file: !141, line: 86, baseType: !87, size: 64, offset: 256)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "SmmEntryPointRegistered", scope: !121, file: !120, line: 80, baseType: !76, size: 8, offset: 320)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "InSmm", scope: !121, file: !120, line: 85, baseType: !76, size: 8, offset: 328)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "Smst", scope: !121, file: !120, line: 92, baseType: !170, size: 64, offset: 384)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SMM_SYSTEM_TABLE2", file: !141, line: 16, baseType: !172)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_SMM_SYSTEM_TABLE2", file: !141, line: 107, size: 1920, elements: !173)
!173 = !{!174, !183, !186, !187, !196, !216, !222, !227, !234, !239, !240, !241, !242, !243, !244, !245, !252, !260, !265, !270, !280, !286, !291, !299, !309}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "Hdr", scope: !172, file: !141, line: 111, baseType: !175, size: 192)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TABLE_HEADER", file: !14, line: 177, baseType: !176)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_TABLE_HEADER", file: !14, line: 150, size: 192, elements: !177)
!177 = !{!178, !179, !180, !181, !182}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", scope: !176, file: !14, line: 156, baseType: !82, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "Revision", scope: !176, file: !14, line: 163, baseType: !104, size: 32, offset: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "HeaderSize", scope: !176, file: !14, line: 167, baseType: !104, size: 32, offset: 96)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "CRC32", scope: !176, file: !14, line: 172, baseType: !104, size: 32, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved", scope: !176, file: !14, line: 176, baseType: !104, size: 32, offset: 160)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "SmmFirmwareVendor", scope: !172, file: !141, line: 116, baseType: !184, size: 64, offset: 192)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHAR16", file: !77, line: 183, baseType: !107)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "SmmFirmwareRevision", scope: !172, file: !141, line: 120, baseType: !104, size: 32, offset: 256)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "SmmInstallConfigurationTable", scope: !172, file: !141, line: 122, baseType: !188, size: 64, offset: 320)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SMM_INSTALL_CONFIGURATION_TABLE2", file: !141, line: 45, baseType: !189)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DISubroutineType(types: !191)
!191 = !{!157, !192, !194, !75, !81}
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !171)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !98)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "SmmIo", scope: !172, file: !141, line: 127, baseType: !197, size: 256, offset: 384)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SMM_CPU_IO2_PROTOCOL", file: !198, line: 18, baseType: !199)
!198 = !DIFile(filename: "MdePkg/Include/Protocol/SmmCpuIo2.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "5e0724067d433e73999351857cb7bd3a")
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MM_CPU_IO_PROTOCOL", file: !6, line: 19, baseType: !200)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_MM_CPU_IO_PROTOCOL", file: !6, line: 77, size: 256, elements: !201)
!201 = !{!202, !215}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "Mem", scope: !200, file: !6, line: 81, baseType: !203, size: 128)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MM_IO_ACCESS", file: !6, line: 72, baseType: !204)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_MM_IO_ACCESS", file: !6, line: 63, size: 128, elements: !205)
!205 = !{!206, !214}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "Read", scope: !204, file: !6, line: 67, baseType: !207, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MM_CPU_IO", file: !6, line: 55, baseType: !208)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DISubroutineType(types: !210)
!210 = !{!157, !211, !213, !82, !81, !75}
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !199)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MM_IO_WIDTH", file: !6, line: 29, baseType: !5)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "Write", scope: !204, file: !6, line: 71, baseType: !207, size: 64, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "Io", scope: !200, file: !6, line: 85, baseType: !203, size: 128, offset: 128)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "SmmAllocatePool", scope: !172, file: !141, line: 132, baseType: !217, size: 64, offset: 640)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_ALLOCATE_POOL", file: !34, line: 270, baseType: !218)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DISubroutineType(types: !220)
!220 = !{!157, !221, !81, !87}
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MEMORY_TYPE", file: !14, line: 112, baseType: !13)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "SmmFreePool", scope: !172, file: !141, line: 133, baseType: !223, size: 64, offset: 704)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FREE_POOL", file: !34, line: 287, baseType: !224)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DISubroutineType(types: !226)
!226 = !{!157, !75}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "SmmAllocatePages", scope: !172, file: !141, line: 134, baseType: !228, size: 64, offset: 768)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_ALLOCATE_PAGES", file: !34, line: 188, baseType: !229)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DISubroutineType(types: !231)
!231 = !{!157, !232, !221, !81, !233}
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_ALLOCATE_TYPE", file: !34, line: 47, baseType: !33)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "SmmFreePages", scope: !172, file: !141, line: 135, baseType: !235, size: 64, offset: 832)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FREE_PAGES", file: !34, line: 209, baseType: !236)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DISubroutineType(types: !238)
!238 = !{!157, !135, !81}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "SmmStartupThisAp", scope: !172, file: !141, line: 140, baseType: !151, size: 64, offset: 896)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "CurrentlyExecutingCpu", scope: !172, file: !141, line: 150, baseType: !81, size: 64, offset: 960)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "NumberOfCpus", scope: !172, file: !141, line: 154, baseType: !81, size: 64, offset: 1024)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "CpuSaveStateSize", scope: !172, file: !141, line: 160, baseType: !165, size: 64, offset: 1088)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "CpuSaveState", scope: !172, file: !141, line: 166, baseType: !87, size: 64, offset: 1152)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "NumberOfTableEntries", scope: !172, file: !141, line: 175, baseType: !81, size: 64, offset: 1216)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "SmmConfigurationTable", scope: !172, file: !141, line: 180, baseType: !246, size: 64, offset: 1280)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CONFIGURATION_TABLE", file: !34, line: 1972, baseType: !248)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_CONFIGURATION_TABLE", file: !34, line: 1963, size: 192, elements: !249)
!249 = !{!250, !251}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "VendorGuid", scope: !248, file: !34, line: 1967, baseType: !98, size: 128)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "VendorTable", scope: !248, file: !34, line: 1971, baseType: !75, size: 64, offset: 128)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "SmmInstallProtocolInterface", scope: !172, file: !141, line: 185, baseType: !253, size: 64, offset: 1344)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_INSTALL_PROTOCOL_INTERFACE", file: !34, line: 1173, baseType: !254)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = !DISubroutineType(types: !256)
!256 = !{!157, !257, !258, !259, !75}
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_INTERFACE_TYPE", file: !34, line: 1149, baseType: !40)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "SmmUninstallProtocolInterface", scope: !172, file: !141, line: 186, baseType: !261, size: 64, offset: 1408)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_UNINSTALL_PROTOCOL_INTERFACE", file: !34, line: 1249, baseType: !262)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DISubroutineType(types: !264)
!264 = !{!157, !125, !258, !75}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "SmmHandleProtocol", scope: !172, file: !141, line: 187, baseType: !266, size: 64, offset: 1472)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_HANDLE_PROTOCOL", file: !34, line: 1290, baseType: !267)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DISubroutineType(types: !269)
!269 = !{!157, !125, !258, !87}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "SmmRegisterProtocolNotify", scope: !172, file: !141, line: 188, baseType: !271, size: 64, offset: 1536)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SMM_REGISTER_PROTOCOL_NOTIFY", file: !141, line: 54, baseType: !272)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MM_REGISTER_PROTOCOL_NOTIFY", file: !153, line: 117, baseType: !273)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DISubroutineType(types: !275)
!275 = !{!157, !194, !276, !87}
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MM_NOTIFY_FN", file: !153, line: 91, baseType: !277)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DISubroutineType(types: !279)
!279 = !{!157, !194, !75, !125}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "SmmLocateHandle", scope: !172, file: !141, line: 189, baseType: !281, size: 64, offset: 1600)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_LOCATE_HANDLE", file: !34, line: 1500, baseType: !282)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DISubroutineType(types: !284)
!284 = !{!157, !285, !258, !75, !165, !257}
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_LOCATE_SEARCH_TYPE", file: !34, line: 1474, baseType: !43)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "SmmLocateProtocol", scope: !172, file: !141, line: 190, baseType: !287, size: 64, offset: 1664)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_LOCATE_PROTOCOL", file: !34, line: 1600, baseType: !288)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DISubroutineType(types: !290)
!290 = !{!157, !258, !75, !87}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "SmiManage", scope: !172, file: !141, line: 195, baseType: !292, size: 64, offset: 1728)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SMM_INTERRUPT_MANAGE", file: !141, line: 55, baseType: !293)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MM_INTERRUPT_MANAGE", file: !153, line: 138, baseType: !294)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DISubroutineType(types: !296)
!296 = !{!157, !194, !297, !75, !165}
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "SmiHandlerRegister", scope: !172, file: !141, line: 196, baseType: !300, size: 64, offset: 1792)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SMM_INTERRUPT_REGISTER", file: !141, line: 57, baseType: !301)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MM_INTERRUPT_REGISTER", file: !153, line: 185, baseType: !302)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DISubroutineType(types: !304)
!304 = !{!157, !305, !194, !257}
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MM_HANDLER_ENTRY_POINT", file: !153, line: 165, baseType: !306)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = !DISubroutineType(types: !308)
!308 = !{!157, !125, !297, !75, !165}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "SmiHandlerUnRegister", scope: !172, file: !141, line: 197, baseType: !310, size: 64, offset: 1856)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SMM_INTERRUPT_UNREGISTER", file: !141, line: 58, baseType: !311)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MM_INTERRUPT_UNREGISTER", file: !153, line: 201, baseType: !312)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DISubroutineType(types: !314)
!314 = !{!157, !125}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "CommunicationBuffer", scope: !121, file: !120, line: 99, baseType: !75, size: 64, offset: 448)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "BufferSize", scope: !121, file: !120, line: 106, baseType: !81, size: 64, offset: 512)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "ReturnStatus", scope: !121, file: !120, line: 112, baseType: !157, size: 64, offset: 576)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "PiSmmCoreImageBase", scope: !121, file: !120, line: 114, baseType: !135, size: 64, offset: 640)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "PiSmmCoreImageSize", scope: !121, file: !120, line: 115, baseType: !82, size: 64, offset: 704)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "PiSmmCoreEntryPoint", scope: !121, file: !120, line: 116, baseType: !135, size: 64, offset: 768)
!321 = !{!0, !322, !325, !327, !329, !343, !348, !351, !353, !355, !357, !359, !361, !363, !365, !367, !910}
!322 = !DIGlobalVariableExpression(var: !323, expr: !DIExpression())
!323 = distinct !DIGlobalVariable(name: "mInLegacyBoot", scope: !2, file: !324, line: 66, type: !76, isLocal: false, isDefinition: true)
!324 = !DIFile(filename: "MdeModulePkg/Core/PiSmmCore/PiSmmCore.c", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "e82e0f04fd2b1eb365f1407b21ce5bc0")
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(name: "mDuringS3Resume", scope: !2, file: !324, line: 72, type: !76, isLocal: false, isDefinition: true)
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(name: "mAcpiS3Enable", scope: !2, file: !324, line: 78, type: !76, isLocal: false, isDefinition: true)
!329 = !DIGlobalVariableExpression(var: !330, expr: !DIExpression())
!330 = distinct !DIGlobalVariable(name: "mSmmCoreSmiHandlers", scope: !2, file: !324, line: 83, type: !331, isLocal: false, isDefinition: true)
!331 = !DICompositeType(tag: DW_TAG_array_type, baseType: !332, size: 1792, elements: !341)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "SMM_CORE_SMI_HANDLERS", file: !333, line: 70, baseType: !334)
!333 = !DIFile(filename: "MdeModulePkg/Core/PiSmmCore/PiSmmCore.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "e4edf3842107ce4b1893f0150320562f")
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SMM_CORE_SMI_HANDLERS", file: !333, line: 65, size: 256, elements: !335)
!335 = !{!336, !338, !339, !340}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "Handler", scope: !334, file: !333, line: 66, baseType: !337, size: 64)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SMM_HANDLER_ENTRY_POINT2", file: !141, line: 56, baseType: !305)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "HandlerType", scope: !334, file: !333, line: 67, baseType: !258, size: 64, offset: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "DispatchHandle", scope: !334, file: !333, line: 68, baseType: !125, size: 64, offset: 128)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "UnRegister", scope: !334, file: !333, line: 69, baseType: !76, size: 8, offset: 192)
!341 = !{!342}
!342 = !DISubrange(count: 7)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(name: "mSmmCoreS3SmiHandlers", scope: !2, file: !324, line: 96, type: !345, isLocal: false, isDefinition: true)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !332, size: 768, elements: !346)
!346 = !{!347}
!347 = !DISubrange(count: 3)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression(DW_OP_constu, 0, DW_OP_stack_value))
!349 = distinct !DIGlobalVariable(name: "EFI_NATIVE_INTERFACE", scope: !2, file: !34, line: 1148, type: !350, isLocal: true, isDefinition: true)
!350 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression(DW_OP_constu, 3, DW_OP_stack_value))
!352 = distinct !DIGlobalVariable(name: "SxS3", scope: !2, file: !49, line: 29, type: !350, isLocal: true, isDefinition: true)
!353 = !DIGlobalVariableExpression(var: !354, expr: !DIExpression(DW_OP_constu, 0, DW_OP_stack_value))
!354 = distinct !DIGlobalVariable(name: "SxEntry", scope: !2, file: !49, line: 39, type: !350, isLocal: true, isDefinition: true)
!355 = !DIGlobalVariableExpression(var: !356, expr: !DIExpression(DW_OP_constu, 4, DW_OP_stack_value))
!356 = distinct !DIGlobalVariable(name: "EfiBootServicesData", scope: !2, file: !14, line: 61, type: !350, isLocal: true, isDefinition: true)
!357 = !DIGlobalVariableExpression(var: !358, expr: !DIExpression(DW_OP_constu, 5, DW_OP_stack_value))
!358 = distinct !DIGlobalVariable(name: "EfiRuntimeServicesCode", scope: !2, file: !14, line: 65, type: !350, isLocal: true, isDefinition: true)
!359 = !DIGlobalVariableExpression(var: !360, expr: !DIExpression(DW_OP_constu, 6, DW_OP_stack_value))
!360 = distinct !DIGlobalVariable(name: "EfiRuntimeServicesData", scope: !2, file: !14, line: 70, type: !350, isLocal: true, isDefinition: true)
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(name: "gSmmCorePrivate", scope: !2, file: !324, line: 14, type: !118, isLocal: false, isDefinition: true)
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(name: "mFullSmramRangeCount", scope: !2, file: !324, line: 102, type: !81, isLocal: false, isDefinition: true)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(name: "mFullSmramRanges", scope: !2, file: !324, line: 103, type: !128, isLocal: false, isDefinition: true)
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(name: "mSmmCoreDriverEntry", scope: !2, file: !324, line: 105, type: !369, isLocal: false, isDefinition: true)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SMM_DRIVER_ENTRY", file: !333, line: 142, baseType: !371)
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_SMM_DRIVER_ENTRY", file: !333, line: 103, size: 2112, elements: !372)
!372 = !{!373, !374, !381, !382, !383, !384, !396, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !904, !906, !907, !908, !909}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", scope: !371, file: !333, line: 104, baseType: !81, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "Link", scope: !371, file: !333, line: 105, baseType: !375, size: 128, offset: 64)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "LIST_ENTRY", file: !80, line: 242, baseType: !376)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_LIST_ENTRY", file: !80, line: 247, size: 128, elements: !377)
!377 = !{!378, !380}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "ForwardLink", scope: !376, file: !80, line: 248, baseType: !379, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "BackLink", scope: !376, file: !80, line: 249, baseType: !379, size: 64, offset: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "ScheduledLink", scope: !371, file: !333, line: 107, baseType: !375, size: 128, offset: 192)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "FvHandle", scope: !371, file: !333, line: 109, baseType: !125, size: 64, offset: 320)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "FileName", scope: !371, file: !333, line: 110, baseType: !98, size: 128, offset: 384)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "FvFileDevicePath", scope: !371, file: !333, line: 111, baseType: !385, size: 64, offset: 512)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DEVICE_PATH_PROTOCOL", file: !387, line: 58, baseType: !388)
!387 = !DIFile(filename: "MdePkg/Include/Protocol/DevicePath.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "6b6d593d171f69b933a87911e52d4607")
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_DEVICE_PATH_PROTOCOL", file: !387, line: 43, size: 32, elements: !389)
!389 = !{!390, !391, !392}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !388, file: !387, line: 44, baseType: !89, size: 8)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "SubType", scope: !388, file: !387, line: 51, baseType: !89, size: 8, offset: 8)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !388, file: !387, line: 56, baseType: !393, size: 16, offset: 16)
!393 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 16, elements: !394)
!394 = !{!395}
!395 = !DISubrange(count: 2)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "Fv", scope: !371, file: !333, line: 112, baseType: !397, size: 64, offset: 576)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FIRMWARE_VOLUME2_PROTOCOL", file: !399, line: 22, baseType: !400)
!399 = !DIFile(filename: "MdePkg/Include/Protocol/FirmwareVolume2.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "e17565cad68c5de540c8e91ee2a96221")
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_FIRMWARE_VOLUME2_PROTOCOL", file: !399, line: 722, size: 640, elements: !401)
!401 = !{!402, !411, !413, !425, !431, !446, !451, !452, !453, !458}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "GetVolumeAttributes", scope: !400, file: !399, line: 723, baseType: !403, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FV_GET_ATTRIBUTES", file: !399, line: 106, baseType: !404)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DISubroutineType(types: !406)
!406 = !{!157, !407, !409}
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !398)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FV_ATTRIBUTES", file: !399, line: 27, baseType: !82)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "SetVolumeAttributes", scope: !400, file: !399, line: 724, baseType: !412, size: 64, offset: 64)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FV_SET_ATTRIBUTES", file: !399, line: 200, baseType: !404)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "ReadFile", scope: !400, file: !399, line: 725, baseType: !414, size: 64, offset: 128)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FV_READ_FILE", file: !399, line: 294, baseType: !415)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DISubroutineType(types: !417)
!417 = !{!157, !407, !194, !87, !165, !418, !421, !424}
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FV_FILETYPE", file: !420, line: 50, baseType: !89)
!420 = !DIFile(filename: "MdePkg/Include/Pi/PiFirmwareFile.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "942fe99f769f631cab0d641a8d548f4d")
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FV_FILE_ATTRIBUTES", file: !423, line: 18, baseType: !104)
!423 = !DIFile(filename: "MdePkg/Include/Pi/PiFirmwareVolume.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "9a02bea8b9edc1b887ae684c8d405b44")
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "ReadSection", scope: !400, file: !399, line: 726, baseType: !426, size: 64, offset: 192)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FV_READ_SECTION", file: !399, line: 400, baseType: !427)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DISubroutineType(types: !429)
!429 = !{!157, !407, !194, !430, !81, !87, !165, !424}
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SECTION_TYPE", file: !420, line: 193, baseType: !89)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "WriteFile", scope: !400, file: !399, line: 727, baseType: !432, size: 64, offset: 256)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FV_WRITE_FILE", file: !399, line: 511, baseType: !433)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DISubroutineType(types: !435)
!435 = !{!157, !407, !104, !436, !437}
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FV_WRITE_POLICY", file: !399, line: 413, baseType: !104)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FV_WRITE_FILE_DATA", file: !399, line: 441, baseType: !439)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_FV_WRITE_FILE_DATA", file: !399, line: 420, size: 256, elements: !440)
!440 = !{!441, !442, !443, !444, !445}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "NameGuid", scope: !439, file: !399, line: 424, baseType: !258, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !439, file: !399, line: 428, baseType: !419, size: 8, offset: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "FileAttributes", scope: !439, file: !399, line: 432, baseType: !422, size: 32, offset: 96)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "Buffer", scope: !439, file: !399, line: 436, baseType: !75, size: 64, offset: 128)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "BufferSize", scope: !439, file: !399, line: 440, baseType: !104, size: 32, offset: 192)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "GetNextFile", scope: !400, file: !399, line: 728, baseType: !447, size: 64, offset: 320)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FV_GET_NEXT_FILE", file: !399, line: 595, baseType: !448)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DISubroutineType(types: !450)
!450 = !{!157, !407, !75, !418, !258, !421, !165}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "KeySize", scope: !400, file: !399, line: 735, baseType: !104, size: 32, offset: 384)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "ParentHandle", scope: !400, file: !399, line: 740, baseType: !125, size: 64, offset: 448)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "GetInfo", scope: !400, file: !399, line: 741, baseType: !454, size: 64, offset: 512)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FV_GET_INFO", file: !399, line: 653, baseType: !455)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DISubroutineType(types: !457)
!457 = !{!157, !407, !194, !165, !75}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "SetInfo", scope: !400, file: !399, line: 742, baseType: !459, size: 64, offset: 576)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FV_SET_INFO", file: !399, line: 702, baseType: !460)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DISubroutineType(types: !462)
!462 = !{!157, !407, !194, !81, !297}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "Depex", scope: !371, file: !333, line: 114, baseType: !75, size: 64, offset: 640)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "DepexSize", scope: !371, file: !333, line: 115, baseType: !81, size: 64, offset: 704)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "Before", scope: !371, file: !333, line: 117, baseType: !76, size: 8, offset: 768)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "After", scope: !371, file: !333, line: 118, baseType: !76, size: 8, offset: 776)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "BeforeAfterGuid", scope: !371, file: !333, line: 119, baseType: !98, size: 128, offset: 800)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "Dependent", scope: !371, file: !333, line: 121, baseType: !76, size: 8, offset: 928)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "Scheduled", scope: !371, file: !333, line: 122, baseType: !76, size: 8, offset: 936)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "Initialized", scope: !371, file: !333, line: 123, baseType: !76, size: 8, offset: 944)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "DepexProtocolError", scope: !371, file: !333, line: 124, baseType: !76, size: 8, offset: 952)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "ImageHandle", scope: !371, file: !333, line: 126, baseType: !125, size: 64, offset: 960)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "LoadedImage", scope: !371, file: !333, line: 127, baseType: !474, size: 64, offset: 1024)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_LOADED_IMAGE_PROTOCOL", file: !476, line: 72, baseType: !477)
!476 = !DIFile(filename: "MdePkg/Include/Protocol/LoadedImage.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "0bfc90f5c05009801c3af3d54bff9caa")
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_LOADED_IMAGE_PROTOCOL", file: !476, line: 43, size: 768, elements: !478)
!478 = !{!479, !480, !481, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "Revision", scope: !477, file: !476, line: 44, baseType: !104, size: 32)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "ParentHandle", scope: !477, file: !476, line: 46, baseType: !125, size: 64, offset: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "SystemTable", scope: !477, file: !476, line: 48, baseType: !482, size: 64, offset: 128)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SYSTEM_TABLE", file: !34, line: 2038, baseType: !484)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_SYSTEM_TABLE", file: !34, line: 1977, size: 960, elements: !485)
!485 = !{!486, !487, !488, !489, !490, !514, !515, !569, !570, !571, !694, !892, !893}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "Hdr", scope: !484, file: !34, line: 1981, baseType: !175, size: 192)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "FirmwareVendor", scope: !484, file: !34, line: 1986, baseType: !184, size: 64, offset: 192)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "FirmwareRevision", scope: !484, file: !34, line: 1991, baseType: !104, size: 32, offset: 256)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "ConsoleInHandle", scope: !484, file: !34, line: 1996, baseType: !125, size: 64, offset: 320)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "ConIn", scope: !484, file: !34, line: 2001, baseType: !491, size: 64, offset: 384)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_TEXT_INPUT_PROTOCOL", file: !493, line: 20, baseType: !494)
!493 = !DIFile(filename: "MdePkg/Include/Protocol/SimpleTextIn.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "239cf4f3dddb25a8596c70fa738413fd")
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_SIMPLE_TEXT_INPUT_PROTOCOL", file: !493, line: 116, size: 192, elements: !495)
!495 = !{!496, !501, !512}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "Reset", scope: !494, file: !493, line: 117, baseType: !497, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_INPUT_RESET", file: !493, line: 86, baseType: !498)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DISubroutineType(types: !500)
!500 = !{!157, !491, !76}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "ReadKeyStroke", scope: !494, file: !493, line: 118, baseType: !502, size: 64, offset: 64)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_INPUT_READ_KEY", file: !493, line: 107, baseType: !503)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DISubroutineType(types: !505)
!505 = !{!157, !491, !506}
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_INPUT_KEY", file: !493, line: 38, baseType: !508)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_INPUT_KEY", file: !493, line: 35, size: 32, elements: !509)
!509 = !{!510, !511}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "ScanCode", scope: !508, file: !493, line: 36, baseType: !106, size: 16)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "UnicodeChar", scope: !508, file: !493, line: 37, baseType: !185, size: 16, offset: 16)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "WaitForKey", scope: !494, file: !493, line: 122, baseType: !513, size: 64, offset: 128)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_EVENT", file: !99, line: 37, baseType: !75)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "ConsoleOutHandle", scope: !484, file: !34, line: 2005, baseType: !125, size: 64, offset: 448)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "ConOut", scope: !484, file: !34, line: 2010, baseType: !516, size: 64, offset: 512)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_TEXT_OUTPUT_PROTOCOL", file: !518, line: 27, baseType: !519)
!518 = !DIFile(filename: "MdePkg/Include/Protocol/SimpleTextOut.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "685bec042927ad46d31bf42ae7f6ddcd")
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_SIMPLE_TEXT_OUTPUT_PROTOCOL", file: !518, line: 387, size: 640, elements: !520)
!520 = !{!521, !526, !531, !533, !538, !543, !545, !550, !555, !557}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "Reset", scope: !519, file: !518, line: 388, baseType: !522, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TEXT_RESET", file: !518, line: 167, baseType: !523)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DISubroutineType(types: !525)
!525 = !{!157, !516, !76}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "OutputString", scope: !519, file: !518, line: 390, baseType: !527, size: 64, offset: 64)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TEXT_STRING", file: !518, line: 192, baseType: !528)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DISubroutineType(types: !530)
!530 = !{!157, !516, !184}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "TestString", scope: !519, file: !518, line: 391, baseType: !532, size: 64, offset: 128)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TEXT_TEST_STRING", file: !518, line: 213, baseType: !528)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "QueryMode", scope: !519, file: !518, line: 393, baseType: !534, size: 64, offset: 192)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TEXT_QUERY_MODE", file: !518, line: 236, baseType: !535)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DISubroutineType(types: !537)
!537 = !{!157, !516, !81, !165, !165}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "SetMode", scope: !519, file: !518, line: 394, baseType: !539, size: 64, offset: 256)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TEXT_SET_MODE", file: !518, line: 256, baseType: !540)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DISubroutineType(types: !542)
!542 = !{!157, !516, !81}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "SetAttribute", scope: !519, file: !518, line: 395, baseType: !544, size: 64, offset: 320)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TEXT_SET_ATTRIBUTE", file: !518, line: 277, baseType: !540)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "ClearScreen", scope: !519, file: !518, line: 397, baseType: !546, size: 64, offset: 384)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TEXT_CLEAR_SCREEN", file: !518, line: 295, baseType: !547)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DISubroutineType(types: !549)
!549 = !{!157, !516}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "SetCursorPosition", scope: !519, file: !518, line: 398, baseType: !551, size: 64, offset: 448)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TEXT_SET_CURSOR_POSITION", file: !518, line: 318, baseType: !552)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DISubroutineType(types: !554)
!554 = !{!157, !516, !81, !81}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "EnableCursor", scope: !519, file: !518, line: 399, baseType: !556, size: 64, offset: 512)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TEXT_ENABLE_CURSOR", file: !518, line: 340, baseType: !523)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "Mode", scope: !519, file: !518, line: 404, baseType: !558, size: 64, offset: 576)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_TEXT_OUTPUT_MODE", file: !518, line: 379, baseType: !560)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_SIMPLE_TEXT_OUTPUT_MODE", file: !518, line: 349, size: 192, elements: !561)
!561 = !{!562, !564, !565, !566, !567, !568}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "MaxMode", scope: !560, file: !518, line: 353, baseType: !563, size: 32)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT32", file: !77, line: 174, baseType: !350)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "Mode", scope: !560, file: !518, line: 362, baseType: !563, size: 32, offset: 32)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "Attribute", scope: !560, file: !518, line: 366, baseType: !563, size: 32, offset: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "CursorColumn", scope: !560, file: !518, line: 370, baseType: !563, size: 32, offset: 96)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "CursorRow", scope: !560, file: !518, line: 374, baseType: !563, size: 32, offset: 128)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "CursorVisible", scope: !560, file: !518, line: 378, baseType: !76, size: 8, offset: 160)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "StandardErrorHandle", scope: !484, file: !34, line: 2015, baseType: !125, size: 64, offset: 576)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "StdErr", scope: !484, file: !34, line: 2020, baseType: !516, size: 64, offset: 640)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "RuntimeServices", scope: !484, file: !34, line: 2024, baseType: !572, size: 64, offset: 704)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_RUNTIME_SERVICES", file: !34, line: 1856, baseType: !574)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_RUNTIME_SERVICES", file: !34, line: 1813, size: 1088, elements: !575)
!575 = !{!576, !577, !606, !611, !617, !622, !637, !642, !647, !652, !657, !662, !668, !682, !689}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "Hdr", scope: !574, file: !34, line: 1817, baseType: !175, size: 192)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "GetTime", scope: !574, file: !34, line: 1822, baseType: !578, size: 64, offset: 192)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GET_TIME", file: !34, line: 801, baseType: !579)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = !DISubroutineType(types: !581)
!581 = !{!157, !582, !599}
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TIME", file: !99, line: 80, baseType: !584)
!584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_TIME", file: !99, line: 68, size: 128, elements: !585)
!585 = !{!586, !587, !588, !589, !590, !591, !592, !593, !594, !597, !598}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "Year", scope: !584, file: !99, line: 69, baseType: !106, size: 16)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "Month", scope: !584, file: !99, line: 70, baseType: !89, size: 8, offset: 16)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "Day", scope: !584, file: !99, line: 71, baseType: !89, size: 8, offset: 24)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "Hour", scope: !584, file: !99, line: 72, baseType: !89, size: 8, offset: 32)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "Minute", scope: !584, file: !99, line: 73, baseType: !89, size: 8, offset: 40)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "Second", scope: !584, file: !99, line: 74, baseType: !89, size: 8, offset: 48)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "Pad1", scope: !584, file: !99, line: 75, baseType: !89, size: 8, offset: 56)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "Nanosecond", scope: !584, file: !99, line: 76, baseType: !104, size: 32, offset: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "TimeZone", scope: !584, file: !99, line: 77, baseType: !595, size: 16, offset: 96)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT16", file: !77, line: 187, baseType: !596)
!596 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "Daylight", scope: !584, file: !99, line: 78, baseType: !89, size: 8, offset: 112)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "Pad2", scope: !584, file: !99, line: 79, baseType: !89, size: 8, offset: 120)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TIME_CAPABILITIES", file: !34, line: 784, baseType: !601)
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_TIME_CAPABILITIES", file: !34, line: 761, size: 96, elements: !602)
!602 = !{!603, !604, !605}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "Resolution", scope: !601, file: !34, line: 768, baseType: !104, size: 32)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "Accuracy", scope: !601, file: !34, line: 775, baseType: !104, size: 32, offset: 32)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "SetsToZero", scope: !601, file: !34, line: 783, baseType: !76, size: 8, offset: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "SetTime", scope: !574, file: !34, line: 1823, baseType: !607, size: 64, offset: 256)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SET_TIME", file: !34, line: 818, baseType: !608)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DISubroutineType(types: !610)
!610 = !{!157, !582}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "GetWakeupTime", scope: !574, file: !34, line: 1824, baseType: !612, size: 64, offset: 320)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GET_WAKEUP_TIME", file: !34, line: 839, baseType: !613)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DISubroutineType(types: !615)
!615 = !{!157, !616, !616, !582}
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "SetWakeupTime", scope: !574, file: !34, line: 1825, baseType: !618, size: 64, offset: 384)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SET_WAKEUP_TIME", file: !34, line: 861, baseType: !619)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DISubroutineType(types: !621)
!621 = !{!157, !76, !582}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "SetVirtualAddressMap", scope: !574, file: !34, line: 1830, baseType: !623, size: 64, offset: 448)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SET_VIRTUAL_ADDRESS_MAP", file: !34, line: 312, baseType: !624)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DISubroutineType(types: !626)
!626 = !{!157, !81, !81, !104, !627}
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MEMORY_DESCRIPTOR", file: !34, line: 160, baseType: !629)
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_MEMORY_DESCRIPTOR", file: !34, line: 128, size: 320, elements: !630)
!630 = !{!631, !632, !633, !635, !636}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !629, file: !34, line: 134, baseType: !104, size: 32)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "PhysicalStart", scope: !629, file: !34, line: 140, baseType: !135, size: 64, offset: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "VirtualStart", scope: !629, file: !34, line: 146, baseType: !634, size: 64, offset: 128)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_VIRTUAL_ADDRESS", file: !99, line: 55, baseType: !82)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "NumberOfPages", scope: !629, file: !34, line: 153, baseType: !82, size: 64, offset: 192)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "Attribute", scope: !629, file: !34, line: 159, baseType: !82, size: 64, offset: 256)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "ConvertPointer", scope: !574, file: !34, line: 1831, baseType: !638, size: 64, offset: 512)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CONVERT_POINTER", file: !34, line: 407, baseType: !639)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DISubroutineType(types: !641)
!641 = !{!157, !81, !87}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "GetVariable", scope: !574, file: !34, line: 1836, baseType: !643, size: 64, offset: 576)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GET_VARIABLE", file: !34, line: 671, baseType: !644)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = !DISubroutineType(types: !646)
!646 = !{!157, !184, !258, !424, !165, !75}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "GetNextVariableName", scope: !574, file: !34, line: 1837, baseType: !648, size: 64, offset: 640)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GET_NEXT_VARIABLE_NAME", file: !34, line: 707, baseType: !649)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = !DISubroutineType(types: !651)
!651 = !{!157, !165, !184, !258}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "SetVariable", scope: !574, file: !34, line: 1838, baseType: !653, size: 64, offset: 704)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SET_VARIABLE", file: !34, line: 749, baseType: !654)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DISubroutineType(types: !656)
!656 = !{!157, !184, !258, !104, !81, !75}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "GetNextHighMonotonicCount", scope: !574, file: !34, line: 1843, baseType: !658, size: 64, offset: 768)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GET_NEXT_HIGH_MONO_COUNT", file: !34, line: 1082, baseType: !659)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = !DISubroutineType(types: !661)
!661 = !{!157, !424}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "ResetSystem", scope: !574, file: !34, line: 1844, baseType: !663, size: 64, offset: 832)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_RESET_SYSTEM", file: !34, line: 1047, baseType: !664)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!665 = !DISubroutineType(types: !666)
!666 = !{null, !667, !157, !81, !75}
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_RESET_TYPE", file: !14, line: 145, baseType: !63)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "UpdateCapsule", scope: !574, file: !34, line: 1849, baseType: !669, size: 64, offset: 896)
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_UPDATE_CAPSULE", file: !34, line: 1708, baseType: !670)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DISubroutineType(types: !672)
!672 = !{!157, !673, !81, !135}
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CAPSULE_HEADER", file: !34, line: 1654, baseType: !676)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_CAPSULE_HEADER", file: !34, line: 1633, size: 224, elements: !677)
!677 = !{!678, !679, !680, !681}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "CapsuleGuid", scope: !676, file: !34, line: 1637, baseType: !98, size: 128)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "HeaderSize", scope: !676, file: !34, line: 1643, baseType: !104, size: 32, offset: 128)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !676, file: !34, line: 1649, baseType: !104, size: 32, offset: 160)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "CapsuleImageSize", scope: !676, file: !34, line: 1653, baseType: !104, size: 32, offset: 192)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "QueryCapsuleCapabilities", scope: !574, file: !34, line: 1850, baseType: !683, size: 64, offset: 960)
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_QUERY_CAPSULE_CAPABILITIES", file: !34, line: 1739, baseType: !684)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DISubroutineType(types: !686)
!686 = !{!157, !673, !81, !687, !688}
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "QueryVariableInfo", scope: !574, file: !34, line: 1855, baseType: !690, size: 64, offset: 1024)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_QUERY_VARIABLE_INFO", file: !34, line: 1770, baseType: !691)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DISubroutineType(types: !693)
!693 = !{!157, !104, !687, !687, !687}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "BootServices", scope: !484, file: !34, line: 2028, baseType: !695, size: 64, offset: 768)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_BOOT_SERVICES", file: !34, line: 1957, baseType: !697)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_BOOT_SERVICES", file: !34, line: 1864, size: 3008, elements: !698)
!698 = !{!699, !700, !706, !711, !712, !713, !718, !719, !720, !730, !736, !741, !746, !748, !750, !751, !756, !757, !758, !759, !764, !765, !771, !776, !781, !787, !792, !794, !799, !804, !809, !814, !819, !824, !829, !834, !848, !855, !861, !862, !867, !872, !877, !882, !887}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "Hdr", scope: !697, file: !34, line: 1868, baseType: !175, size: 192)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "RaiseTPL", scope: !697, file: !34, line: 1873, baseType: !701, size: 64, offset: 192)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_RAISE_TPL", file: !34, line: 629, baseType: !702)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = !DISubroutineType(types: !704)
!704 = !{!705, !705}
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TPL", file: !99, line: 41, baseType: !81)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "RestoreTPL", scope: !697, file: !34, line: 1874, baseType: !707, size: 64, offset: 256)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_RESTORE_TPL", file: !34, line: 641, baseType: !708)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DISubroutineType(types: !710)
!710 = !{null, !705}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "AllocatePages", scope: !697, file: !34, line: 1879, baseType: !228, size: 64, offset: 320)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "FreePages", scope: !697, file: !34, line: 1880, baseType: !235, size: 64, offset: 384)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "GetMemoryMap", scope: !697, file: !34, line: 1881, baseType: !714, size: 64, offset: 448)
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GET_MEMORY_MAP", file: !34, line: 241, baseType: !715)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DISubroutineType(types: !717)
!717 = !{!157, !165, !627, !165, !165, !424}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "AllocatePool", scope: !697, file: !34, line: 1882, baseType: !217, size: 64, offset: 512)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "FreePool", scope: !697, file: !34, line: 1883, baseType: !223, size: 64, offset: 576)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "CreateEvent", scope: !697, file: !34, line: 1888, baseType: !721, size: 64, offset: 640)
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CREATE_EVENT", file: !34, line: 465, baseType: !722)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = !DISubroutineType(types: !724)
!724 = !{!157, !104, !705, !725, !75, !729}
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_EVENT_NOTIFY", file: !34, line: 442, baseType: !726)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DISubroutineType(types: !728)
!728 = !{null, !513, !75}
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "SetTimer", scope: !697, file: !34, line: 1889, baseType: !731, size: 64, offset: 704)
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SET_TIMER", file: !34, line: 539, baseType: !732)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = !DISubroutineType(types: !734)
!734 = !{!157, !513, !735, !82}
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TIMER_DELAY", file: !34, line: 519, baseType: !69)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "WaitForEvent", scope: !697, file: !34, line: 1890, baseType: !737, size: 64, offset: 768)
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_WAIT_FOR_EVENT", file: !34, line: 575, baseType: !738)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DISubroutineType(types: !740)
!740 = !{!157, !81, !729, !165}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "SignalEvent", scope: !697, file: !34, line: 1891, baseType: !742, size: 64, offset: 832)
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIGNAL_EVENT", file: !34, line: 555, baseType: !743)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DISubroutineType(types: !745)
!745 = !{!157, !513}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "CloseEvent", scope: !697, file: !34, line: 1892, baseType: !747, size: 64, offset: 896)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CLOSE_EVENT", file: !34, line: 591, baseType: !743)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "CheckEvent", scope: !697, file: !34, line: 1893, baseType: !749, size: 64, offset: 960)
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CHECK_EVENT", file: !34, line: 607, baseType: !743)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "InstallProtocolInterface", scope: !697, file: !34, line: 1898, baseType: !253, size: 64, offset: 1024)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "ReinstallProtocolInterface", scope: !697, file: !34, line: 1899, baseType: !752, size: 64, offset: 1088)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_REINSTALL_PROTOCOL_INTERFACE", file: !34, line: 1223, baseType: !753)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DISubroutineType(types: !755)
!755 = !{!157, !125, !258, !75, !75}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "UninstallProtocolInterface", scope: !697, file: !34, line: 1900, baseType: !261, size: 64, offset: 1152)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "HandleProtocol", scope: !697, file: !34, line: 1901, baseType: !266, size: 64, offset: 1216)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved", scope: !697, file: !34, line: 1902, baseType: !75, size: 64, offset: 1280)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "RegisterProtocolNotify", scope: !697, file: !34, line: 1903, baseType: !760, size: 64, offset: 1344)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_REGISTER_PROTOCOL_NOTIFY", file: !34, line: 1451, baseType: !761)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DISubroutineType(types: !763)
!763 = !{!157, !258, !513, !87}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "LocateHandle", scope: !697, file: !34, line: 1904, baseType: !281, size: 64, offset: 1408)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "LocateDevicePath", scope: !697, file: !34, line: 1905, baseType: !766, size: 64, offset: 1472)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_LOCATE_DEVICE_PATH", file: !34, line: 1526, baseType: !767)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DISubroutineType(types: !769)
!769 = !{!157, !258, !770, !257}
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "InstallConfigurationTable", scope: !697, file: !34, line: 1906, baseType: !772, size: 64, offset: 1536)
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_INSTALL_CONFIGURATION_TABLE", file: !34, line: 1547, baseType: !773)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DISubroutineType(types: !775)
!775 = !{!157, !258, !75}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "LoadImage", scope: !697, file: !34, line: 1911, baseType: !777, size: 64, offset: 1600)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IMAGE_LOAD", file: !34, line: 898, baseType: !778)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DISubroutineType(types: !780)
!780 = !{!157, !76, !125, !385, !75, !81, !257}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "StartImage", scope: !697, file: !34, line: 1912, baseType: !782, size: 64, offset: 1664)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IMAGE_START", file: !34, line: 923, baseType: !783)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = !DISubroutineType(types: !785)
!785 = !{!157, !125, !165, !786}
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "Exit", scope: !697, file: !34, line: 1913, baseType: !788, size: 64, offset: 1728)
!788 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_EXIT", file: !34, line: 951, baseType: !789)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = !DISubroutineType(types: !791)
!791 = !{!157, !125, !157, !81, !184}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "UnloadImage", scope: !697, file: !34, line: 1914, baseType: !793, size: 64, offset: 1792)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IMAGE_UNLOAD", file: !34, line: 969, baseType: !312)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "ExitBootServices", scope: !697, file: !34, line: 1915, baseType: !795, size: 64, offset: 1856)
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_EXIT_BOOT_SERVICES", file: !34, line: 985, baseType: !796)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = !DISubroutineType(types: !798)
!798 = !{!157, !125, !81}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "GetNextMonotonicCount", scope: !697, file: !34, line: 1920, baseType: !800, size: 64, offset: 1920)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GET_NEXT_MONOTONIC_COUNT", file: !34, line: 1066, baseType: !801)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = !DISubroutineType(types: !803)
!803 = !{!157, !687}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "Stall", scope: !697, file: !34, line: 1921, baseType: !805, size: 64, offset: 1984)
!805 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_STALL", file: !34, line: 1001, baseType: !806)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DISubroutineType(types: !808)
!808 = !{!157, !81}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "SetWatchdogTimer", scope: !697, file: !34, line: 1922, baseType: !810, size: 64, offset: 2048)
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SET_WATCHDOG_TIMER", file: !34, line: 1023, baseType: !811)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = !DISubroutineType(types: !813)
!813 = !{!157, !81, !82, !81, !184}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "ConnectController", scope: !697, file: !34, line: 1927, baseType: !815, size: 64, offset: 2112)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CONNECT_CONTROLLER", file: !34, line: 346, baseType: !816)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = !DISubroutineType(types: !818)
!818 = !{!157, !125, !257, !385, !76}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "DisconnectController", scope: !697, file: !34, line: 1928, baseType: !820, size: 64, offset: 2176)
!820 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DISCONNECT_CONTROLLER", file: !34, line: 379, baseType: !821)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DISubroutineType(types: !823)
!823 = !{!157, !125, !125, !125}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "OpenProtocol", scope: !697, file: !34, line: 1933, baseType: !825, size: 64, offset: 2240)
!825 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_OPEN_PROTOCOL", file: !34, line: 1332, baseType: !826)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DISubroutineType(types: !828)
!828 = !{!157, !125, !258, !87, !125, !125, !104}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "CloseProtocol", scope: !697, file: !34, line: 1934, baseType: !830, size: 64, offset: 2304)
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CLOSE_PROTOCOL", file: !34, line: 1364, baseType: !831)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!832 = !DISubroutineType(types: !833)
!833 = !{!157, !125, !258, !125, !125}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "OpenProtocolInformation", scope: !697, file: !34, line: 1935, baseType: !835, size: 64, offset: 2368)
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_OPEN_PROTOCOL_INFORMATION", file: !34, line: 1398, baseType: !836)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = !DISubroutineType(types: !838)
!838 = !{!157, !125, !258, !839, !165}
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_OPEN_PROTOCOL_INFORMATION_ENTRY", file: !34, line: 1379, baseType: !842)
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_OPEN_PROTOCOL_INFORMATION_ENTRY", file: !34, line: 1374, size: 192, elements: !843)
!843 = !{!844, !845, !846, !847}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "AgentHandle", scope: !842, file: !34, line: 1375, baseType: !125, size: 64)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "ControllerHandle", scope: !842, file: !34, line: 1376, baseType: !125, size: 64, offset: 64)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "Attributes", scope: !842, file: !34, line: 1377, baseType: !104, size: 32, offset: 128)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "OpenCount", scope: !842, file: !34, line: 1378, baseType: !104, size: 32, offset: 160)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "ProtocolsPerHandle", scope: !697, file: !34, line: 1940, baseType: !849, size: 64, offset: 2432)
!849 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_PROTOCOLS_PER_HANDLE", file: !34, line: 1428, baseType: !850)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DISubroutineType(types: !852)
!852 = !{!157, !125, !853, !165}
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "LocateHandleBuffer", scope: !697, file: !34, line: 1941, baseType: !856, size: 64, offset: 2496)
!856 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_LOCATE_HANDLE_BUFFER", file: !34, line: 1573, baseType: !857)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = !DISubroutineType(types: !859)
!859 = !{!157, !285, !258, !75, !165, !860}
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "LocateProtocol", scope: !697, file: !34, line: 1942, baseType: !287, size: 64, offset: 2560)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "InstallMultipleProtocolInterfaces", scope: !697, file: !34, line: 1943, baseType: !863, size: 64, offset: 2624)
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_INSTALL_MULTIPLE_PROTOCOL_INTERFACES", file: !34, line: 1198, baseType: !864)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = !DISubroutineType(types: !866)
!866 = !{!157, !257, null}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "UninstallMultipleProtocolInterfaces", scope: !697, file: !34, line: 1944, baseType: !868, size: 64, offset: 2688)
!868 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_UNINSTALL_MULTIPLE_PROTOCOL_INTERFACES", file: !34, line: 1268, baseType: !869)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!870 = !DISubroutineType(types: !871)
!871 = !{!157, !125, null}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "CalculateCrc32", scope: !697, file: !34, line: 1949, baseType: !873, size: 64, offset: 2752)
!873 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CALCULATE_CRC32", file: !34, line: 1103, baseType: !874)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!875 = !DISubroutineType(types: !876)
!876 = !{!157, !75, !81, !424}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "CopyMem", scope: !697, file: !34, line: 1954, baseType: !878, size: 64, offset: 2816)
!878 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_COPY_MEM", file: !34, line: 1119, baseType: !879)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!880 = !DISubroutineType(types: !881)
!881 = !{null, !75, !75, !81}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "SetMem", scope: !697, file: !34, line: 1955, baseType: !883, size: 64, offset: 2880)
!883 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SET_MEM", file: !34, line: 1135, baseType: !884)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!885 = !DISubroutineType(types: !886)
!886 = !{null, !75, !81, !89}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "CreateEventEx", scope: !697, file: !34, line: 1956, baseType: !888, size: 64, offset: 2944)
!888 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CREATE_EVENT_EX", file: !34, line: 494, baseType: !889)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64)
!890 = !DISubroutineType(types: !891)
!891 = !{!157, !104, !705, !725, !297, !194, !729}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "NumberOfTableEntries", scope: !484, file: !34, line: 2032, baseType: !81, size: 64, offset: 832)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "ConfigurationTable", scope: !484, file: !34, line: 2037, baseType: !246, size: 64, offset: 896)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "DeviceHandle", scope: !477, file: !476, line: 53, baseType: !125, size: 64, offset: 192)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "FilePath", scope: !477, file: !476, line: 54, baseType: !385, size: 64, offset: 256)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved", scope: !477, file: !476, line: 56, baseType: !75, size: 64, offset: 320)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "LoadOptionsSize", scope: !477, file: !476, line: 61, baseType: !104, size: 32, offset: 384)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "LoadOptions", scope: !477, file: !476, line: 62, baseType: !75, size: 64, offset: 448)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "ImageBase", scope: !477, file: !476, line: 67, baseType: !75, size: 64, offset: 512)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "ImageSize", scope: !477, file: !476, line: 68, baseType: !82, size: 64, offset: 576)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "ImageCodeType", scope: !477, file: !476, line: 69, baseType: !221, size: 32, offset: 640)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "ImageDataType", scope: !477, file: !476, line: 70, baseType: !221, size: 32, offset: 672)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "Unload", scope: !477, file: !476, line: 71, baseType: !793, size: 64, offset: 704)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "ImageEntryPoint", scope: !371, file: !333, line: 131, baseType: !905, size: 64, offset: 1088)
!905 = !DIDerivedType(tag: DW_TAG_typedef, name: "PHYSICAL_ADDRESS", file: !80, line: 237, baseType: !82)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "ImageBuffer", scope: !371, file: !333, line: 135, baseType: !905, size: 64, offset: 1152)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "NumberOfPage", scope: !371, file: !333, line: 139, baseType: !81, size: 64, offset: 1216)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "SmmImageHandle", scope: !371, file: !333, line: 140, baseType: !125, size: 64, offset: 1280)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "SmmLoadedImage", scope: !371, file: !333, line: 141, baseType: !475, size: 768, offset: 1344)
!910 = !DIGlobalVariableExpression(var: !911, expr: !DIExpression())
!911 = distinct !DIGlobalVariable(name: "mSmmCoreLoadedImage", scope: !2, file: !324, line: 107, type: !474, isLocal: false, isDefinition: true)
!912 = !{i32 2, !"CodeView", i32 1}
!913 = !{i32 2, !"Debug Info Version", i32 3}
!914 = !{i32 1, !"wchar_size", i32 2}
!915 = !{i32 7, !"PIC Level", i32 2}
!916 = !{i32 1, !"Code Model", i32 1}
!917 = !{i32 7, !"uwtable", i32 1}
!918 = !{i32 1, !"ThinLTO", i32 0}
!919 = !{i32 1, !"EnableSplitLTOUnit", i32 1}
!920 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!921 = distinct !DISubprogram(name: "SmmEfiNotAvailableYetArg5", scope: !324, file: !324, line: 125, type: !922, scopeLine: 132, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !924)
!922 = !DISubroutineType(types: !923)
!923 = !{!157, !81, !81, !81, !81, !81}
!924 = !{}
!925 = !DILocalVariable(name: "Arg1", arg: 1, scope: !921, file: !324, line: 126, type: !81)
!926 = !DILocation(line: 126, scope: !921)
!927 = !DILocalVariable(name: "Arg2", arg: 2, scope: !921, file: !324, line: 127, type: !81)
!928 = !DILocation(line: 127, scope: !921)
!929 = !DILocalVariable(name: "Arg3", arg: 3, scope: !921, file: !324, line: 128, type: !81)
!930 = !DILocation(line: 128, scope: !921)
!931 = !DILocalVariable(name: "Arg4", arg: 4, scope: !921, file: !324, line: 129, type: !81)
!932 = !DILocation(line: 129, scope: !921)
!933 = !DILocalVariable(name: "Arg5", arg: 5, scope: !921, file: !324, line: 130, type: !81)
!934 = !DILocation(line: 130, scope: !921)
!935 = !DILocation(line: 137, scope: !921)
!936 = distinct !DISubprogram(name: "SmmReadyToLockHandler", scope: !324, file: !324, line: 346, type: !307, scopeLine: 352, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !924)
!937 = !DILocalVariable(name: "DispatchHandle", arg: 1, scope: !936, file: !324, line: 347, type: !125)
!938 = !DILocation(line: 347, scope: !936)
!939 = !DILocalVariable(name: "Context", arg: 2, scope: !936, file: !324, line: 348, type: !297)
!940 = !DILocation(line: 348, scope: !936)
!941 = !DILocalVariable(name: "CommBuffer", arg: 3, scope: !936, file: !324, line: 349, type: !75)
!942 = !DILocation(line: 349, scope: !936)
!943 = !DILocalVariable(name: "CommBufferSize", arg: 4, scope: !936, file: !324, line: 350, type: !165)
!944 = !DILocation(line: 350, scope: !936)
!945 = !DILocalVariable(name: "Status", scope: !936, file: !324, line: 353, type: !157)
!946 = !DILocation(line: 353, scope: !936)
!947 = !DILocalVariable(name: "Index", scope: !936, file: !324, line: 354, type: !81)
!948 = !DILocation(line: 354, scope: !936)
!949 = !DILocalVariable(name: "SmmHandle", scope: !936, file: !324, line: 355, type: !125)
!950 = !DILocation(line: 355, scope: !936)
!951 = !DILocalVariable(name: "Interface", scope: !936, file: !324, line: 356, type: !75)
!952 = !DILocation(line: 356, scope: !936)
!953 = !DILocation(line: 358, scope: !936)
!954 = !DILocation(line: 358, scope: !955)
!955 = distinct !DILexicalBlock(scope: !936, file: !324, line: 358)
!956 = !DILocation(line: 358, scope: !957)
!957 = distinct !DILexicalBlock(scope: !958, file: !324, line: 358)
!958 = distinct !DILexicalBlock(scope: !955, file: !324, line: 358)
!959 = !DILocation(line: 363, scope: !960)
!960 = distinct !DILexicalBlock(scope: !936, file: !324, line: 363)
!961 = !DILocation(line: 364, scope: !962)
!962 = distinct !DILexicalBlock(scope: !963, file: !324, line: 363)
!963 = distinct !DILexicalBlock(scope: !960, file: !324, line: 363)
!964 = !DILocation(line: 365, scope: !965)
!965 = distinct !DILexicalBlock(scope: !966, file: !324, line: 364)
!966 = distinct !DILexicalBlock(scope: !962, file: !324, line: 364)
!967 = !DILocation(line: 366, scope: !965)
!968 = !DILocation(line: 367, scope: !962)
!969 = !DILocation(line: 363, scope: !963)
!970 = distinct !{!970, !959, !971, !972}
!971 = !DILocation(line: 367, scope: !960)
!972 = !{!"llvm.loop.mustprogress"}
!973 = !DILocation(line: 372, scope: !936)
!974 = !DILocation(line: 373, scope: !936)
!975 = !DILocation(line: 383, scope: !936)
!976 = !DILocation(line: 388, scope: !936)
!977 = !DILocation(line: 388, scope: !978)
!978 = distinct !DILexicalBlock(scope: !936, file: !324, line: 388)
!979 = !DILocalVariable(name: "__DebugCodeLocal", scope: !980, file: !324, line: 388, type: !89)
!980 = distinct !DILexicalBlock(scope: !981, file: !324, line: 388)
!981 = distinct !DILexicalBlock(scope: !978, file: !324, line: 388)
!982 = !DILocation(line: 388, scope: !980)
!983 = !DILocation(line: 389, scope: !980)
!984 = !DILocation(line: 390, scope: !985)
!985 = distinct !DILexicalBlock(scope: !986, file: !324, line: 389)
!986 = distinct !DILexicalBlock(scope: !980, file: !324, line: 389)
!987 = !DILocation(line: 390, scope: !988)
!988 = distinct !DILexicalBlock(scope: !985, file: !324, line: 390)
!989 = !DILocation(line: 390, scope: !990)
!990 = distinct !DILexicalBlock(scope: !991, file: !324, line: 390)
!991 = distinct !DILexicalBlock(scope: !988, file: !324, line: 390)
!992 = !DILocation(line: 390, scope: !993)
!993 = distinct !DILexicalBlock(scope: !990, file: !324, line: 390)
!994 = !DILocation(line: 390, scope: !995)
!995 = distinct !DILexicalBlock(scope: !996, file: !324, line: 390)
!996 = distinct !DILexicalBlock(scope: !993, file: !324, line: 390)
!997 = !DILocation(line: 391, scope: !985)
!998 = !DILocation(line: 393, scope: !980)
!999 = !DILocation(line: 393, scope: !978)
!1000 = !DILocation(line: 398, scope: !936)
!1001 = !DILocation(line: 398, scope: !1002)
!1002 = distinct !DILexicalBlock(scope: !936, file: !324, line: 398)
!1003 = !DILocation(line: 398, scope: !1004)
!1004 = distinct !DILexicalBlock(scope: !1005, file: !324, line: 398)
!1005 = distinct !DILexicalBlock(scope: !1002, file: !324, line: 398)
!1006 = !DILocation(line: 398, scope: !1007)
!1007 = distinct !DILexicalBlock(scope: !1008, file: !324, line: 398)
!1008 = distinct !DILexicalBlock(scope: !1004, file: !324, line: 398)
!1009 = !DILocation(line: 398, scope: !1010)
!1010 = distinct !DILexicalBlock(scope: !1007, file: !324, line: 398)
!1011 = !DILocation(line: 398, scope: !1012)
!1012 = distinct !DILexicalBlock(scope: !1013, file: !324, line: 398)
!1013 = distinct !DILexicalBlock(scope: !1010, file: !324, line: 398)
!1014 = !DILocation(line: 398, scope: !1015)
!1015 = distinct !DILexicalBlock(scope: !1012, file: !324, line: 398)
!1016 = !DILocation(line: 398, scope: !1017)
!1017 = distinct !DILexicalBlock(scope: !1018, file: !324, line: 398)
!1018 = distinct !DILexicalBlock(scope: !1015, file: !324, line: 398)
!1019 = !DILocation(line: 404, scope: !936)
!1020 = !DILocation(line: 404, scope: !1021)
!1021 = distinct !DILexicalBlock(scope: !936, file: !324, line: 404)
!1022 = !DILocalVariable(name: "__DebugCodeLocal", scope: !1023, file: !324, line: 404, type: !89)
!1023 = distinct !DILexicalBlock(scope: !1024, file: !324, line: 404)
!1024 = distinct !DILexicalBlock(scope: !1021, file: !324, line: 404)
!1025 = !DILocation(line: 404, scope: !1023)
!1026 = !DILocation(line: 405, scope: !1023)
!1027 = !DILocation(line: 406, scope: !1023)
!1028 = !DILocation(line: 406, scope: !1021)
!1029 = !DILocation(line: 411, scope: !936)
!1030 = !DILocation(line: 412, scope: !936)
!1031 = !DILocation(line: 414, scope: !936)
!1032 = !DILocation(line: 416, scope: !936)
!1033 = !DILocation(line: 416, scope: !1034)
!1034 = distinct !DILexicalBlock(scope: !936, file: !324, line: 416)
!1035 = !DILocation(line: 416, scope: !1036)
!1036 = distinct !DILexicalBlock(scope: !1037, file: !324, line: 416)
!1037 = distinct !DILexicalBlock(scope: !1034, file: !324, line: 416)
!1038 = !DILocation(line: 417, scope: !936)
!1039 = distinct !DISubprogram(name: "SmmLegacyBootHandler", scope: !324, file: !324, line: 159, type: !307, scopeLine: 165, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !924)
!1040 = !DILocalVariable(name: "DispatchHandle", arg: 1, scope: !1039, file: !324, line: 160, type: !125)
!1041 = !DILocation(line: 160, scope: !1039)
!1042 = !DILocalVariable(name: "Context", arg: 2, scope: !1039, file: !324, line: 161, type: !297)
!1043 = !DILocation(line: 161, scope: !1039)
!1044 = !DILocalVariable(name: "CommBuffer", arg: 3, scope: !1039, file: !324, line: 162, type: !75)
!1045 = !DILocation(line: 162, scope: !1039)
!1046 = !DILocalVariable(name: "CommBufferSize", arg: 4, scope: !1039, file: !324, line: 163, type: !165)
!1047 = !DILocation(line: 163, scope: !1039)
!1048 = !DILocalVariable(name: "Status", scope: !1039, file: !324, line: 166, type: !157)
!1049 = !DILocation(line: 166, scope: !1039)
!1050 = !DILocalVariable(name: "SmmHandle", scope: !1039, file: !324, line: 167, type: !125)
!1051 = !DILocation(line: 167, scope: !1039)
!1052 = !DILocalVariable(name: "Index", scope: !1039, file: !324, line: 168, type: !81)
!1053 = !DILocation(line: 168, scope: !1039)
!1054 = !DILocation(line: 173, scope: !1039)
!1055 = !DILocation(line: 174, scope: !1039)
!1056 = !DILocation(line: 181, scope: !1039)
!1057 = !DILocation(line: 183, scope: !1039)
!1058 = !DILocation(line: 188, scope: !1059)
!1059 = distinct !DILexicalBlock(scope: !1039, file: !324, line: 188)
!1060 = !DILocation(line: 189, scope: !1061)
!1061 = distinct !DILexicalBlock(scope: !1062, file: !324, line: 188)
!1062 = distinct !DILexicalBlock(scope: !1059, file: !324, line: 188)
!1063 = !DILocation(line: 190, scope: !1064)
!1064 = distinct !DILexicalBlock(scope: !1065, file: !324, line: 189)
!1065 = distinct !DILexicalBlock(scope: !1061, file: !324, line: 189)
!1066 = !DILocation(line: 191, scope: !1064)
!1067 = !DILocation(line: 193, scope: !1061)
!1068 = !DILocation(line: 188, scope: !1062)
!1069 = distinct !{!1069, !1058, !1070, !972}
!1070 = !DILocation(line: 193, scope: !1059)
!1071 = !DILocation(line: 195, scope: !1039)
!1072 = distinct !DISubprogram(name: "SmmExitBootServicesHandler", scope: !324, file: !324, line: 214, type: !307, scopeLine: 220, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !924)
!1073 = !DILocalVariable(name: "DispatchHandle", arg: 1, scope: !1072, file: !324, line: 215, type: !125)
!1074 = !DILocation(line: 215, scope: !1072)
!1075 = !DILocalVariable(name: "Context", arg: 2, scope: !1072, file: !324, line: 216, type: !297)
!1076 = !DILocation(line: 216, scope: !1072)
!1077 = !DILocalVariable(name: "CommBuffer", arg: 3, scope: !1072, file: !324, line: 217, type: !75)
!1078 = !DILocation(line: 217, scope: !1072)
!1079 = !DILocalVariable(name: "CommBufferSize", arg: 4, scope: !1072, file: !324, line: 218, type: !165)
!1080 = !DILocation(line: 218, scope: !1072)
!1081 = !DILocalVariable(name: "Status", scope: !1072, file: !324, line: 221, type: !157)
!1082 = !DILocation(line: 221, scope: !1072)
!1083 = !DILocalVariable(name: "SmmHandle", scope: !1072, file: !324, line: 222, type: !125)
!1084 = !DILocation(line: 222, scope: !1072)
!1085 = !DILocalVariable(name: "Index", scope: !1072, file: !324, line: 223, type: !81)
!1086 = !DILocation(line: 223, scope: !1072)
!1087 = !DILocation(line: 228, scope: !1072)
!1088 = !DILocation(line: 229, scope: !1072)
!1089 = !DILocation(line: 236, scope: !1072)
!1090 = !DILocation(line: 241, scope: !1091)
!1091 = distinct !DILexicalBlock(scope: !1072, file: !324, line: 241)
!1092 = !DILocation(line: 242, scope: !1093)
!1093 = distinct !DILexicalBlock(scope: !1094, file: !324, line: 241)
!1094 = distinct !DILexicalBlock(scope: !1091, file: !324, line: 241)
!1095 = !DILocation(line: 243, scope: !1096)
!1096 = distinct !DILexicalBlock(scope: !1097, file: !324, line: 242)
!1097 = distinct !DILexicalBlock(scope: !1093, file: !324, line: 242)
!1098 = !DILocation(line: 244, scope: !1096)
!1099 = !DILocation(line: 246, scope: !1093)
!1100 = !DILocation(line: 241, scope: !1094)
!1101 = distinct !{!1101, !1090, !1102, !972}
!1102 = !DILocation(line: 246, scope: !1091)
!1103 = !DILocation(line: 248, scope: !1072)
!1104 = distinct !DISubprogram(name: "SmmReadyToBootHandler", scope: !324, file: !324, line: 298, type: !307, scopeLine: 304, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !924)
!1105 = !DILocalVariable(name: "DispatchHandle", arg: 1, scope: !1104, file: !324, line: 299, type: !125)
!1106 = !DILocation(line: 299, scope: !1104)
!1107 = !DILocalVariable(name: "Context", arg: 2, scope: !1104, file: !324, line: 300, type: !297)
!1108 = !DILocation(line: 300, scope: !1104)
!1109 = !DILocalVariable(name: "CommBuffer", arg: 3, scope: !1104, file: !324, line: 301, type: !75)
!1110 = !DILocation(line: 301, scope: !1104)
!1111 = !DILocalVariable(name: "CommBufferSize", arg: 4, scope: !1104, file: !324, line: 302, type: !165)
!1112 = !DILocation(line: 302, scope: !1104)
!1113 = !DILocalVariable(name: "Status", scope: !1104, file: !324, line: 305, type: !157)
!1114 = !DILocation(line: 305, scope: !1104)
!1115 = !DILocalVariable(name: "SmmHandle", scope: !1104, file: !324, line: 306, type: !125)
!1116 = !DILocation(line: 306, scope: !1104)
!1117 = !DILocation(line: 308, scope: !1104)
!1118 = !DILocation(line: 308, scope: !1119)
!1119 = distinct !DILexicalBlock(scope: !1104, file: !324, line: 308)
!1120 = !DILocation(line: 308, scope: !1121)
!1121 = distinct !DILexicalBlock(scope: !1122, file: !324, line: 308)
!1122 = distinct !DILexicalBlock(scope: !1119, file: !324, line: 308)
!1123 = !DILocation(line: 313, scope: !1104)
!1124 = !DILocation(line: 314, scope: !1104)
!1125 = !DILocation(line: 321, scope: !1104)
!1126 = !DILocation(line: 323, scope: !1104)
!1127 = !DILocation(line: 323, scope: !1128)
!1128 = distinct !DILexicalBlock(scope: !1104, file: !324, line: 323)
!1129 = !DILocation(line: 323, scope: !1130)
!1130 = distinct !DILexicalBlock(scope: !1131, file: !324, line: 323)
!1131 = distinct !DILexicalBlock(scope: !1128, file: !324, line: 323)
!1132 = !DILocation(line: 324, scope: !1104)
!1133 = distinct !DISubprogram(name: "SmmEndOfDxeHandler", scope: !324, file: !324, line: 436, type: !307, scopeLine: 442, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !924)
!1134 = !DILocalVariable(name: "DispatchHandle", arg: 1, scope: !1133, file: !324, line: 437, type: !125)
!1135 = !DILocation(line: 437, scope: !1133)
