; ModuleID = './bcfiles/PxeBcDhcp4.bc'
source_filename = "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main/NetworkPkg/UefiPxeBcDxe/PxeBcDhcp4.c"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-windows-gnu"

%struct.IPv4_ADDRESS = type { [4 x i8] }
%struct.EFI_DHCP4_PACKET_OPTION = type { i8, i8, [1 x i8] }
%struct.PXEBC_VENDOR_OPTION = type { [8 x i32], %struct.IPv4_ADDRESS, i16, i16, i8, i8, i8, %struct.IPv4_ADDRESS, %struct.IPv4_ADDRESS, i16, i16, i16, i16, %struct.PXEBC_BOOT_SVR_ENTRY*, i8, %struct.PXEBC_BOOT_MENU_ENTRY*, i8, %struct.PXEBC_MENU_PROMPT*, i8, i32*, i8, %struct.PXEBC_BOOT_CUSTOM* }
%struct.PXEBC_BOOT_SVR_ENTRY = type <{ i16, i8, [1 x %struct.IPv4_ADDRESS] }>
%struct.PXEBC_BOOT_MENU_ENTRY = type { i16, i8, [1 x i8] }
%struct.PXEBC_MENU_PROMPT = type { i8, [1 x i8] }
%struct.PXEBC_BOOT_CUSTOM = type <{ i8, %struct.NETWORK_OBJECT*, i32, i64, %struct.NETWORK_DETAILS }>
%struct.NETWORK_OBJECT = type { %struct.NETWORK_OBJECT_HEADER, %struct.NETWORK_OBJECT_BODY }
%struct.NETWORK_OBJECT_HEADER = type { i64 }
%struct.NETWORK_OBJECT_BODY = type { i64, i16* }
%struct.NETWORK_DETAILS = type { %struct.EFI_MAC_ADDRESS, i16 }
%struct.EFI_MAC_ADDRESS = type { [32 x i8] }
%struct.GUID = type { i32, i16, i16, [8 x i8] }

!67 = !DIEnumerator(name: "Dhcp6Confirming", value: 4)
!68 = !DIEnumerator(name: "Dhcp6Releasing", value: 5)
!69 = !DIEnumerator(name: "Dhcp6Bound", value: 6)
!70 = !DIEnumerator(name: "Dhcp6Renewing", value: 7)
!71 = !DIEnumerator(name: "Dhcp6Rebinding", value: 8)
!72 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !61, line: 76, baseType: !7, size: 32, elements: !73)
!73 = !{!74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84}
!74 = !DIEnumerator(name: "Dhcp6SendSolicit", value: 0)
!75 = !DIEnumerator(name: "Dhcp6RcvdAdvertise", value: 1)
!76 = !DIEnumerator(name: "Dhcp6SelectAdvertise", value: 2)
!77 = !DIEnumerator(name: "Dhcp6SendRequest", value: 3)
!78 = !DIEnumerator(name: "Dhcp6RcvdReply", value: 4)
!79 = !DIEnumerator(name: "Dhcp6RcvdReconfigure", value: 5)
!80 = !DIEnumerator(name: "Dhcp6SendDecline", value: 6)
!81 = !DIEnumerator(name: "Dhcp6SendConfirm", value: 7)
!82 = !DIEnumerator(name: "Dhcp6SendRelease", value: 8)
!83 = !DIEnumerator(name: "Dhcp6EnterRenewing", value: 9)
!84 = !DIEnumerator(name: "Dhcp6EnterRebinding", value: 10)
!85 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !86, line: 192, baseType: !7, size: 32, elements: !87)
!86 = !DIFile(filename: "MdePkg/Include/Protocol/PxeBaseCode.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "5c81517a25a11d0772fd25cf3f99822b")
!87 = !{!88, !89, !90, !91, !92, !93, !94, !95, !96}
!88 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_TFTP_FIRST", value: 0)
!89 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_TFTP_GET_FILE_SIZE", value: 1)
!90 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_TFTP_READ_FILE", value: 2)
!91 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_TFTP_WRITE_FILE", value: 3)
!92 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_TFTP_READ_DIRECTORY", value: 4)
!93 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_MTFTP_GET_FILE_SIZE", value: 5)
!94 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_MTFTP_READ_FILE", value: 6)
!95 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_MTFTP_READ_DIRECTORY", value: 7)
!96 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_MTFTP_LAST", value: 8)
!97 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !98, line: 63, baseType: !7, size: 32, elements: !99)
!98 = !DIFile(filename: "MdePkg/Include/Protocol/PxeBaseCodeCallBack.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "620f8d98f32292d4cb970381b3122ad5")
!99 = !{!100, !101, !102, !103}
!100 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_CALLBACK_STATUS_FIRST", value: 0)
!101 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_CALLBACK_STATUS_CONTINUE", value: 1)
!102 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_CALLBACK_STATUS_ABORT", value: 2)
!103 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_CALLBACK_STATUS_LAST", value: 3)
!104 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !98, line: 48, baseType: !7, size: 32, elements: !105)
!105 = !{!106, !107, !108, !109, !110, !111, !112, !113, !114}
!106 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_FUNCTION_FIRST", value: 0)
!107 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_FUNCTION_DHCP", value: 1)
!108 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_FUNCTION_DISCOVER", value: 2)
!109 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_FUNCTION_MTFTP", value: 3)
!110 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_FUNCTION_UDP_WRITE", value: 4)
!111 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_FUNCTION_UDP_READ", value: 5)
!112 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_FUNCTION_ARP", value: 6)
!113 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_FUNCTION_IGMP", value: 7)
!114 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_PXE_FUNCTION_LAST", value: 8)
!115 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !116, line: 71, baseType: !7, size: 32, elements: !117)
!116 = !DIFile(filename: "NetworkPkg/UefiPxeBcDxe/PxeBcDhcp4.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "71d8c6a5b4dce053943495bbd9962c1e")
!117 = !{!118, !119, !120, !121, !122, !123, !124, !125, !126}
!118 = !DIEnumerator(name: "PxeOfferTypeDhcpOnly", value: 0)
!119 = !DIEnumerator(name: "PxeOfferTypeDhcpPxe10", value: 1)
!120 = !DIEnumerator(name: "PxeOfferTypeDhcpWfm11a", value: 2)
!121 = !DIEnumerator(name: "PxeOfferTypeDhcpBinl", value: 3)
!122 = !DIEnumerator(name: "PxeOfferTypeProxyPxe10", value: 4)
!123 = !DIEnumerator(name: "PxeOfferTypeProxyWfm11a", value: 5)
!124 = !DIEnumerator(name: "PxeOfferTypeProxyBinl", value: 6)
!125 = !DIEnumerator(name: "PxeOfferTypeBootp", value: 7)
!126 = !DIEnumerator(name: "PxeOfferTypeMax", value: 8)
!127 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 127, baseType: !7, size: 32, elements: !128)
!128 = !{!129, !130, !131}
!129 = !DIEnumerator(name: "Ip4Config2PolicyStatic", value: 0)
!130 = !DIEnumerator(name: "Ip4Config2PolicyDhcp", value: 1)
!131 = !DIEnumerator(name: "Ip4Config2PolicyMax", value: 2)
!132 = !{!133, !146, !147, !152, !153, !172, !179, !185, !187, !186, !138, !226, !231, !232, !237, !245, !254, !257, !269, !276, !281, !149, !302, !1979, !2225, !158, !796}
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP4_PACKET_OPTION", file: !16, line: 44, baseType: !135)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_DHCP4_PACKET_OPTION", file: !16, line: 31, size: 24, elements: !136)
!136 = !{!137, !141, !142}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "OpCode", scope: !135, file: !16, line: 35, baseType: !138, size: 8)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT8", file: !139, line: 196, baseType: !140)
!139 = !DIFile(filename: "MdePkg/Include/X64/ProcessorBind.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "ef2524a221fe61206fa09ec88dd4f59b")
!140 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !135, file: !16, line: 39, baseType: !138, size: 8, offset: 8)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !135, file: !16, line: 43, baseType: !143, size: 8, offset: 16)
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 8, elements: !144)
!144 = !{!145}
!145 = !DISubrange(count: 1)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "BOOLEAN", file: !139, line: 192, baseType: !140)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "RETURN_STATUS", file: !148, line: 1026, baseType: !149)
!148 = !DIFile(filename: "MdePkg/Include/Base.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "0c11ea3d1992443d8a8f590a064e50ff")
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINTN", file: !139, line: 211, baseType: !150)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT64", file: !139, line: 162, baseType: !151)
!151 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "PXEBC_BOOT_SVR_ENTRY", file: !116, line: 225, baseType: !155)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PXEBC_BOOT_SVR_ENTRY", file: !116, line: 221, size: 56, elements: !156)
!156 = !{!157, !160, !161}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !155, file: !116, line: 222, baseType: !158, size: 16)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT16", file: !139, line: 178, baseType: !159)
!159 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "IpCnt", scope: !155, file: !116, line: 223, baseType: !138, size: 8, offset: 16)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "IpAddr", scope: !155, file: !116, line: 224, baseType: !162, size: 32, offset: 24)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !163, size: 32, elements: !144)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IPv4_ADDRESS", file: !164, line: 85, baseType: !165)
!164 = !DIFile(filename: "MdePkg/Include/Uefi/UefiBaseType.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "dbec48e65949dff122bc920c9d9d9c6a")
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPv4_ADDRESS", file: !148, line: 225, baseType: !166)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IPv4_ADDRESS", file: !148, line: 223, size: 32, elements: !167)
!167 = !{!168}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "Addr", scope: !166, file: !148, line: 224, baseType: !169, size: 32)
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 32, elements: !170)
!170 = !{!171}
!171 = !DISubrange(count: 4)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "PXEBC_BOOT_MENU_ENTRY", file: !116, line: 231, baseType: !174)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PXEBC_BOOT_MENU_ENTRY", file: !116, line: 227, size: 32, elements: !175)
!175 = !{!176, !177, !178}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !174, file: !116, line: 228, baseType: !158, size: 16)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "DescLen", scope: !174, file: !116, line: 229, baseType: !138, size: 8, offset: 16)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "DescStr", scope: !174, file: !116, line: 230, baseType: !143, size: 8, offset: 24)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "PXEBC_MENU_PROMPT", file: !116, line: 236, baseType: !181)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PXEBC_MENU_PROMPT", file: !116, line: 233, size: 16, elements: !182)
!182 = !{!183, !184}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "Timeout", scope: !181, file: !116, line: 234, baseType: !138, size: 8)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "Prompt", scope: !181, file: !116, line: 235, baseType: !143, size: 8, offset: 8)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT32", file: !139, line: 170, baseType: !7)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "PXEBC_BOOT_CUSTOM", file: !116, line: 263, baseType: !189)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PXEBC_BOOT_CUSTOM", file: !116, line: 257, size: 440, elements: !190)
!190 = !{!191, !192, !210, !211, !213}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "ReplyRequested", scope: !189, file: !116, line: 258, baseType: !146, size: 8)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "ReplyObject", scope: !189, file: !116, line: 259, baseType: !193, size: 64, offset: 8)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "NETWORK_OBJECT", file: !116, line: 250, baseType: !195)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NETWORK_OBJECT", file: !116, line: 247, size: 192, elements: !196)
!196 = !{!197, !202}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "Header", scope: !195, file: !116, line: 248, baseType: !198, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "NETWORK_OBJECT_HEADER", file: !116, line: 240, baseType: !199)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NETWORK_OBJECT_HEADER", file: !116, line: 238, size: 64, elements: !200)
!200 = !{!201}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "ReferenceCount", scope: !199, file: !116, line: 239, baseType: !150, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "Body", scope: !195, file: !116, line: 249, baseType: !203, size: 128, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "NETWORK_OBJECT_BODY", file: !116, line: 245, baseType: !204)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NETWORK_OBJECT_BODY", file: !116, line: 242, size: 128, elements: !205)
!205 = !{!206, !207}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "ContentLength", scope: !204, file: !116, line: 243, baseType: !150, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "ContentData", scope: !204, file: !116, line: 244, baseType: !208, size: 64, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHAR16", file: !139, line: 183, baseType: !159)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "TransactionId", scope: !189, file: !116, line: 260, baseType: !186, size: 32, offset: 72)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "LastOperationStatus", scope: !189, file: !116, line: 261, baseType: !212, size: 64, offset: 104)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_STATUS", file: !164, line: 29, baseType: !147)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "NetworkInfo", scope: !189, file: !116, line: 262, baseType: !214, size: 272, offset: 168)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "NETWORK_DETAILS", file: !116, line: 255, baseType: !215)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NETWORK_DETAILS", file: !116, line: 252, size: 272, elements: !216)
!216 = !{!217, !225}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "MacAddress", scope: !215, file: !116, line: 253, baseType: !218, size: 256)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MAC_ADDRESS", file: !164, line: 97, baseType: !219)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_MAC_ADDRESS", file: !164, line: 95, size: 256, elements: !220)
!220 = !{!221}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "Addr", scope: !219, file: !164, line: 96, baseType: !222, size: 256)
!222 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 256, elements: !223)
!223 = !{!224}
!224 = !DISubrange(count: 32)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "Port", scope: !215, file: !116, line: 254, baseType: !158, size: 16, offset: 256)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "PXEBC_DHCP4_OPTION_MESG", file: !116, line: 181, baseType: !228)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PXEBC_DHCP4_OPTION_MESG", file: !116, line: 179, size: 8, elements: !229)
!229 = !{!230}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !228, file: !116, line: 180, baseType: !138, size: 8)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "PXEBC_DHCP4_OPTION_MAX_MESG_SIZE", file: !116, line: 171, baseType: !234)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PXEBC_DHCP4_OPTION_MAX_MESG_SIZE", file: !116, line: 169, size: 16, elements: !235)
!235 = !{!236}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !234, file: !116, line: 170, baseType: !158, size: 16)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "PXEBC_DHCP4_OPTION_PARA", file: !116, line: 167, baseType: !239)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PXEBC_DHCP4_OPTION_PARA", file: !116, line: 165, size: 1080, elements: !240)
!240 = !{!241}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "ParaList", scope: !239, file: !116, line: 166, baseType: !242, size: 1080)
!242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 1080, elements: !243)
!243 = !{!244}
!244 = !DISubrange(count: 135)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "PXEBC_DHCP4_OPTION_UUID", file: !116, line: 201, baseType: !247)
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PXEBC_DHCP4_OPTION_UUID", file: !116, line: 198, size: 136, elements: !248)
!248 = !{!249, !250}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !247, file: !116, line: 199, baseType: !138, size: 8)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "Guid", scope: !247, file: !116, line: 200, baseType: !251, size: 128, offset: 8)
!251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 128, elements: !252)
!252 = !{!253}
!253 = !DISubrange(count: 16)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTN", file: !139, line: 216, baseType: !255)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT64", file: !139, line: 166, baseType: !256)
!256 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GUID", file: !164, line: 25, baseType: !259)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "GUID", file: !148, line: 218, baseType: !260)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GUID", file: !148, line: 213, size: 128, elements: !261)
!261 = !{!262, !263, !264, !265}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "Data1", scope: !260, file: !148, line: 214, baseType: !186, size: 32)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "Data2", scope: !260, file: !148, line: 215, baseType: !158, size: 16, offset: 32)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "Data3", scope: !260, file: !148, line: 216, baseType: !158, size: 16, offset: 48)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "Data4", scope: !260, file: !148, line: 217, baseType: !266, size: 64, offset: 64)
!266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 64, elements: !267)
!267 = !{!268}
!268 = !DISubrange(count: 8)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "PXEBC_DHCP4_OPTION_UNDI", file: !116, line: 177, baseType: !271)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PXEBC_DHCP4_OPTION_UNDI", file: !116, line: 173, size: 24, elements: !272)
!272 = !{!273, !274, !275}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !271, file: !116, line: 174, baseType: !138, size: 8)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "MajorVer", scope: !271, file: !116, line: 175, baseType: !138, size: 8, offset: 8)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "MinorVer", scope: !271, file: !116, line: 176, baseType: !138, size: 8, offset: 16)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "PXEBC_DHCP4_OPTION_ARCH", file: !116, line: 185, baseType: !278)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PXEBC_DHCP4_OPTION_ARCH", file: !116, line: 183, size: 16, elements: !279)
!279 = !{!280}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !278, file: !116, line: 184, baseType: !158, size: 16)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "PXEBC_DHCP4_OPTION_CLID", file: !116, line: 196, baseType: !283)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PXEBC_DHCP4_OPTION_CLID", file: !116, line: 187, size: 256, elements: !284)
!284 = !{!285, !289, !293, !294, !295, !296, !297, !301}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "ClassIdentifier", scope: !283, file: !116, line: 188, baseType: !286, size: 80)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 80, elements: !287)
!287 = !{!288}
!288 = !DISubrange(count: 10)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "ArchitecturePrefix", scope: !283, file: !116, line: 189, baseType: !290, size: 40, offset: 80)
!290 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 40, elements: !291)
!291 = !{!292}
!292 = !DISubrange(count: 5)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "ArchitectureType", scope: !283, file: !116, line: 190, baseType: !290, size: 40, offset: 120)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "Lit3", scope: !283, file: !116, line: 191, baseType: !143, size: 8, offset: 160)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "InterfaceName", scope: !283, file: !116, line: 192, baseType: !169, size: 32, offset: 168)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "Lit4", scope: !283, file: !116, line: 193, baseType: !143, size: 8, offset: 200)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "UndiMajor", scope: !283, file: !116, line: 194, baseType: !298, size: 24, offset: 208)
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 24, elements: !299)
!299 = !{!300}
!300 = !DISubrange(count: 3)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "UndiMinor", scope: !283, file: !116, line: 195, baseType: !298, size: 24, offset: 232)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "PXEBC_PRIVATE_DATA", file: !304, line: 52, baseType: !305)
!304 = !DIFile(filename: "NetworkPkg/UefiPxeBcDxe/PxeBcImpl.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "97799bc64a49caaa653ce382cd21c883")
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PXEBC_PRIVATE_DATA", file: !304, line: 101, size: 352960, elements: !306)
!306 = !{!307, !308, !310, !311, !316, !456, !487, !488, !489, !490, !491, !492, !493, !494, !557, !742, !765, !905, !1064, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1341, !1364, !1497, !1647, !1740, !1741, !1857, !1874, !2103, !2116, !2117, !2118, !2119, !2120, !2121, !2122, !2123, !2124, !2125, !2126, !2127, !2128, !2129, !2130, !2131, !2132, !2133, !2134, !2135, !2136, !2137, !2138, !2139, !2140, !2141, !2142, !2143, !2144, !2145, !2146, !2147, !2148, !2212, !2213, !2214, !2215, !2216, !2217, !2218, !2220, !2221, !2222}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", scope: !305, file: !304, line: 102, baseType: !186, size: 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "Controller", scope: !305, file: !304, line: 103, baseType: !309, size: 64, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_HANDLE", file: !164, line: 33, baseType: !152)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !305, file: !304, line: 104, baseType: !309, size: 64, offset: 128)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "Id", scope: !305, file: !304, line: 106, baseType: !312, size: 64, offset: 192)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "PXEBC_PRIVATE_PROTOCOL", file: !304, line: 53, baseType: !313)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PXEBC_PRIVATE_PROTOCOL", file: !304, line: 89, size: 64, elements: !314)
!314 = !{!315}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved", scope: !313, file: !304, line: 90, baseType: !150, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "Snp", scope: !305, file: !304, line: 107, baseType: !317, size: 64, offset: 256)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_NETWORK_PROTOCOL", file: !319, line: 28, baseType: !320)
!319 = !DIFile(filename: "MdePkg/Include/Protocol/SimpleNetwork.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "ce4888de327acb559b98965e4f2a0a5b")
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_SIMPLE_NETWORK_PROTOCOL", file: !319, line: 643, size: 1024, elements: !321)
!321 = !{!322, !323, !328, !330, !335, !340, !342, !348, !353, !389, !407, !412, !418, !424, !429, !431}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "Revision", scope: !320, file: !319, line: 649, baseType: !150, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "Start", scope: !320, file: !319, line: 650, baseType: !324, size: 64, offset: 64)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_NETWORK_START", file: !319, line: 262, baseType: !325)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DISubroutineType(types: !327)
!327 = !{!212, !317}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "Stop", scope: !320, file: !319, line: 651, baseType: !329, size: 64, offset: 128)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_NETWORK_STOP", file: !319, line: 280, baseType: !325)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "Initialize", scope: !320, file: !319, line: 652, baseType: !331, size: 64, offset: 192)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_NETWORK_INITIALIZE", file: !319, line: 312, baseType: !332)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DISubroutineType(types: !334)
!334 = !{!212, !317, !149, !149}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "Reset", scope: !320, file: !319, line: 653, baseType: !336, size: 64, offset: 256)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_NETWORK_RESET", file: !319, line: 336, baseType: !337)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = !DISubroutineType(types: !339)
!339 = !{!212, !317, !146}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "Shutdown", scope: !320, file: !319, line: 654, baseType: !341, size: 64, offset: 320)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_NETWORK_SHUTDOWN", file: !319, line: 356, baseType: !325)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "ReceiveFilters", scope: !320, file: !319, line: 655, baseType: !343, size: 64, offset: 384)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_NETWORK_RECEIVE_FILTERS", file: !319, line: 386, baseType: !344)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DISubroutineType(types: !346)
!346 = !{!212, !317, !186, !186, !146, !149, !347}
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "StationAddress", scope: !320, file: !319, line: 656, baseType: !349, size: 64, offset: 448)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_NETWORK_STATION_ADDRESS", file: !319, line: 412, baseType: !350)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DISubroutineType(types: !352)
!352 = !{!212, !317, !146, !347}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "Statistics", scope: !320, file: !319, line: 657, baseType: !354, size: 64, offset: 512)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_NETWORK_STATISTICS", file: !319, line: 441, baseType: !355)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DISubroutineType(types: !357)
!357 = !{!212, !317, !146, !358, !359}
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_NETWORK_STATISTICS", file: !319, line: 136, baseType: !361)
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_NETWORK_STATISTICS", file: !319, line: 38, size: 1664, elements: !362)
!362 = !{!363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "RxTotalFrames", scope: !361, file: !319, line: 43, baseType: !150, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "RxGoodFrames", scope: !361, file: !319, line: 48, baseType: !150, size: 64, offset: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "RxUndersizeFrames", scope: !361, file: !319, line: 54, baseType: !150, size: 64, offset: 128)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "RxOversizeFrames", scope: !361, file: !319, line: 60, baseType: !150, size: 64, offset: 192)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "RxDroppedFrames", scope: !361, file: !319, line: 65, baseType: !150, size: 64, offset: 256)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "RxUnicastFrames", scope: !361, file: !319, line: 70, baseType: !150, size: 64, offset: 320)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "RxBroadcastFrames", scope: !361, file: !319, line: 75, baseType: !150, size: 64, offset: 384)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "RxMulticastFrames", scope: !361, file: !319, line: 80, baseType: !150, size: 64, offset: 448)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "RxCrcErrorFrames", scope: !361, file: !319, line: 85, baseType: !150, size: 64, offset: 512)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "RxTotalBytes", scope: !361, file: !319, line: 91, baseType: !150, size: 64, offset: 576)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "TxTotalFrames", scope: !361, file: !319, line: 96, baseType: !150, size: 64, offset: 640)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "TxGoodFrames", scope: !361, file: !319, line: 97, baseType: !150, size: 64, offset: 704)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "TxUndersizeFrames", scope: !361, file: !319, line: 98, baseType: !150, size: 64, offset: 768)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "TxOversizeFrames", scope: !361, file: !319, line: 99, baseType: !150, size: 64, offset: 832)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "TxDroppedFrames", scope: !361, file: !319, line: 100, baseType: !150, size: 64, offset: 896)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "TxUnicastFrames", scope: !361, file: !319, line: 101, baseType: !150, size: 64, offset: 960)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "TxBroadcastFrames", scope: !361, file: !319, line: 102, baseType: !150, size: 64, offset: 1024)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "TxMulticastFrames", scope: !361, file: !319, line: 103, baseType: !150, size: 64, offset: 1088)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "TxCrcErrorFrames", scope: !361, file: !319, line: 104, baseType: !150, size: 64, offset: 1152)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "TxTotalBytes", scope: !361, file: !319, line: 105, baseType: !150, size: 64, offset: 1216)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "Collisions", scope: !361, file: !319, line: 110, baseType: !150, size: 64, offset: 1280)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "UnsupportedProtocol", scope: !361, file: !319, line: 115, baseType: !150, size: 64, offset: 1344)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "RxDuplicatedFrames", scope: !361, file: !319, line: 120, baseType: !150, size: 64, offset: 1408)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "RxDecryptErrorFrames", scope: !361, file: !319, line: 125, baseType: !150, size: 64, offset: 1472)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "TxErrorFrames", scope: !361, file: !319, line: 130, baseType: !150, size: 64, offset: 1536)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "TxRetryFrames", scope: !361, file: !319, line: 135, baseType: !150, size: 64, offset: 1600)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "MCastIpToMac", scope: !320, file: !319, line: 658, baseType: !390, size: 64, offset: 576)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_NETWORK_MCAST_IP_TO_MAC", file: !319, line: 471, baseType: !391)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DISubroutineType(types: !393)
!393 = !{!212, !317, !146, !394, !347}
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP_ADDRESS", file: !164, line: 107, baseType: !396)
!396 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "EFI_IP_ADDRESS", file: !164, line: 103, size: 128, elements: !397)
!397 = !{!398, !400, !401}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "Addr", scope: !396, file: !164, line: 104, baseType: !399, size: 128)
!399 = !DICompositeType(tag: DW_TAG_array_type, baseType: !186, size: 128, elements: !170)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !396, file: !164, line: 105, baseType: !163, size: 32)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !396, file: !164, line: 106, baseType: !402, size: 128)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IPv6_ADDRESS", file: !164, line: 90, baseType: !403)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPv6_ADDRESS", file: !148, line: 232, baseType: !404)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IPv6_ADDRESS", file: !148, line: 230, size: 128, elements: !405)
!405 = !{!406}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "Addr", scope: !404, file: !148, line: 231, baseType: !251, size: 128)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "NvData", scope: !320, file: !319, line: 659, baseType: !408, size: 64, offset: 640)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_NETWORK_NVDATA", file: !319, line: 500, baseType: !409)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DISubroutineType(types: !411)
!411 = !{!212, !317, !146, !149, !149, !152}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "GetStatus", scope: !320, file: !319, line: 660, baseType: !413, size: 64, offset: 704)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_NETWORK_GET_STATUS", file: !319, line: 535, baseType: !414)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DISubroutineType(types: !416)
!416 = !{!212, !317, !185, !417}
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "Transmit", scope: !320, file: !319, line: 661, baseType: !419, size: 64, offset: 768)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_NETWORK_TRANSMIT", file: !319, line: 576, baseType: !420)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DISubroutineType(types: !422)
!422 = !{!212, !317, !149, !149, !152, !347, !347, !423}
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "Receive", scope: !320, file: !319, line: 662, baseType: !425, size: 64, offset: 832)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_NETWORK_RECEIVE", file: !319, line: 620, baseType: !426)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DISubroutineType(types: !428)
!428 = !{!212, !317, !358, !358, !152, !347, !347, !423}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "WaitForPacket", scope: !320, file: !319, line: 666, baseType: !430, size: 64, offset: 896)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_EVENT", file: !164, line: 37, baseType: !152)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "Mode", scope: !320, file: !319, line: 670, baseType: !432, size: 64, offset: 960)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_NETWORK_MODE", file: !319, line: 242, baseType: !434)
!434 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_SIMPLE_NETWORK_MODE", file: !319, line: 162, size: 5248, elements: !435)
!435 = !{!436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !448, !449, !450, !451, !452, !453, !454, !455}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "State", scope: !434, file: !319, line: 166, baseType: !186, size: 32)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "HwAddressSize", scope: !434, file: !319, line: 170, baseType: !186, size: 32, offset: 32)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "MediaHeaderSize", scope: !434, file: !319, line: 174, baseType: !186, size: 32, offset: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "MaxPacketSize", scope: !434, file: !319, line: 178, baseType: !186, size: 32, offset: 96)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "NvRamSize", scope: !434, file: !319, line: 182, baseType: !186, size: 32, offset: 128)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "NvRamAccessSize", scope: !434, file: !319, line: 189, baseType: !186, size: 32, offset: 160)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "ReceiveFilterMask", scope: !434, file: !319, line: 193, baseType: !186, size: 32, offset: 192)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "ReceiveFilterSetting", scope: !434, file: !319, line: 197, baseType: !186, size: 32, offset: 224)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "MaxMCastFilterCount", scope: !434, file: !319, line: 201, baseType: !186, size: 32, offset: 256)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "MCastFilterCount", scope: !434, file: !319, line: 205, baseType: !186, size: 32, offset: 288)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "MCastFilter", scope: !434, file: !319, line: 209, baseType: !447, size: 4096, offset: 320)
!447 = !DICompositeType(tag: DW_TAG_array_type, baseType: !218, size: 4096, elements: !252)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "CurrentAddress", scope: !434, file: !319, line: 213, baseType: !218, size: 256, offset: 4416)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "BroadcastAddress", scope: !434, file: !319, line: 217, baseType: !218, size: 256, offset: 4672)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "PermanentAddress", scope: !434, file: !319, line: 221, baseType: !218, size: 256, offset: 4928)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "IfType", scope: !434, file: !319, line: 225, baseType: !138, size: 8, offset: 5184)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "MacAddressChangeable", scope: !434, file: !319, line: 229, baseType: !146, size: 8, offset: 5192)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "MultipleTxSupported", scope: !434, file: !319, line: 233, baseType: !146, size: 8, offset: 5200)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "MediaPresentSupported", scope: !434, file: !319, line: 237, baseType: !146, size: 8, offset: 5208)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "MediaPresent", scope: !434, file: !319, line: 241, baseType: !146, size: 8, offset: 5216)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "Ip4Nic", scope: !305, file: !304, line: 109, baseType: !457, size: 64, offset: 320)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "PXEBC_VIRTUAL_NIC", file: !304, line: 54, baseType: !459)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PXEBC_VIRTUAL_NIC", file: !304, line: 93, size: 320, elements: !460)
!460 = !{!461, !462, !463, !485, !486}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", scope: !459, file: !304, line: 94, baseType: !186, size: 32)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "Controller", scope: !459, file: !304, line: 95, baseType: !309, size: 64, offset: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "LoadFile", scope: !459, file: !304, line: 96, baseType: !464, size: 64, offset: 128)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_LOAD_FILE_PROTOCOL", file: !465, line: 28, baseType: !466)
!465 = !DIFile(filename: "MdePkg/Include/Protocol/LoadFile.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "15734a5f551782ac503b5b1cf42f1c66")
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_LOAD_FILE_PROTOCOL", file: !465, line: 76, size: 64, elements: !467)
!467 = !{!468}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "LoadFile", scope: !466, file: !465, line: 77, baseType: !469, size: 64)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_LOAD_FILE", file: !465, line: 65, baseType: !470)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DISubroutineType(types: !472)
!472 = !{!212, !473, !474, !146, !358, !152}
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DEVICE_PATH_PROTOCOL", file: !476, line: 58, baseType: !477)
!476 = !DIFile(filename: "MdePkg/Include/Protocol/DevicePath.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "6b6d593d171f69b933a87911e52d4607")
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_DEVICE_PATH_PROTOCOL", file: !476, line: 43, size: 32, elements: !478)
!478 = !{!479, !480, !481}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !477, file: !476, line: 44, baseType: !138, size: 8)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "SubType", scope: !477, file: !476, line: 51, baseType: !138, size: 8, offset: 8)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !477, file: !476, line: 56, baseType: !482, size: 16, offset: 16)
!482 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 16, elements: !483)
!483 = !{!484}
!484 = !DISubrange(count: 2)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "DevicePath", scope: !459, file: !304, line: 97, baseType: !474, size: 64, offset: 192)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "Private", scope: !459, file: !304, line: 98, baseType: !302, size: 64, offset: 256)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "Ip6Nic", scope: !305, file: !304, line: 110, baseType: !457, size: 64, offset: 384)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "ArpChild", scope: !305, file: !304, line: 112, baseType: !309, size: 64, offset: 448)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "Ip4Child", scope: !305, file: !304, line: 113, baseType: !309, size: 64, offset: 512)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "Dhcp4Child", scope: !305, file: !304, line: 114, baseType: !309, size: 64, offset: 576)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "Mtftp4Child", scope: !305, file: !304, line: 115, baseType: !309, size: 64, offset: 640)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "Udp4ReadChild", scope: !305, file: !304, line: 116, baseType: !309, size: 64, offset: 704)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "Udp4WriteChild", scope: !305, file: !304, line: 117, baseType: !309, size: 64, offset: 768)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "Arp", scope: !305, file: !304, line: 119, baseType: !495, size: 64, offset: 832)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_ARP_PROTOCOL", file: !497, line: 31, baseType: !498)
!497 = !DIFile(filename: "MdePkg/Include/Protocol/Arp.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "8142067718decedafa618d42505fb9b3")
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_ARP_PROTOCOL", file: !497, line: 363, size: 448, elements: !499)
!499 = !{!500, !515, !520, !537, !542, !547, !552}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "Configure", scope: !498, file: !497, line: 364, baseType: !501, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_ARP_CONFIGURE", file: !497, line: 142, baseType: !502)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DISubroutineType(types: !504)
!504 = !{!212, !495, !505}
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_ARP_CONFIG_DATA", file: !497, line: 110, baseType: !507)
!507 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_ARP_CONFIG_DATA", file: !497, line: 72, size: 256, elements: !508)
!508 = !{!509, !510, !511, !512, !513, !514}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "SwAddressType", scope: !507, file: !497, line: 76, baseType: !158, size: 16)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "SwAddressLength", scope: !507, file: !497, line: 81, baseType: !138, size: 8, offset: 16)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "StationAddress", scope: !507, file: !497, line: 89, baseType: !152, size: 64, offset: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "EntryTimeOut", scope: !507, file: !497, line: 96, baseType: !186, size: 32, offset: 128)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "RetryCount", scope: !507, file: !497, line: 102, baseType: !186, size: 32, offset: 160)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "RetryTimeOut", scope: !507, file: !497, line: 109, baseType: !186, size: 32, offset: 192)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "Add", scope: !498, file: !497, line: 365, baseType: !516, size: 64, offset: 64)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_ARP_ADD", file: !497, line: 194, baseType: !517)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = !DISubroutineType(types: !519)
!519 = !{!212, !495, !146, !152, !152, !186, !146}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "Find", scope: !498, file: !497, line: 366, baseType: !521, size: 64, offset: 128)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_ARP_FIND", file: !497, line: 239, baseType: !522)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DISubroutineType(types: !524)
!524 = !{!212, !495, !146, !152, !185, !185, !525, !146}
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_ARP_FIND_DATA", file: !497, line: 70, baseType: !528)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_ARP_FIND_DATA", file: !497, line: 33, size: 96, elements: !529)
!529 = !{!530, !531, !532, !533, !534, !535, !536}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !528, file: !497, line: 37, baseType: !186, size: 32)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "DenyFlag", scope: !528, file: !497, line: 43, baseType: !146, size: 8, offset: 32)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "StaticFlag", scope: !528, file: !497, line: 49, baseType: !146, size: 8, offset: 40)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "HwAddressType", scope: !528, file: !497, line: 54, baseType: !158, size: 16, offset: 48)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "SwAddressType", scope: !528, file: !497, line: 59, baseType: !158, size: 16, offset: 64)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "HwAddressLength", scope: !528, file: !497, line: 64, baseType: !138, size: 8, offset: 80)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "SwAddressLength", scope: !528, file: !497, line: 69, baseType: !138, size: 8, offset: 88)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "Delete", scope: !498, file: !497, line: 367, baseType: !538, size: 64, offset: 192)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_ARP_DELETE", file: !497, line: 268, baseType: !539)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DISubroutineType(types: !541)
!541 = !{!212, !495, !146, !152}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "Flush", scope: !498, file: !497, line: 368, baseType: !543, size: 64, offset: 256)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_ARP_FLUSH", file: !497, line: 288, baseType: !544)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DISubroutineType(types: !546)
!546 = !{!212, !495}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "Request", scope: !498, file: !497, line: 369, baseType: !548, size: 64, offset: 320)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_ARP_REQUEST", file: !497, line: 316, baseType: !549)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DISubroutineType(types: !551)
!551 = !{!212, !495, !152, !430, !152}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "Cancel", scope: !498, file: !497, line: 370, baseType: !553, size: 64, offset: 384)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_ARP_CANCEL", file: !497, line: 353, baseType: !554)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = !DISubroutineType(types: !556)
!556 = !{!212, !495, !152, !430}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "Ip4", scope: !305, file: !304, line: 120, baseType: !558, size: 64, offset: 896)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_PROTOCOL", file: !560, line: 36, baseType: !561)
!560 = !DIFile(filename: "MdePkg/Include/Protocol/Ip4.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "1ff13a8b379fde89ccc818c3d7035657")
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_IP4_PROTOCOL", file: !560, line: 588, size: 512, elements: !562)
!562 = !{!563, !630, !636, !641, !646, !733, !735, !737}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "GetModeData", scope: !561, file: !560, line: 589, baseType: !564, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_GET_MODE_DATA", file: !560, line: 282, baseType: !565)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DISubroutineType(types: !567)
!567 = !{!212, !568, !570, !615, !432}
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !559)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_MODE_DATA", file: !560, line: 182, baseType: !572)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_IP4_MODE_DATA", file: !560, line: 141, size: 704, elements: !573)
!573 = !{!574, !575, !576, !594, !595, !596, !598, !599, !607, !608}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "IsStarted", scope: !572, file: !560, line: 145, baseType: !146, size: 8)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "MaxPacketSize", scope: !572, file: !560, line: 149, baseType: !186, size: 32, offset: 32)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "ConfigData", scope: !572, file: !560, line: 153, baseType: !577, size: 224, offset: 64)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_CONFIG_DATA", file: !560, line: 128, baseType: !578)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_IP4_CONFIG_DATA", file: !560, line: 58, size: 224, elements: !579)
!579 = !{!580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "DefaultProtocol", scope: !578, file: !560, line: 63, baseType: !138, size: 8)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "AcceptAnyProtocol", scope: !578, file: !560, line: 69, baseType: !146, size: 8, offset: 8)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "AcceptIcmpErrors", scope: !578, file: !560, line: 74, baseType: !146, size: 8, offset: 16)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "AcceptBroadcast", scope: !578, file: !560, line: 80, baseType: !146, size: 8, offset: 24)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "AcceptPromiscuous", scope: !578, file: !560, line: 86, baseType: !146, size: 8, offset: 32)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultAddress", scope: !578, file: !560, line: 90, baseType: !146, size: 8, offset: 40)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "StationAddress", scope: !578, file: !560, line: 94, baseType: !163, size: 32, offset: 48)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "SubnetMask", scope: !578, file: !560, line: 98, baseType: !163, size: 32, offset: 80)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "TypeOfService", scope: !578, file: !560, line: 102, baseType: !138, size: 8, offset: 112)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "TimeToLive", scope: !578, file: !560, line: 106, baseType: !138, size: 8, offset: 120)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "DoNotFragment", scope: !578, file: !560, line: 110, baseType: !146, size: 8, offset: 128)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "RawData", scope: !578, file: !560, line: 115, baseType: !146, size: 8, offset: 136)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "ReceiveTimeout", scope: !578, file: !560, line: 121, baseType: !186, size: 32, offset: 160)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "TransmitTimeout", scope: !578, file: !560, line: 127, baseType: !186, size: 32, offset: 192)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "IsConfigured", scope: !572, file: !560, line: 157, baseType: !146, size: 8, offset: 288)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "GroupCount", scope: !572, file: !560, line: 161, baseType: !186, size: 32, offset: 320)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "GroupTable", scope: !572, file: !560, line: 165, baseType: !597, size: 64, offset: 384)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "RouteCount", scope: !572, file: !560, line: 169, baseType: !186, size: 32, offset: 448)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "RouteTable", scope: !572, file: !560, line: 173, baseType: !600, size: 64, offset: 512)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_ROUTE_TABLE", file: !560, line: 134, baseType: !602)
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_IP4_ROUTE_TABLE", file: !560, line: 130, size: 96, elements: !603)
!603 = !{!604, !605, !606}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "SubnetAddress", scope: !602, file: !560, line: 131, baseType: !163, size: 32)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "SubnetMask", scope: !602, file: !560, line: 132, baseType: !163, size: 32, offset: 32)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "GatewayAddress", scope: !602, file: !560, line: 133, baseType: !163, size: 32, offset: 64)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "IcmpTypeCount", scope: !572, file: !560, line: 177, baseType: !186, size: 32, offset: 576)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "IcmpTypeList", scope: !572, file: !560, line: 181, baseType: !609, size: 64, offset: 640)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_ICMP_TYPE", file: !560, line: 139, baseType: !611)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_IP4_ICMP_TYPE", file: !560, line: 136, size: 16, elements: !612)
!612 = !{!613, !614}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !611, file: !560, line: 137, baseType: !138, size: 8)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "Code", scope: !611, file: !560, line: 138, baseType: !138, size: 8, offset: 8)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MANAGED_NETWORK_CONFIG_DATA", file: !617, line: 84, baseType: !618)
!617 = !DIFile(filename: "MdePkg/Include/Protocol/ManagedNetwork.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "8951452d2c79255944d265d14ed27585")
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_MANAGED_NETWORK_CONFIG_DATA", file: !617, line: 30, size: 160, elements: !619)
!619 = !{!620, !621, !622, !623, !624, !625, !626, !627, !628, !629}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "ReceivedQueueTimeoutValue", scope: !618, file: !617, line: 35, baseType: !186, size: 32)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "TransmitQueueTimeoutValue", scope: !618, file: !617, line: 40, baseType: !186, size: 32, offset: 32)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "ProtocolTypeFilter", scope: !618, file: !617, line: 45, baseType: !158, size: 16, offset: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "EnableUnicastReceive", scope: !618, file: !617, line: 50, baseType: !146, size: 8, offset: 80)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "EnableMulticastReceive", scope: !618, file: !617, line: 55, baseType: !146, size: 8, offset: 88)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "EnableBroadcastReceive", scope: !618, file: !617, line: 60, baseType: !146, size: 8, offset: 96)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "EnablePromiscuousReceive", scope: !618, file: !617, line: 65, baseType: !146, size: 8, offset: 104)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "FlushQueuesOnReset", scope: !618, file: !617, line: 70, baseType: !146, size: 8, offset: 112)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "EnableReceiveTimestamps", scope: !618, file: !617, line: 76, baseType: !146, size: 8, offset: 120)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "DisableBackgroundPolling", scope: !618, file: !617, line: 83, baseType: !146, size: 8, offset: 128)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "Configure", scope: !561, file: !560, line: 590, baseType: !631, size: 64, offset: 64)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_CONFIGURE", file: !560, line: 337, baseType: !632)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = !DISubroutineType(types: !634)
!634 = !{!212, !558, !635}
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "Groups", scope: !561, file: !560, line: 591, baseType: !637, size: 64, offset: 128)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_GROUPS", file: !560, line: 374, baseType: !638)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DISubroutineType(types: !640)
!640 = !{!212, !558, !146, !597}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "Routes", scope: !561, file: !560, line: 592, baseType: !642, size: 64, offset: 192)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_ROUTES", file: !560, line: 432, baseType: !643)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DISubroutineType(types: !645)
!645 = !{!212, !558, !146, !597, !597, !597}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "Transmit", scope: !561, file: !560, line: 593, baseType: !647, size: 64, offset: 256)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_TRANSMIT", file: !560, line: 471, baseType: !648)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DISubroutineType(types: !650)
!650 = !{!212, !558, !651}
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_COMPLETION_TOKEN", file: !560, line: 260, baseType: !653)
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_IP4_COMPLETION_TOKEN", file: !560, line: 237, size: 192, elements: !654)
!654 = !{!655, !656, !657, !732}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "Event", scope: !653, file: !560, line: 244, baseType: !430, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "Status", scope: !653, file: !560, line: 249, baseType: !212, size: 64, offset: 64)
!657 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !653, file: !560, line: 250, size: 64, elements: !658)
!658 = !{!659, !710}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "RxData", scope: !657, file: !560, line: 254, baseType: !660, size: 64)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_RECEIVE_DATA", file: !560, line: 216, baseType: !662)
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_IP4_RECEIVE_DATA", file: !560, line: 206, size: 640, elements: !663)
!663 = !{!664, !681, !682, !683, !699, !700, !701, !702, !703}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "TimeStamp", scope: !662, file: !560, line: 207, baseType: !665, size: 128)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TIME", file: !164, line: 80, baseType: !666)
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_TIME", file: !164, line: 68, size: 128, elements: !667)
!667 = !{!668, !669, !670, !671, !672, !673, !674, !675, !676, !679, !680}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "Year", scope: !666, file: !164, line: 69, baseType: !158, size: 16)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "Month", scope: !666, file: !164, line: 70, baseType: !138, size: 8, offset: 16)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "Day", scope: !666, file: !164, line: 71, baseType: !138, size: 8, offset: 24)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "Hour", scope: !666, file: !164, line: 72, baseType: !138, size: 8, offset: 32)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "Minute", scope: !666, file: !164, line: 73, baseType: !138, size: 8, offset: 40)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "Second", scope: !666, file: !164, line: 74, baseType: !138, size: 8, offset: 48)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "Pad1", scope: !666, file: !164, line: 75, baseType: !138, size: 8, offset: 56)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "Nanosecond", scope: !666, file: !164, line: 76, baseType: !186, size: 32, offset: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "TimeZone", scope: !666, file: !164, line: 77, baseType: !677, size: 16, offset: 96)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT16", file: !139, line: 187, baseType: !678)
!678 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "Daylight", scope: !666, file: !164, line: 78, baseType: !138, size: 8, offset: 112)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "Pad2", scope: !666, file: !164, line: 79, baseType: !138, size: 8, offset: 120)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "RecycleSignal", scope: !662, file: !560, line: 208, baseType: !430, size: 64, offset: 128)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "HeaderLength", scope: !662, file: !560, line: 209, baseType: !186, size: 32, offset: 192)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "Header", scope: !662, file: !560, line: 210, baseType: !684, size: 64, offset: 256)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_HEADER", file: !560, line: 198, baseType: !686)
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_IP4_HEADER", file: !560, line: 186, size: 160, elements: !687)
!687 = !{!688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "HeaderLength", scope: !686, file: !560, line: 187, baseType: !138, size: 4, flags: DIFlagBitField, extraData: i64 0)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "Version", scope: !686, file: !560, line: 188, baseType: !138, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "TypeOfService", scope: !686, file: !560, line: 189, baseType: !138, size: 8, offset: 8)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "TotalLength", scope: !686, file: !560, line: 190, baseType: !158, size: 16, offset: 16)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "Identification", scope: !686, file: !560, line: 191, baseType: !158, size: 16, offset: 32)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "Fragmentation", scope: !686, file: !560, line: 192, baseType: !158, size: 16, offset: 48)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "TimeToLive", scope: !686, file: !560, line: 193, baseType: !138, size: 8, offset: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "Protocol", scope: !686, file: !560, line: 194, baseType: !138, size: 8, offset: 72)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "Checksum", scope: !686, file: !560, line: 195, baseType: !158, size: 16, offset: 80)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "SourceAddress", scope: !686, file: !560, line: 196, baseType: !163, size: 32, offset: 96)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "DestinationAddress", scope: !686, file: !560, line: 197, baseType: !163, size: 32, offset: 128)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "OptionsLength", scope: !662, file: !560, line: 211, baseType: !186, size: 32, offset: 320)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "Options", scope: !662, file: !560, line: 212, baseType: !152, size: 64, offset: 384)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "DataLength", scope: !662, file: !560, line: 213, baseType: !186, size: 32, offset: 448)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "FragmentCount", scope: !662, file: !560, line: 214, baseType: !186, size: 32, offset: 480)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "FragmentTable", scope: !662, file: !560, line: 215, baseType: !704, size: 128, offset: 512)
!704 = !DICompositeType(tag: DW_TAG_array_type, baseType: !705, size: 128, elements: !144)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_FRAGMENT_DATA", file: !560, line: 204, baseType: !706)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_IP4_FRAGMENT_DATA", file: !560, line: 201, size: 128, elements: !707)
!707 = !{!708, !709}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "FragmentLength", scope: !706, file: !560, line: 202, baseType: !186, size: 32)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "FragmentBuffer", scope: !706, file: !560, line: 203, baseType: !152, size: 64, offset: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "TxData", scope: !657, file: !560, line: 258, baseType: !711, size: 64)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_TRANSMIT_DATA", file: !560, line: 235, baseType: !713)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_IP4_TRANSMIT_DATA", file: !560, line: 227, size: 448, elements: !714)
!714 = !{!715, !716, !727, !728, !729, !730, !731}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "DestinationAddress", scope: !713, file: !560, line: 228, baseType: !163, size: 32)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "OverrideData", scope: !713, file: !560, line: 229, baseType: !717, size: 64, offset: 64)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_OVERRIDE_DATA", file: !560, line: 225, baseType: !719)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_IP4_OVERRIDE_DATA", file: !560, line: 218, size: 96, elements: !720)
!720 = !{!721, !722, !723, !724, !725, !726}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "SourceAddress", scope: !719, file: !560, line: 219, baseType: !163, size: 32)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "GatewayAddress", scope: !719, file: !560, line: 220, baseType: !163, size: 32, offset: 32)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "Protocol", scope: !719, file: !560, line: 221, baseType: !138, size: 8, offset: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "TypeOfService", scope: !719, file: !560, line: 222, baseType: !138, size: 8, offset: 72)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "TimeToLive", scope: !719, file: !560, line: 223, baseType: !138, size: 8, offset: 80)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "DoNotFragment", scope: !719, file: !560, line: 224, baseType: !146, size: 8, offset: 88)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "OptionsLength", scope: !713, file: !560, line: 230, baseType: !186, size: 32, offset: 128)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "OptionsBuffer", scope: !713, file: !560, line: 231, baseType: !152, size: 64, offset: 192)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "TotalDataLength", scope: !713, file: !560, line: 232, baseType: !186, size: 32, offset: 256)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "FragmentCount", scope: !713, file: !560, line: 233, baseType: !186, size: 32, offset: 288)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "FragmentTable", scope: !713, file: !560, line: 234, baseType: !704, size: 128, offset: 320)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "Packet", scope: !653, file: !560, line: 259, baseType: !657, size: 64, offset: 128)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "Receive", scope: !561, file: !560, line: 594, baseType: !734, size: 64, offset: 320)
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_RECEIVE", file: !560, line: 510, baseType: !648)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "Cancel", scope: !561, file: !560, line: 595, baseType: !736, size: 64, offset: 384)
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_CANCEL", file: !560, line: 546, baseType: !648)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "Poll", scope: !561, file: !560, line: 596, baseType: !738, size: 64, offset: 448)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_POLL", file: !560, line: 580, baseType: !739)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DISubroutineType(types: !741)
!741 = !{!212, !558}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "Ip4Config2", scope: !305, file: !304, line: 121, baseType: !743, size: 64, offset: 960)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_CONFIG2_PROTOCOL", file: !6, line: 23, baseType: !745)
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_IP4_CONFIG2_PROTOCOL", file: !6, line: 307, size: 256, elements: !746)
!746 = !{!747, !753, !758, !763}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "SetData", scope: !745, file: !6, line: 308, baseType: !748, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_CONFIG2_SET_DATA", file: !6, line: 203, baseType: !749)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DISubroutineType(types: !751)
!751 = !{!212, !743, !752, !149, !152}
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_CONFIG2_DATA_TYPE", file: !6, line: 76, baseType: !5)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "GetData", scope: !745, file: !6, line: 309, baseType: !754, size: 64, offset: 64)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_CONFIG2_GET_DATA", file: !6, line: 245, baseType: !755)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = !DISubroutineType(types: !757)
!757 = !{!212, !743, !752, !358, !152}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "RegisterDataNotify", scope: !745, file: !6, line: 310, baseType: !759, size: 64, offset: 128)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_CONFIG2_REGISTER_NOTIFY", file: !6, line: 274, baseType: !760)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DISubroutineType(types: !762)
!762 = !{!212, !743, !752, !430}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "UnregisterDataNotify", scope: !745, file: !6, line: 311, baseType: !764, size: 64, offset: 192)
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_CONFIG2_UNREGISTER_NOTIFY", file: !6, line: 295, baseType: !760)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "Dhcp4", scope: !305, file: !304, line: 122, baseType: !766, size: 64, offset: 1024)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP4_PROTOCOL", file: !16, line: 28, baseType: !768)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_DHCP4_PROTOCOL", file: !16, line: 747, size: 576, elements: !769)
!769 = !{!770, !845, !851, !856, !861, !866, !868, !873, !900}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "GetModeData", scope: !768, file: !16, line: 748, baseType: !771, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP4_GET_MODE_DATA", file: !16, line: 421, baseType: !772)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DISubroutineType(types: !774)
!774 = !{!212, !766, !775}
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP4_MODE_DATA", file: !16, line: 338, baseType: !777)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_DHCP4_MODE_DATA", file: !16, line: 297, size: 1152, elements: !778)
!778 = !{!779, !781, !838, !839, !840, !841, !842, !843, !844}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "State", scope: !777, file: !16, line: 301, baseType: !780, size: 32)
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP4_STATE", file: !16, line: 139, baseType: !15)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "ConfigData", scope: !777, file: !16, line: 305, baseType: !782, size: 576, offset: 64)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP4_CONFIG_DATA", file: !16, line: 295, baseType: !783)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_DHCP4_CONFIG_DATA", file: !16, line: 241, size: 576, elements: !784)
!784 = !{!785, !786, !787, !788, !789, !790, !834, !835, !836}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "DiscoverTryCount", scope: !783, file: !16, line: 247, baseType: !186, size: 32)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "DiscoverTimeout", scope: !783, file: !16, line: 253, baseType: !185, size: 64, offset: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "RequestTryCount", scope: !783, file: !16, line: 259, baseType: !186, size: 32, offset: 128)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "RequestTimeout", scope: !783, file: !16, line: 265, baseType: !185, size: 64, offset: 192)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "ClientAddress", scope: !783, file: !16, line: 273, baseType: !163, size: 32, offset: 256)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "Dhcp4Callback", scope: !783, file: !16, line: 278, baseType: !791, size: 64, offset: 320)
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP4_CALLBACK", file: !16, line: 232, baseType: !792)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DISubroutineType(types: !794)
!794 = !{!212, !766, !152, !780, !795, !796, !833}
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP4_EVENT", file: !16, line: 196, baseType: !27)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP4_PACKET", file: !16, line: 95, baseType: !798)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_DHCP4_PACKET", file: !16, line: 70, size: 1992, elements: !799)
!799 = !{!800, !801, !802, !832}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !798, file: !16, line: 74, baseType: !186, size: 32)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !798, file: !16, line: 79, baseType: !186, size: 32, offset: 32)
!802 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !798, file: !16, line: 81, size: 1928, elements: !803)
!803 = !{!804, !830, !831}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "Header", scope: !802, file: !16, line: 85, baseType: !805, size: 1888)
!805 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP4_HEADER", file: !16, line: 66, baseType: !806)
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_DHCP4_HEADER", file: !16, line: 51, size: 1888, elements: !807)
!807 = !{!808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !826}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "OpCode", scope: !806, file: !16, line: 52, baseType: !138, size: 8)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "HwType", scope: !806, file: !16, line: 53, baseType: !138, size: 8, offset: 8)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "HwAddrLen", scope: !806, file: !16, line: 54, baseType: !138, size: 8, offset: 16)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "Hops", scope: !806, file: !16, line: 55, baseType: !138, size: 8, offset: 24)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "Xid", scope: !806, file: !16, line: 56, baseType: !186, size: 32, offset: 32)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "Seconds", scope: !806, file: !16, line: 57, baseType: !158, size: 16, offset: 64)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved", scope: !806, file: !16, line: 58, baseType: !158, size: 16, offset: 80)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "ClientAddr", scope: !806, file: !16, line: 59, baseType: !163, size: 32, offset: 96)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "YourAddr", scope: !806, file: !16, line: 60, baseType: !163, size: 32, offset: 128)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "ServerAddr", scope: !806, file: !16, line: 61, baseType: !163, size: 32, offset: 160)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "GatewayAddr", scope: !806, file: !16, line: 62, baseType: !163, size: 32, offset: 192)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "ClientHwAddr", scope: !806, file: !16, line: 63, baseType: !251, size: 128, offset: 224)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "ServerName", scope: !806, file: !16, line: 64, baseType: !821, size: 512, offset: 352)
!821 = !DICompositeType(tag: DW_TAG_array_type, baseType: !822, size: 512, elements: !824)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHAR8", file: !139, line: 200, baseType: !823)
!823 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!824 = !{!825}
!825 = !DISubrange(count: 64)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "BootFileName", scope: !806, file: !16, line: 65, baseType: !827, size: 1024, offset: 864)
!827 = !DICompositeType(tag: DW_TAG_array_type, baseType: !822, size: 1024, elements: !828)
!828 = !{!829}
!829 = !DISubrange(count: 128)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "Magik", scope: !802, file: !16, line: 89, baseType: !186, size: 32, offset: 1888)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "Option", scope: !802, file: !16, line: 93, baseType: !143, size: 8, offset: 1920)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "Dhcp4", scope: !798, file: !16, line: 94, baseType: !802, size: 1928, offset: 64)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "CallbackContext", scope: !783, file: !16, line: 282, baseType: !152, size: 64, offset: 384)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "OptionCount", scope: !783, file: !16, line: 286, baseType: !186, size: 32, offset: 448)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "OptionList", scope: !783, file: !16, line: 294, baseType: !837, size: 64, offset: 512)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "ClientAddress", scope: !777, file: !16, line: 310, baseType: !163, size: 32, offset: 640)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "ClientMacAddress", scope: !777, file: !16, line: 314, baseType: !218, size: 256, offset: 672)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "ServerAddress", scope: !777, file: !16, line: 318, baseType: !163, size: 32, offset: 928)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "RouterAddress", scope: !777, file: !16, line: 323, baseType: !163, size: 32, offset: 960)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "SubnetMask", scope: !777, file: !16, line: 327, baseType: !163, size: 32, offset: 992)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "LeaseTime", scope: !777, file: !16, line: 333, baseType: !186, size: 32, offset: 1024)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "ReplyPacket", scope: !777, file: !16, line: 337, baseType: !796, size: 64, offset: 1088)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "Configure", scope: !768, file: !16, line: 749, baseType: !846, size: 64, offset: 64)
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP4_CONFIGURE", file: !16, line: 476, baseType: !847)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = !DISubroutineType(types: !849)
!849 = !{!212, !766, !850}
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "Start", scope: !768, file: !16, line: 750, baseType: !852, size: 64, offset: 128)
!852 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP4_START", file: !16, line: 524, baseType: !853)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = !DISubroutineType(types: !855)
!855 = !{!212, !766, !430}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "RenewRebind", scope: !768, file: !16, line: 751, baseType: !857, size: 64, offset: 192)
!857 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP4_RENEW_REBIND", file: !16, line: 569, baseType: !858)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = !DISubroutineType(types: !860)
!860 = !{!212, !766, !146, !430}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "Release", scope: !768, file: !16, line: 752, baseType: !862, size: 64, offset: 256)
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP4_RELEASE", file: !16, line: 598, baseType: !863)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = !DISubroutineType(types: !865)
!865 = !{!212, !766}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "Stop", scope: !768, file: !16, line: 753, baseType: !867, size: 64, offset: 320)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP4_STOP", file: !16, line: 619, baseType: !863)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "Build", scope: !768, file: !16, line: 754, baseType: !869, size: 64, offset: 384)
!869 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP4_BUILD", file: !16, line: 660, baseType: !870)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64)
!871 = !DISubroutineType(types: !872)
!872 = !{!212, !766, !796, !186, !231, !186, !837, !833}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "TransmitReceive", scope: !768, file: !16, line: 755, baseType: !874, size: 64, offset: 448)
!874 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP4_TRANSMIT_RECEIVE", file: !16, line: 697, baseType: !875)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = !DISubroutineType(types: !877)
!877 = !{!212, !766, !878}
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64)
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP4_TRANSMIT_RECEIVE_TOKEN", file: !16, line: 404, baseType: !880)
!880 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_DHCP4_TRANSMIT_RECEIVE_TOKEN", file: !16, line: 357, size: 576, elements: !881)
!881 = !{!882, !883, !884, !885, !886, !887, !888, !896, !897, !898, !899}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "Status", scope: !880, file: !16, line: 361, baseType: !212, size: 64)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "CompletionEvent", scope: !880, file: !16, line: 366, baseType: !430, size: 64, offset: 64)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "RemoteAddress", scope: !880, file: !16, line: 370, baseType: !163, size: 32, offset: 128)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "RemotePort", scope: !880, file: !16, line: 374, baseType: !158, size: 16, offset: 160)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "GatewayAddress", scope: !880, file: !16, line: 378, baseType: !163, size: 32, offset: 176)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "ListenPointCount", scope: !880, file: !16, line: 382, baseType: !186, size: 32, offset: 224)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "ListenPoints", scope: !880, file: !16, line: 387, baseType: !889, size: 64, offset: 256)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64)
!890 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP4_LISTEN_POINT", file: !16, line: 355, baseType: !891)
!891 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_DHCP4_LISTEN_POINT", file: !16, line: 340, size: 80, elements: !892)
!892 = !{!893, !894, !895}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "ListenAddress", scope: !891, file: !16, line: 344, baseType: !163, size: 32)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "SubnetMask", scope: !891, file: !16, line: 349, baseType: !163, size: 32, offset: 32)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "ListenPort", scope: !891, file: !16, line: 354, baseType: !158, size: 16, offset: 64)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "TimeoutValue", scope: !880, file: !16, line: 391, baseType: !186, size: 32, offset: 320)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "Packet", scope: !880, file: !16, line: 395, baseType: !796, size: 64, offset: 384)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "ResponseCount", scope: !880, file: !16, line: 399, baseType: !186, size: 32, offset: 448)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "ResponseList", scope: !880, file: !16, line: 403, baseType: !796, size: 64, offset: 512)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "Parse", scope: !768, file: !16, line: 756, baseType: !901, size: 64, offset: 512)
!901 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP4_PARSE", file: !16, line: 736, baseType: !902)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!903 = !DISubroutineType(types: !904)
!904 = !{!212, !766, !796, !185, !837}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "Mtftp4", scope: !305, file: !304, line: 123, baseType: !906, size: 64, offset: 1088)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64)
!907 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_PROTOCOL", file: !908, line: 25, baseType: !909)
!908 = !DIFile(filename: "MdePkg/Include/Protocol/Mtftp4.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "c9a1c8f575ac713db30924bf8cbd8b17")
!909 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_MTFTP4_PROTOCOL", file: !908, line: 499, size: 512, elements: !910)
!910 = !{!911, !938, !944, !1018, !1024, !1055, !1057, !1059}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "GetModeData", scope: !909, file: !908, line: 500, baseType: !912, size: 64)
!912 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_GET_MODE_DATA", file: !908, line: 263, baseType: !913)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!914 = !DISubroutineType(types: !915)
!915 = !{!212, !906, !916}
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_MODE_DATA", file: !908, line: 164, baseType: !918)
!918 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_MTFTP4_MODE_DATA", file: !908, line: 158, size: 448, elements: !919)
!919 = !{!920, !933, !934, !936, !937}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "ConfigData", scope: !918, file: !908, line: 159, baseType: !921, size: 208)
!921 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_CONFIG_DATA", file: !908, line: 156, baseType: !922)
!922 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_MTFTP4_CONFIG_DATA", file: !908, line: 146, size: 208, elements: !923)
!923 = !{!924, !925, !926, !927, !928, !929, !930, !931, !932}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultSetting", scope: !922, file: !908, line: 147, baseType: !146, size: 8)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "StationIp", scope: !922, file: !908, line: 148, baseType: !163, size: 32, offset: 8)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "SubnetMask", scope: !922, file: !908, line: 149, baseType: !163, size: 32, offset: 40)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "LocalPort", scope: !922, file: !908, line: 150, baseType: !158, size: 16, offset: 80)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "GatewayIp", scope: !922, file: !908, line: 151, baseType: !163, size: 32, offset: 96)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "ServerIp", scope: !922, file: !908, line: 152, baseType: !163, size: 32, offset: 128)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "InitialServerPort", scope: !922, file: !908, line: 153, baseType: !158, size: 16, offset: 160)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "TryCount", scope: !922, file: !908, line: 154, baseType: !158, size: 16, offset: 176)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "TimeoutValue", scope: !922, file: !908, line: 155, baseType: !158, size: 16, offset: 192)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "SupportedOptionCount", scope: !918, file: !908, line: 160, baseType: !138, size: 8, offset: 208)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "SupportedOptoins", scope: !918, file: !908, line: 161, baseType: !935, size: 64, offset: 256)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "UnsupportedOptionCount", scope: !918, file: !908, line: 162, baseType: !138, size: 8, offset: 320)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "UnsupportedOptoins", scope: !918, file: !908, line: 163, baseType: !935, size: 64, offset: 384)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "Configure", scope: !909, file: !908, line: 501, baseType: !939, size: 64, offset: 64)
!939 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_CONFIGURE", file: !908, line: 292, baseType: !940)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64)
!941 = !DISubroutineType(types: !942)
!942 = !{!212, !906, !943}
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "GetInfo", scope: !909, file: !908, line: 502, baseType: !945, size: 64, offset: 128)
!945 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_GET_INFO", file: !908, line: 343, baseType: !946)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!947 = !DISubroutineType(types: !948)
!948 = !{!212, !906, !949, !231, !231, !138, !958, !185, !964}
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_OVERRIDE_DATA", file: !908, line: 172, baseType: !951)
!951 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_MTFTP4_OVERRIDE_DATA", file: !908, line: 166, size: 112, elements: !952)
!952 = !{!953, !954, !955, !956, !957}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "GatewayIp", scope: !951, file: !908, line: 167, baseType: !163, size: 32)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "ServerIp", scope: !951, file: !908, line: 168, baseType: !163, size: 32, offset: 32)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "ServerPort", scope: !951, file: !908, line: 169, baseType: !158, size: 16, offset: 64)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "TryCount", scope: !951, file: !908, line: 170, baseType: !158, size: 16, offset: 80)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "TimeoutValue", scope: !951, file: !908, line: 171, baseType: !158, size: 16, offset: 96)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!959 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_OPTION", file: !908, line: 144, baseType: !960)
!960 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_MTFTP4_OPTION", file: !908, line: 141, size: 128, elements: !961)
!961 = !{!962, !963}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "OptionStr", scope: !960, file: !908, line: 142, baseType: !231, size: 64)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "ValueStr", scope: !960, file: !908, line: 143, baseType: !231, size: 64, offset: 64)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_PACKET", file: !908, line: 134, baseType: !967)
!967 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "EFI_MTFTP4_PACKET", file: !908, line: 97, size: 88, elements: !968)
!968 = !{!969, !970, !976, !977, !983, !990, !997, !1004, !1011}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "OpCode", scope: !967, file: !908, line: 101, baseType: !158, size: 16)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "Rrq", scope: !967, file: !908, line: 105, baseType: !971, size: 24)
!971 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_REQ_HEADER", file: !908, line: 62, baseType: !972)
!972 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_MTFTP4_REQ_HEADER", file: !908, line: 59, size: 24, elements: !973)
!973 = !{!974, !975}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "OpCode", scope: !972, file: !908, line: 60, baseType: !158, size: 16)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "Filename", scope: !972, file: !908, line: 61, baseType: !143, size: 8, offset: 16)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "Wrq", scope: !967, file: !908, line: 109, baseType: !971, size: 24)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "Oack", scope: !967, file: !908, line: 113, baseType: !978, size: 24)
!978 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_OACK_HEADER", file: !908, line: 67, baseType: !979)
!979 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_MTFTP4_OACK_HEADER", file: !908, line: 64, size: 24, elements: !980)
!980 = !{!981, !982}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "OpCode", scope: !979, file: !908, line: 65, baseType: !158, size: 16)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !979, file: !908, line: 66, baseType: !143, size: 8, offset: 16)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !967, file: !908, line: 117, baseType: !984, size: 40)
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_DATA_HEADER", file: !908, line: 73, baseType: !985)
!985 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_MTFTP4_DATA_HEADER", file: !908, line: 69, size: 40, elements: !986)
!986 = !{!987, !988, !989}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "OpCode", scope: !985, file: !908, line: 70, baseType: !158, size: 16)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "Block", scope: !985, file: !908, line: 71, baseType: !158, size: 16, offset: 16)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !985, file: !908, line: 72, baseType: !143, size: 8, offset: 32)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "Ack", scope: !967, file: !908, line: 121, baseType: !991, size: 32)
!991 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_ACK_HEADER", file: !908, line: 78, baseType: !992)
!992 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_MTFTP4_ACK_HEADER", file: !908, line: 75, size: 32, elements: !993)
!993 = !{!994, !995}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "OpCode", scope: !992, file: !908, line: 76, baseType: !158, size: 16)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "Block", scope: !992, file: !908, line: 77, baseType: !996, size: 16, offset: 16)
!996 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 16, elements: !144)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "Data8", scope: !967, file: !908, line: 125, baseType: !998, size: 88)
!998 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_DATA8_HEADER", file: !908, line: 84, baseType: !999)
!999 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_MTFTP4_DATA8_HEADER", file: !908, line: 80, size: 88, elements: !1000)
!1000 = !{!1001, !1002, !1003}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "OpCode", scope: !999, file: !908, line: 81, baseType: !158, size: 16)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "Block", scope: !999, file: !908, line: 82, baseType: !150, size: 64, offset: 16)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !999, file: !908, line: 83, baseType: !143, size: 8, offset: 80)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "Ack8", scope: !967, file: !908, line: 129, baseType: !1005, size: 80)
!1005 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_ACK8_HEADER", file: !908, line: 89, baseType: !1006)
!1006 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_MTFTP4_ACK8_HEADER", file: !908, line: 86, size: 80, elements: !1007)
!1007 = !{!1008, !1009}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "OpCode", scope: !1006, file: !908, line: 87, baseType: !158, size: 16)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "Block", scope: !1006, file: !908, line: 88, baseType: !1010, size: 64, offset: 16)
!1010 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 64, elements: !144)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "Error", scope: !967, file: !908, line: 133, baseType: !1012, size: 40)
!1012 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_ERROR_HEADER", file: !908, line: 95, baseType: !1013)
!1013 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_MTFTP4_ERROR_HEADER", file: !908, line: 91, size: 40, elements: !1014)
!1014 = !{!1015, !1016, !1017}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "OpCode", scope: !1013, file: !908, line: 92, baseType: !158, size: 16)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "ErrorCode", scope: !1013, file: !908, line: 93, baseType: !158, size: 16, offset: 16)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "ErrorMessage", scope: !1013, file: !908, line: 94, baseType: !143, size: 8, offset: 32)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "ParseOptions", scope: !909, file: !908, line: 503, baseType: !1019, size: 64, offset: 192)
!1019 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_PARSE_OPTIONS", file: !908, line: 378, baseType: !1020)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64)
!1021 = !DISubroutineType(types: !1022)
!1022 = !{!212, !906, !186, !965, !185, !1023}
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64)
