; ModuleID = './bcfiles/PxeBcDhcp6.bc'
source_filename = "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main/NetworkPkg/UefiPxeBcDxe/PxeBcDhcp6.c"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-windows-gnu"

%struct.IPv6_ADDRESS = type { [16 x i8] }
%struct.GUID = type { i32, i16, i16, [8 x i8] }

!65 = !DIEnumerator(name: "Dhcp6Requesting", value: 2)
!66 = !DIEnumerator(name: "Dhcp6Declining", value: 3)
!67 = !DIEnumerator(name: "Dhcp6Confirming", value: 4)
!68 = !DIEnumerator(name: "Dhcp6Releasing", value: 5)
!69 = !DIEnumerator(name: "Dhcp6Bound", value: 6)
!70 = !DIEnumerator(name: "Dhcp6Renewing", value: 7)
!71 = !DIEnumerator(name: "Dhcp6Rebinding", value: 8)
!72 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !61, line: 76, baseType: !7, size: 32, elements: !73)
!73 = !{!74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84}
!74 = !DIEnumerator(name: "Dhcp6SendSolicit", value: 0)
!75 = !DIEnumerator(name: "Dhcp6RcvdAdvertise", value: 1)
!76 = !DIEnumerator(name: "Dhcp6SelectAdvertise", value: 2)
!77 = !DIEnumerator(name: "Dhcp6SendRequest", value: 3)
!78 = !DIEnumerator(name: "Dhcp6RcvdReply", value: 4)
!79 = !DIEnumerator(name: "Dhcp6RcvdReconfigure", value: 5)
!80 = !DIEnumerator(name: "Dhcp6SendDecline", value: 6)
!81 = !DIEnumerator(name: "Dhcp6SendConfirm", value: 7)
!82 = !DIEnumerator(name: "Dhcp6SendRelease", value: 8)
!83 = !DIEnumerator(name: "Dhcp6EnterRenewing", value: 9)
!84 = !DIEnumerator(name: "Dhcp6EnterRebinding", value: 10)
!85 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !86, line: 192, baseType: !7, size: 32, elements: !87)
!86 = !DIFile(filename: "MdePkg/Include/Protocol/PxeBaseCode.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "5c81517a25a11d0772fd25cf3f99822b")
!87 = !{!88, !89, !90, !91, !92, !93, !94, !95, !96}
!88 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_TFTP_FIRST", value: 0)
!89 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_TFTP_GET_FILE_SIZE", value: 1)
!90 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_TFTP_READ_FILE", value: 2)
!91 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_TFTP_WRITE_FILE", value: 3)
!92 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_TFTP_READ_DIRECTORY", value: 4)
!93 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_MTFTP_GET_FILE_SIZE", value: 5)
!94 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_MTFTP_READ_FILE", value: 6)
!95 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_MTFTP_READ_DIRECTORY", value: 7)
!96 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_MTFTP_LAST", value: 8)
!97 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !98, line: 63, baseType: !7, size: 32, elements: !99)
!98 = !DIFile(filename: "MdePkg/Include/Protocol/PxeBaseCodeCallBack.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "620f8d98f32292d4cb970381b3122ad5")
!99 = !{!100, !101, !102, !103}
!100 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_CALLBACK_STATUS_FIRST", value: 0)
!101 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_CALLBACK_STATUS_CONTINUE", value: 1)
!102 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_CALLBACK_STATUS_ABORT", value: 2)
!103 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_CALLBACK_STATUS_LAST", value: 3)
!104 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !98, line: 48, baseType: !7, size: 32, elements: !105)
!105 = !{!106, !107, !108, !109, !110, !111, !112, !113, !114}
!106 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_FUNCTION_FIRST", value: 0)
!107 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_FUNCTION_DHCP", value: 1)
!108 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_FUNCTION_DISCOVER", value: 2)
!109 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_FUNCTION_MTFTP", value: 3)
!110 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_FUNCTION_UDP_WRITE", value: 4)
!111 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_FUNCTION_UDP_READ", value: 5)
!112 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_FUNCTION_ARP", value: 6)
!113 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_FUNCTION_IGMP", value: 7)
!114 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_PXE_FUNCTION_LAST", value: 8)
!115 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !116, line: 71, baseType: !7, size: 32, elements: !117)
!116 = !DIFile(filename: "NetworkPkg/UefiPxeBcDxe/PxeBcDhcp4.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "71d8c6a5b4dce053943495bbd9962c1e")
!117 = !{!118, !119, !120, !121, !122, !123, !124, !125, !126}
!118 = !DIEnumerator(name: "PxeOfferTypeDhcpOnly", value: 0)
!119 = !DIEnumerator(name: "PxeOfferTypeDhcpPxe10", value: 1)
!120 = !DIEnumerator(name: "PxeOfferTypeDhcpWfm11a", value: 2)
!121 = !DIEnumerator(name: "PxeOfferTypeDhcpBinl", value: 3)
!122 = !DIEnumerator(name: "PxeOfferTypeProxyPxe10", value: 4)
!123 = !DIEnumerator(name: "PxeOfferTypeProxyWfm11a", value: 5)
!124 = !DIEnumerator(name: "PxeOfferTypeProxyBinl", value: 6)
!125 = !DIEnumerator(name: "PxeOfferTypeBootp", value: 7)
!126 = !DIEnumerator(name: "PxeOfferTypeMax", value: 8)
!127 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !50, line: 154, baseType: !7, size: 32, elements: !128)
!128 = !{!129, !130}
!129 = !DIEnumerator(name: "Ip6ConfigPolicyManual", value: 0)
!130 = !DIEnumerator(name: "Ip6ConfigPolicyAutomatic", value: 1)
!131 = !{!132, !147, !156, !137, !157, !164, !165, !170, !201, !206, !209, !210, !211, !203, !143, !214, !175, !215, !1909}
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP6_PACKET_OPTION", file: !61, line: 160, baseType: !134)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_DHCP6_PACKET_OPTION", file: !61, line: 146, size: 40, elements: !135)
!135 = !{!136, !140, !141}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "OpCode", scope: !134, file: !61, line: 150, baseType: !137, size: 16)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT16", file: !138, line: 178, baseType: !139)
!138 = !DIFile(filename: "MdePkg/Include/X64/ProcessorBind.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "ef2524a221fe61206fa09ec88dd4f59b")
!139 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "OpLen", scope: !134, file: !61, line: 155, baseType: !137, size: 16, offset: 16)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !134, file: !61, line: 159, baseType: !142, size: 8, offset: 32)
!142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 8, elements: !145)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT8", file: !138, line: 196, baseType: !144)
!144 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!145 = !{!146}
!146 = !DISubrange(count: 1)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "PXEBC_DHCP6_OPTION_ORO", file: !149, line: 52, baseType: !150)
!149 = !DIFile(filename: "NetworkPkg/UefiPxeBcDxe/PxeBcDhcp6.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "56ad806feadb25b5927ba8e46c50f573")
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PXEBC_DHCP6_OPTION_ORO", file: !149, line: 50, size: 4096, elements: !151)
!151 = !{!152}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "OpCode", scope: !150, file: !149, line: 51, baseType: !153, size: 4096)
!153 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 4096, elements: !154)
!154 = !{!155}
!155 = !DISubrange(count: 256)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "PXEBC_DHCP6_OPTION_UNDI", file: !149, line: 58, baseType: !159)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PXEBC_DHCP6_OPTION_UNDI", file: !149, line: 54, size: 24, elements: !160)
!160 = !{!161, !162, !163}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !159, file: !149, line: 55, baseType: !143, size: 8)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "MajorVer", scope: !159, file: !149, line: 56, baseType: !143, size: 8, offset: 8)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "MinorVer", scope: !159, file: !149, line: 57, baseType: !143, size: 8, offset: 16)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "PXEBC_DHCP6_OPTION_ARCH", file: !149, line: 62, baseType: !167)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PXEBC_DHCP6_OPTION_ARCH", file: !149, line: 60, size: 16, elements: !168)
!168 = !{!169}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !167, file: !149, line: 61, baseType: !137, size: 16)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "PXEBC_DHCP6_OPTION_VENDOR_CLASS", file: !149, line: 79, baseType: !172)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PXEBC_DHCP6_OPTION_VENDOR_CLASS", file: !149, line: 75, size: 304, elements: !173)
!173 = !{!174, !176, !177}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "Vendor", scope: !172, file: !149, line: 76, baseType: !175, size: 32)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT32", file: !138, line: 170, baseType: !7)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "ClassLen", scope: !172, file: !149, line: 77, baseType: !137, size: 16, offset: 32)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "ClassId", scope: !172, file: !149, line: 78, baseType: !178, size: 256, offset: 48)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "PXEBC_CLASS_ID", file: !149, line: 73, baseType: !179)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PXEBC_CLASS_ID", file: !149, line: 64, size: 256, elements: !180)
!180 = !{!181, !185, !189, !190, !191, !195, !196, !200}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "ClassIdentifier", scope: !179, file: !149, line: 65, baseType: !182, size: 80)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 80, elements: !183)
!183 = !{!184}
!184 = !DISubrange(count: 10)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "ArchitecturePrefix", scope: !179, file: !149, line: 66, baseType: !186, size: 40, offset: 80)
!186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 40, elements: !187)
!187 = !{!188}
!188 = !DISubrange(count: 5)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "ArchitectureType", scope: !179, file: !149, line: 67, baseType: !186, size: 40, offset: 120)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "Lit3", scope: !179, file: !149, line: 68, baseType: !142, size: 8, offset: 160)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "InterfaceName", scope: !179, file: !149, line: 69, baseType: !192, size: 32, offset: 168)
!192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 32, elements: !193)
!193 = !{!194}
!194 = !DISubrange(count: 4)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "Lit4", scope: !179, file: !149, line: 70, baseType: !142, size: 8, offset: 200)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "UndiMajor", scope: !179, file: !149, line: 71, baseType: !197, size: 24, offset: 208)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 24, elements: !198)
!198 = !{!199}
!199 = !DISubrange(count: 3)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "UndiMinor", scope: !179, file: !149, line: 72, baseType: !197, size: 24, offset: 232)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "RETURN_STATUS", file: !202, line: 1026, baseType: !203)
!202 = !DIFile(filename: "MdePkg/Include/Base.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "0c11ea3d1992443d8a8f590a064e50ff")
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINTN", file: !138, line: 211, baseType: !204)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT64", file: !138, line: 162, baseType: !205)
!205 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTN", file: !138, line: 216, baseType: !207)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT64", file: !138, line: 166, baseType: !208)
!208 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "BOOLEAN", file: !138, line: 192, baseType: !144)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHAR8", file: !138, line: 200, baseType: !213)
!213 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "PXEBC_PRIVATE_DATA", file: !217, line: 52, baseType: !218)
!217 = !DIFile(filename: "NetworkPkg/UefiPxeBcDxe/PxeBcImpl.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "97799bc64a49caaa653ce382cd21c883")
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PXEBC_PRIVATE_DATA", file: !217, line: 101, size: 352960, elements: !219)
!219 = !{!220, !221, !224, !225, !230, !385, !416, !417, !418, !419, !420, !421, !422, !423, !486, !671, !694, !839, !998, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1275, !1298, !1424, !1574, !1667, !1668, !1785, !1802, !2033, !2046, !2047, !2048, !2049, !2050, !2051, !2052, !2053, !2054, !2055, !2056, !2057, !2058, !2059, !2060, !2061, !2062, !2063, !2064, !2065, !2066, !2067, !2068, !2069, !2070, !2071, !2072, !2073, !2074, !2075, !2076, !2077, !2078, !2191, !2192, !2193, !2194, !2195, !2196, !2197, !2199, !2200, !2201}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", scope: !218, file: !217, line: 102, baseType: !175, size: 32)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "Controller", scope: !218, file: !217, line: 103, baseType: !222, size: 64, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_HANDLE", file: !223, line: 33, baseType: !164)
!223 = !DIFile(filename: "MdePkg/Include/Uefi/UefiBaseType.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "dbec48e65949dff122bc920c9d9d9c6a")
!224 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !218, file: !217, line: 104, baseType: !222, size: 64, offset: 128)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "Id", scope: !218, file: !217, line: 106, baseType: !226, size: 64, offset: 192)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "PXEBC_PRIVATE_PROTOCOL", file: !217, line: 53, baseType: !227)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PXEBC_PRIVATE_PROTOCOL", file: !217, line: 89, size: 64, elements: !228)
!228 = !{!229}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved", scope: !227, file: !217, line: 90, baseType: !204, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "Snp", scope: !218, file: !217, line: 107, baseType: !231, size: 64, offset: 256)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_NETWORK_PROTOCOL", file: !233, line: 28, baseType: !234)
!233 = !DIFile(filename: "MdePkg/Include/Protocol/SimpleNetwork.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "ce4888de327acb559b98965e4f2a0a5b")
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_SIMPLE_NETWORK_PROTOCOL", file: !233, line: 643, size: 1024, elements: !235)
!235 = !{!236, !237, !243, !245, !250, !255, !257, !270, !275, !311, !337, !342, !348, !353, !358, !360}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "Revision", scope: !234, file: !233, line: 649, baseType: !204, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "Start", scope: !234, file: !233, line: 650, baseType: !238, size: 64, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_NETWORK_START", file: !233, line: 262, baseType: !239)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{!242, !231}
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_STATUS", file: !223, line: 29, baseType: !201)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "Stop", scope: !234, file: !233, line: 651, baseType: !244, size: 64, offset: 128)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_NETWORK_STOP", file: !233, line: 280, baseType: !239)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "Initialize", scope: !234, file: !233, line: 652, baseType: !246, size: 64, offset: 192)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_NETWORK_INITIALIZE", file: !233, line: 312, baseType: !247)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DISubroutineType(types: !249)
!249 = !{!242, !231, !203, !203}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "Reset", scope: !234, file: !233, line: 653, baseType: !251, size: 64, offset: 256)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_NETWORK_RESET", file: !233, line: 336, baseType: !252)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DISubroutineType(types: !254)
!254 = !{!242, !231, !210}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "Shutdown", scope: !234, file: !233, line: 654, baseType: !256, size: 64, offset: 320)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_NETWORK_SHUTDOWN", file: !233, line: 356, baseType: !239)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "ReceiveFilters", scope: !234, file: !233, line: 655, baseType: !258, size: 64, offset: 384)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_NETWORK_RECEIVE_FILTERS", file: !233, line: 386, baseType: !259)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DISubroutineType(types: !261)
!261 = !{!242, !231, !175, !175, !210, !203, !262}
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MAC_ADDRESS", file: !223, line: 97, baseType: !264)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_MAC_ADDRESS", file: !223, line: 95, size: 256, elements: !265)
!265 = !{!266}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "Addr", scope: !264, file: !223, line: 96, baseType: !267, size: 256)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 256, elements: !268)
!268 = !{!269}
!269 = !DISubrange(count: 32)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "StationAddress", scope: !234, file: !233, line: 656, baseType: !271, size: 64, offset: 448)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_NETWORK_STATION_ADDRESS", file: !233, line: 412, baseType: !272)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DISubroutineType(types: !274)
!274 = !{!242, !231, !210, !262}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "Statistics", scope: !234, file: !233, line: 657, baseType: !276, size: 64, offset: 512)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_NETWORK_STATISTICS", file: !233, line: 441, baseType: !277)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DISubroutineType(types: !279)
!279 = !{!242, !231, !210, !280, !281}
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_NETWORK_STATISTICS", file: !233, line: 136, baseType: !283)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_NETWORK_STATISTICS", file: !233, line: 38, size: 1664, elements: !284)
!284 = !{!285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "RxTotalFrames", scope: !283, file: !233, line: 43, baseType: !204, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "RxGoodFrames", scope: !283, file: !233, line: 48, baseType: !204, size: 64, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "RxUndersizeFrames", scope: !283, file: !233, line: 54, baseType: !204, size: 64, offset: 128)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "RxOversizeFrames", scope: !283, file: !233, line: 60, baseType: !204, size: 64, offset: 192)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "RxDroppedFrames", scope: !283, file: !233, line: 65, baseType: !204, size: 64, offset: 256)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "RxUnicastFrames", scope: !283, file: !233, line: 70, baseType: !204, size: 64, offset: 320)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "RxBroadcastFrames", scope: !283, file: !233, line: 75, baseType: !204, size: 64, offset: 384)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "RxMulticastFrames", scope: !283, file: !233, line: 80, baseType: !204, size: 64, offset: 448)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "RxCrcErrorFrames", scope: !283, file: !233, line: 85, baseType: !204, size: 64, offset: 512)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "RxTotalBytes", scope: !283, file: !233, line: 91, baseType: !204, size: 64, offset: 576)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "TxTotalFrames", scope: !283, file: !233, line: 96, baseType: !204, size: 64, offset: 640)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "TxGoodFrames", scope: !283, file: !233, line: 97, baseType: !204, size: 64, offset: 704)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "TxUndersizeFrames", scope: !283, file: !233, line: 98, baseType: !204, size: 64, offset: 768)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "TxOversizeFrames", scope: !283, file: !233, line: 99, baseType: !204, size: 64, offset: 832)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "TxDroppedFrames", scope: !283, file: !233, line: 100, baseType: !204, size: 64, offset: 896)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "TxUnicastFrames", scope: !283, file: !233, line: 101, baseType: !204, size: 64, offset: 960)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "TxBroadcastFrames", scope: !283, file: !233, line: 102, baseType: !204, size: 64, offset: 1024)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "TxMulticastFrames", scope: !283, file: !233, line: 103, baseType: !204, size: 64, offset: 1088)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "TxCrcErrorFrames", scope: !283, file: !233, line: 104, baseType: !204, size: 64, offset: 1152)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "TxTotalBytes", scope: !283, file: !233, line: 105, baseType: !204, size: 64, offset: 1216)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "Collisions", scope: !283, file: !233, line: 110, baseType: !204, size: 64, offset: 1280)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "UnsupportedProtocol", scope: !283, file: !233, line: 115, baseType: !204, size: 64, offset: 1344)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "RxDuplicatedFrames", scope: !283, file: !233, line: 120, baseType: !204, size: 64, offset: 1408)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "RxDecryptErrorFrames", scope: !283, file: !233, line: 125, baseType: !204, size: 64, offset: 1472)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "TxErrorFrames", scope: !283, file: !233, line: 130, baseType: !204, size: 64, offset: 1536)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "TxRetryFrames", scope: !283, file: !233, line: 135, baseType: !204, size: 64, offset: 1600)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "MCastIpToMac", scope: !234, file: !233, line: 658, baseType: !312, size: 64, offset: 576)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_NETWORK_MCAST_IP_TO_MAC", file: !233, line: 471, baseType: !313)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DISubroutineType(types: !315)
!315 = !{!242, !231, !210, !316, !262}
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP_ADDRESS", file: !223, line: 107, baseType: !318)
!318 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "EFI_IP_ADDRESS", file: !223, line: 103, size: 128, elements: !319)
!319 = !{!320, !322, !328}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "Addr", scope: !318, file: !223, line: 104, baseType: !321, size: 128)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !175, size: 128, elements: !193)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !318, file: !223, line: 105, baseType: !323, size: 32)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IPv4_ADDRESS", file: !223, line: 85, baseType: !324)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPv4_ADDRESS", file: !202, line: 225, baseType: !325)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IPv4_ADDRESS", file: !202, line: 223, size: 32, elements: !326)
!326 = !{!327}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "Addr", scope: !325, file: !202, line: 224, baseType: !192, size: 32)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !318, file: !223, line: 106, baseType: !329, size: 128)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IPv6_ADDRESS", file: !223, line: 90, baseType: !330)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPv6_ADDRESS", file: !202, line: 232, baseType: !331)
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IPv6_ADDRESS", file: !202, line: 230, size: 128, elements: !332)
!332 = !{!333}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "Addr", scope: !331, file: !202, line: 231, baseType: !334, size: 128)
!334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 128, elements: !335)
!335 = !{!336}
!336 = !DISubrange(count: 16)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "NvData", scope: !234, file: !233, line: 659, baseType: !338, size: 64, offset: 640)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_NETWORK_NVDATA", file: !233, line: 500, baseType: !339)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DISubroutineType(types: !341)
!341 = !{!242, !231, !210, !203, !203, !164}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "GetStatus", scope: !234, file: !233, line: 660, baseType: !343, size: 64, offset: 704)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_NETWORK_GET_STATUS", file: !233, line: 535, baseType: !344)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DISubroutineType(types: !346)
!346 = !{!242, !231, !347, !209}
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "Transmit", scope: !234, file: !233, line: 661, baseType: !349, size: 64, offset: 768)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_NETWORK_TRANSMIT", file: !233, line: 576, baseType: !350)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DISubroutineType(types: !352)
!352 = !{!242, !231, !203, !203, !164, !262, !262, !214}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "Receive", scope: !234, file: !233, line: 662, baseType: !354, size: 64, offset: 832)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_NETWORK_RECEIVE", file: !233, line: 620, baseType: !355)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DISubroutineType(types: !357)
!357 = !{!242, !231, !280, !280, !164, !262, !262, !214}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "WaitForPacket", scope: !234, file: !233, line: 666, baseType: !359, size: 64, offset: 896)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_EVENT", file: !223, line: 37, baseType: !164)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "Mode", scope: !234, file: !233, line: 670, baseType: !361, size: 64, offset: 960)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_NETWORK_MODE", file: !233, line: 242, baseType: !363)
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_SIMPLE_NETWORK_MODE", file: !233, line: 162, size: 5248, elements: !364)
!364 = !{!365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !377, !378, !379, !380, !381, !382, !383, !384}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "State", scope: !363, file: !233, line: 166, baseType: !175, size: 32)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "HwAddressSize", scope: !363, file: !233, line: 170, baseType: !175, size: 32, offset: 32)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "MediaHeaderSize", scope: !363, file: !233, line: 174, baseType: !175, size: 32, offset: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "MaxPacketSize", scope: !363, file: !233, line: 178, baseType: !175, size: 32, offset: 96)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "NvRamSize", scope: !363, file: !233, line: 182, baseType: !175, size: 32, offset: 128)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "NvRamAccessSize", scope: !363, file: !233, line: 189, baseType: !175, size: 32, offset: 160)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "ReceiveFilterMask", scope: !363, file: !233, line: 193, baseType: !175, size: 32, offset: 192)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "ReceiveFilterSetting", scope: !363, file: !233, line: 197, baseType: !175, size: 32, offset: 224)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "MaxMCastFilterCount", scope: !363, file: !233, line: 201, baseType: !175, size: 32, offset: 256)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "MCastFilterCount", scope: !363, file: !233, line: 205, baseType: !175, size: 32, offset: 288)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "MCastFilter", scope: !363, file: !233, line: 209, baseType: !376, size: 4096, offset: 320)
!376 = !DICompositeType(tag: DW_TAG_array_type, baseType: !263, size: 4096, elements: !335)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "CurrentAddress", scope: !363, file: !233, line: 213, baseType: !263, size: 256, offset: 4416)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "BroadcastAddress", scope: !363, file: !233, line: 217, baseType: !263, size: 256, offset: 4672)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "PermanentAddress", scope: !363, file: !233, line: 221, baseType: !263, size: 256, offset: 4928)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "IfType", scope: !363, file: !233, line: 225, baseType: !143, size: 8, offset: 5184)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "MacAddressChangeable", scope: !363, file: !233, line: 229, baseType: !210, size: 8, offset: 5192)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "MultipleTxSupported", scope: !363, file: !233, line: 233, baseType: !210, size: 8, offset: 5200)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "MediaPresentSupported", scope: !363, file: !233, line: 237, baseType: !210, size: 8, offset: 5208)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "MediaPresent", scope: !363, file: !233, line: 241, baseType: !210, size: 8, offset: 5216)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "Ip4Nic", scope: !218, file: !217, line: 109, baseType: !386, size: 64, offset: 320)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "PXEBC_VIRTUAL_NIC", file: !217, line: 54, baseType: !388)
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PXEBC_VIRTUAL_NIC", file: !217, line: 93, size: 320, elements: !389)
!389 = !{!390, !391, !392, !414, !415}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", scope: !388, file: !217, line: 94, baseType: !175, size: 32)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "Controller", scope: !388, file: !217, line: 95, baseType: !222, size: 64, offset: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "LoadFile", scope: !388, file: !217, line: 96, baseType: !393, size: 64, offset: 128)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_LOAD_FILE_PROTOCOL", file: !394, line: 28, baseType: !395)
!394 = !DIFile(filename: "MdePkg/Include/Protocol/LoadFile.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "15734a5f551782ac503b5b1cf42f1c66")
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_LOAD_FILE_PROTOCOL", file: !394, line: 76, size: 64, elements: !396)
!396 = !{!397}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "LoadFile", scope: !395, file: !394, line: 77, baseType: !398, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_LOAD_FILE", file: !394, line: 65, baseType: !399)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DISubroutineType(types: !401)
!401 = !{!242, !402, !403, !210, !280, !164}
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DEVICE_PATH_PROTOCOL", file: !405, line: 58, baseType: !406)
!405 = !DIFile(filename: "MdePkg/Include/Protocol/DevicePath.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "6b6d593d171f69b933a87911e52d4607")
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_DEVICE_PATH_PROTOCOL", file: !405, line: 43, size: 32, elements: !407)
!407 = !{!408, !409, !410}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !406, file: !405, line: 44, baseType: !143, size: 8)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "SubType", scope: !406, file: !405, line: 51, baseType: !143, size: 8, offset: 8)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !406, file: !405, line: 56, baseType: !411, size: 16, offset: 16)
!411 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 16, elements: !412)
!412 = !{!413}
!413 = !DISubrange(count: 2)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "DevicePath", scope: !388, file: !217, line: 97, baseType: !403, size: 64, offset: 192)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "Private", scope: !388, file: !217, line: 98, baseType: !215, size: 64, offset: 256)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "Ip6Nic", scope: !218, file: !217, line: 110, baseType: !386, size: 64, offset: 384)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "ArpChild", scope: !218, file: !217, line: 112, baseType: !222, size: 64, offset: 448)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "Ip4Child", scope: !218, file: !217, line: 113, baseType: !222, size: 64, offset: 512)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "Dhcp4Child", scope: !218, file: !217, line: 114, baseType: !222, size: 64, offset: 576)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "Mtftp4Child", scope: !218, file: !217, line: 115, baseType: !222, size: 64, offset: 640)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "Udp4ReadChild", scope: !218, file: !217, line: 116, baseType: !222, size: 64, offset: 704)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "Udp4WriteChild", scope: !218, file: !217, line: 117, baseType: !222, size: 64, offset: 768)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "Arp", scope: !218, file: !217, line: 119, baseType: !424, size: 64, offset: 832)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_ARP_PROTOCOL", file: !426, line: 31, baseType: !427)
!426 = !DIFile(filename: "MdePkg/Include/Protocol/Arp.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "8142067718decedafa618d42505fb9b3")
!427 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_ARP_PROTOCOL", file: !426, line: 363, size: 448, elements: !428)
!428 = !{!429, !444, !449, !466, !471, !476, !481}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "Configure", scope: !427, file: !426, line: 364, baseType: !430, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_ARP_CONFIGURE", file: !426, line: 142, baseType: !431)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DISubroutineType(types: !433)
!433 = !{!242, !424, !434}
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_ARP_CONFIG_DATA", file: !426, line: 110, baseType: !436)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_ARP_CONFIG_DATA", file: !426, line: 72, size: 256, elements: !437)
!437 = !{!438, !439, !440, !441, !442, !443}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "SwAddressType", scope: !436, file: !426, line: 76, baseType: !137, size: 16)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "SwAddressLength", scope: !436, file: !426, line: 81, baseType: !143, size: 8, offset: 16)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "StationAddress", scope: !436, file: !426, line: 89, baseType: !164, size: 64, offset: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "EntryTimeOut", scope: !436, file: !426, line: 96, baseType: !175, size: 32, offset: 128)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "RetryCount", scope: !436, file: !426, line: 102, baseType: !175, size: 32, offset: 160)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "RetryTimeOut", scope: !436, file: !426, line: 109, baseType: !175, size: 32, offset: 192)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "Add", scope: !427, file: !426, line: 365, baseType: !445, size: 64, offset: 64)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_ARP_ADD", file: !426, line: 194, baseType: !446)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DISubroutineType(types: !448)
!448 = !{!242, !424, !210, !164, !164, !175, !210}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "Find", scope: !427, file: !426, line: 366, baseType: !450, size: 64, offset: 128)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_ARP_FIND", file: !426, line: 239, baseType: !451)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DISubroutineType(types: !453)
!453 = !{!242, !424, !210, !164, !347, !347, !454, !210}
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_ARP_FIND_DATA", file: !426, line: 70, baseType: !457)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_ARP_FIND_DATA", file: !426, line: 33, size: 96, elements: !458)
!458 = !{!459, !460, !461, !462, !463, !464, !465}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !457, file: !426, line: 37, baseType: !175, size: 32)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "DenyFlag", scope: !457, file: !426, line: 43, baseType: !210, size: 8, offset: 32)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "StaticFlag", scope: !457, file: !426, line: 49, baseType: !210, size: 8, offset: 40)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "HwAddressType", scope: !457, file: !426, line: 54, baseType: !137, size: 16, offset: 48)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "SwAddressType", scope: !457, file: !426, line: 59, baseType: !137, size: 16, offset: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "HwAddressLength", scope: !457, file: !426, line: 64, baseType: !143, size: 8, offset: 80)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "SwAddressLength", scope: !457, file: !426, line: 69, baseType: !143, size: 8, offset: 88)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "Delete", scope: !427, file: !426, line: 367, baseType: !467, size: 64, offset: 192)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_ARP_DELETE", file: !426, line: 268, baseType: !468)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DISubroutineType(types: !470)
!470 = !{!242, !424, !210, !164}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "Flush", scope: !427, file: !426, line: 368, baseType: !472, size: 64, offset: 256)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_ARP_FLUSH", file: !426, line: 288, baseType: !473)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DISubroutineType(types: !475)
!475 = !{!242, !424}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "Request", scope: !427, file: !426, line: 369, baseType: !477, size: 64, offset: 320)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_ARP_REQUEST", file: !426, line: 316, baseType: !478)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DISubroutineType(types: !480)
!480 = !{!242, !424, !164, !359, !164}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "Cancel", scope: !427, file: !426, line: 370, baseType: !482, size: 64, offset: 384)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_ARP_CANCEL", file: !426, line: 353, baseType: !483)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DISubroutineType(types: !485)
!485 = !{!242, !424, !164, !359}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "Ip4", scope: !218, file: !217, line: 120, baseType: !487, size: 64, offset: 896)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_PROTOCOL", file: !489, line: 36, baseType: !490)
!489 = !DIFile(filename: "MdePkg/Include/Protocol/Ip4.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "1ff13a8b379fde89ccc818c3d7035657")
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_IP4_PROTOCOL", file: !489, line: 588, size: 512, elements: !491)
!491 = !{!492, !559, !565, !570, !575, !662, !664, !666}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "GetModeData", scope: !490, file: !489, line: 589, baseType: !493, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_GET_MODE_DATA", file: !489, line: 282, baseType: !494)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DISubroutineType(types: !496)
!496 = !{!242, !497, !499, !544, !361}
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !488)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_MODE_DATA", file: !489, line: 182, baseType: !501)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_IP4_MODE_DATA", file: !489, line: 141, size: 704, elements: !502)
!502 = !{!503, !504, !505, !523, !524, !525, !527, !528, !536, !537}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "IsStarted", scope: !501, file: !489, line: 145, baseType: !210, size: 8)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "MaxPacketSize", scope: !501, file: !489, line: 149, baseType: !175, size: 32, offset: 32)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "ConfigData", scope: !501, file: !489, line: 153, baseType: !506, size: 224, offset: 64)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_CONFIG_DATA", file: !489, line: 128, baseType: !507)
!507 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_IP4_CONFIG_DATA", file: !489, line: 58, size: 224, elements: !508)
!508 = !{!509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "DefaultProtocol", scope: !507, file: !489, line: 63, baseType: !143, size: 8)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "AcceptAnyProtocol", scope: !507, file: !489, line: 69, baseType: !210, size: 8, offset: 8)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "AcceptIcmpErrors", scope: !507, file: !489, line: 74, baseType: !210, size: 8, offset: 16)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "AcceptBroadcast", scope: !507, file: !489, line: 80, baseType: !210, size: 8, offset: 24)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "AcceptPromiscuous", scope: !507, file: !489, line: 86, baseType: !210, size: 8, offset: 32)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultAddress", scope: !507, file: !489, line: 90, baseType: !210, size: 8, offset: 40)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "StationAddress", scope: !507, file: !489, line: 94, baseType: !323, size: 32, offset: 48)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "SubnetMask", scope: !507, file: !489, line: 98, baseType: !323, size: 32, offset: 80)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "TypeOfService", scope: !507, file: !489, line: 102, baseType: !143, size: 8, offset: 112)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "TimeToLive", scope: !507, file: !489, line: 106, baseType: !143, size: 8, offset: 120)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "DoNotFragment", scope: !507, file: !489, line: 110, baseType: !210, size: 8, offset: 128)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "RawData", scope: !507, file: !489, line: 115, baseType: !210, size: 8, offset: 136)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "ReceiveTimeout", scope: !507, file: !489, line: 121, baseType: !175, size: 32, offset: 160)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "TransmitTimeout", scope: !507, file: !489, line: 127, baseType: !175, size: 32, offset: 192)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "IsConfigured", scope: !501, file: !489, line: 157, baseType: !210, size: 8, offset: 288)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "GroupCount", scope: !501, file: !489, line: 161, baseType: !175, size: 32, offset: 320)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "GroupTable", scope: !501, file: !489, line: 165, baseType: !526, size: 64, offset: 384)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "RouteCount", scope: !501, file: !489, line: 169, baseType: !175, size: 32, offset: 448)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "RouteTable", scope: !501, file: !489, line: 173, baseType: !529, size: 64, offset: 512)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_ROUTE_TABLE", file: !489, line: 134, baseType: !531)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_IP4_ROUTE_TABLE", file: !489, line: 130, size: 96, elements: !532)
!532 = !{!533, !534, !535}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "SubnetAddress", scope: !531, file: !489, line: 131, baseType: !323, size: 32)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "SubnetMask", scope: !531, file: !489, line: 132, baseType: !323, size: 32, offset: 32)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "GatewayAddress", scope: !531, file: !489, line: 133, baseType: !323, size: 32, offset: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "IcmpTypeCount", scope: !501, file: !489, line: 177, baseType: !175, size: 32, offset: 576)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "IcmpTypeList", scope: !501, file: !489, line: 181, baseType: !538, size: 64, offset: 640)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_ICMP_TYPE", file: !489, line: 139, baseType: !540)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_IP4_ICMP_TYPE", file: !489, line: 136, size: 16, elements: !541)
!541 = !{!542, !543}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !540, file: !489, line: 137, baseType: !143, size: 8)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "Code", scope: !540, file: !489, line: 138, baseType: !143, size: 8, offset: 8)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MANAGED_NETWORK_CONFIG_DATA", file: !546, line: 84, baseType: !547)
!546 = !DIFile(filename: "MdePkg/Include/Protocol/ManagedNetwork.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "8951452d2c79255944d265d14ed27585")
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_MANAGED_NETWORK_CONFIG_DATA", file: !546, line: 30, size: 160, elements: !548)
!548 = !{!549, !550, !551, !552, !553, !554, !555, !556, !557, !558}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "ReceivedQueueTimeoutValue", scope: !547, file: !546, line: 35, baseType: !175, size: 32)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "TransmitQueueTimeoutValue", scope: !547, file: !546, line: 40, baseType: !175, size: 32, offset: 32)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "ProtocolTypeFilter", scope: !547, file: !546, line: 45, baseType: !137, size: 16, offset: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "EnableUnicastReceive", scope: !547, file: !546, line: 50, baseType: !210, size: 8, offset: 80)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "EnableMulticastReceive", scope: !547, file: !546, line: 55, baseType: !210, size: 8, offset: 88)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "EnableBroadcastReceive", scope: !547, file: !546, line: 60, baseType: !210, size: 8, offset: 96)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "EnablePromiscuousReceive", scope: !547, file: !546, line: 65, baseType: !210, size: 8, offset: 104)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "FlushQueuesOnReset", scope: !547, file: !546, line: 70, baseType: !210, size: 8, offset: 112)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "EnableReceiveTimestamps", scope: !547, file: !546, line: 76, baseType: !210, size: 8, offset: 120)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "DisableBackgroundPolling", scope: !547, file: !546, line: 83, baseType: !210, size: 8, offset: 128)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "Configure", scope: !490, file: !489, line: 590, baseType: !560, size: 64, offset: 64)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_CONFIGURE", file: !489, line: 337, baseType: !561)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DISubroutineType(types: !563)
!563 = !{!242, !487, !564}
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "Groups", scope: !490, file: !489, line: 591, baseType: !566, size: 64, offset: 128)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_GROUPS", file: !489, line: 374, baseType: !567)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DISubroutineType(types: !569)
!569 = !{!242, !487, !210, !526}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "Routes", scope: !490, file: !489, line: 592, baseType: !571, size: 64, offset: 192)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_ROUTES", file: !489, line: 432, baseType: !572)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = !DISubroutineType(types: !574)
!574 = !{!242, !487, !210, !526, !526, !526}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "Transmit", scope: !490, file: !489, line: 593, baseType: !576, size: 64, offset: 256)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_TRANSMIT", file: !489, line: 471, baseType: !577)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = !DISubroutineType(types: !579)
!579 = !{!242, !487, !580}
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_COMPLETION_TOKEN", file: !489, line: 260, baseType: !582)
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_IP4_COMPLETION_TOKEN", file: !489, line: 237, size: 192, elements: !583)
!583 = !{!584, !585, !586, !661}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "Event", scope: !582, file: !489, line: 244, baseType: !359, size: 64)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "Status", scope: !582, file: !489, line: 249, baseType: !242, size: 64, offset: 64)
!586 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !582, file: !489, line: 250, size: 64, elements: !587)
!587 = !{!588, !639}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "RxData", scope: !586, file: !489, line: 254, baseType: !589, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_RECEIVE_DATA", file: !489, line: 216, baseType: !591)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_IP4_RECEIVE_DATA", file: !489, line: 206, size: 640, elements: !592)
!592 = !{!593, !610, !611, !612, !628, !629, !630, !631, !632}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "TimeStamp", scope: !591, file: !489, line: 207, baseType: !594, size: 128)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TIME", file: !223, line: 80, baseType: !595)
!595 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_TIME", file: !223, line: 68, size: 128, elements: !596)
!596 = !{!597, !598, !599, !600, !601, !602, !603, !604, !605, !608, !609}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "Year", scope: !595, file: !223, line: 69, baseType: !137, size: 16)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "Month", scope: !595, file: !223, line: 70, baseType: !143, size: 8, offset: 16)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "Day", scope: !595, file: !223, line: 71, baseType: !143, size: 8, offset: 24)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "Hour", scope: !595, file: !223, line: 72, baseType: !143, size: 8, offset: 32)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "Minute", scope: !595, file: !223, line: 73, baseType: !143, size: 8, offset: 40)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "Second", scope: !595, file: !223, line: 74, baseType: !143, size: 8, offset: 48)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "Pad1", scope: !595, file: !223, line: 75, baseType: !143, size: 8, offset: 56)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "Nanosecond", scope: !595, file: !223, line: 76, baseType: !175, size: 32, offset: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "TimeZone", scope: !595, file: !223, line: 77, baseType: !606, size: 16, offset: 96)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT16", file: !138, line: 187, baseType: !607)
!607 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "Daylight", scope: !595, file: !223, line: 78, baseType: !143, size: 8, offset: 112)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "Pad2", scope: !595, file: !223, line: 79, baseType: !143, size: 8, offset: 120)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "RecycleSignal", scope: !591, file: !489, line: 208, baseType: !359, size: 64, offset: 128)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "HeaderLength", scope: !591, file: !489, line: 209, baseType: !175, size: 32, offset: 192)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "Header", scope: !591, file: !489, line: 210, baseType: !613, size: 64, offset: 256)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_HEADER", file: !489, line: 198, baseType: !615)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_IP4_HEADER", file: !489, line: 186, size: 160, elements: !616)
!616 = !{!617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "HeaderLength", scope: !615, file: !489, line: 187, baseType: !143, size: 4, flags: DIFlagBitField, extraData: i64 0)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "Version", scope: !615, file: !489, line: 188, baseType: !143, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "TypeOfService", scope: !615, file: !489, line: 189, baseType: !143, size: 8, offset: 8)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "TotalLength", scope: !615, file: !489, line: 190, baseType: !137, size: 16, offset: 16)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "Identification", scope: !615, file: !489, line: 191, baseType: !137, size: 16, offset: 32)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "Fragmentation", scope: !615, file: !489, line: 192, baseType: !137, size: 16, offset: 48)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "TimeToLive", scope: !615, file: !489, line: 193, baseType: !143, size: 8, offset: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "Protocol", scope: !615, file: !489, line: 194, baseType: !143, size: 8, offset: 72)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "Checksum", scope: !615, file: !489, line: 195, baseType: !137, size: 16, offset: 80)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "SourceAddress", scope: !615, file: !489, line: 196, baseType: !323, size: 32, offset: 96)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "DestinationAddress", scope: !615, file: !489, line: 197, baseType: !323, size: 32, offset: 128)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "OptionsLength", scope: !591, file: !489, line: 211, baseType: !175, size: 32, offset: 320)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "Options", scope: !591, file: !489, line: 212, baseType: !164, size: 64, offset: 384)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "DataLength", scope: !591, file: !489, line: 213, baseType: !175, size: 32, offset: 448)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "FragmentCount", scope: !591, file: !489, line: 214, baseType: !175, size: 32, offset: 480)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "FragmentTable", scope: !591, file: !489, line: 215, baseType: !633, size: 128, offset: 512)
!633 = !DICompositeType(tag: DW_TAG_array_type, baseType: !634, size: 128, elements: !145)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_FRAGMENT_DATA", file: !489, line: 204, baseType: !635)
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_IP4_FRAGMENT_DATA", file: !489, line: 201, size: 128, elements: !636)
!636 = !{!637, !638}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "FragmentLength", scope: !635, file: !489, line: 202, baseType: !175, size: 32)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "FragmentBuffer", scope: !635, file: !489, line: 203, baseType: !164, size: 64, offset: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "TxData", scope: !586, file: !489, line: 258, baseType: !640, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_TRANSMIT_DATA", file: !489, line: 235, baseType: !642)
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_IP4_TRANSMIT_DATA", file: !489, line: 227, size: 448, elements: !643)
!643 = !{!644, !645, !656, !657, !658, !659, !660}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "DestinationAddress", scope: !642, file: !489, line: 228, baseType: !323, size: 32)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "OverrideData", scope: !642, file: !489, line: 229, baseType: !646, size: 64, offset: 64)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_OVERRIDE_DATA", file: !489, line: 225, baseType: !648)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_IP4_OVERRIDE_DATA", file: !489, line: 218, size: 96, elements: !649)
!649 = !{!650, !651, !652, !653, !654, !655}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "SourceAddress", scope: !648, file: !489, line: 219, baseType: !323, size: 32)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "GatewayAddress", scope: !648, file: !489, line: 220, baseType: !323, size: 32, offset: 32)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "Protocol", scope: !648, file: !489, line: 221, baseType: !143, size: 8, offset: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "TypeOfService", scope: !648, file: !489, line: 222, baseType: !143, size: 8, offset: 72)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "TimeToLive", scope: !648, file: !489, line: 223, baseType: !143, size: 8, offset: 80)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "DoNotFragment", scope: !648, file: !489, line: 224, baseType: !210, size: 8, offset: 88)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "OptionsLength", scope: !642, file: !489, line: 230, baseType: !175, size: 32, offset: 128)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "OptionsBuffer", scope: !642, file: !489, line: 231, baseType: !164, size: 64, offset: 192)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "TotalDataLength", scope: !642, file: !489, line: 232, baseType: !175, size: 32, offset: 256)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "FragmentCount", scope: !642, file: !489, line: 233, baseType: !175, size: 32, offset: 288)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "FragmentTable", scope: !642, file: !489, line: 234, baseType: !633, size: 128, offset: 320)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "Packet", scope: !582, file: !489, line: 259, baseType: !586, size: 64, offset: 128)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "Receive", scope: !490, file: !489, line: 594, baseType: !663, size: 64, offset: 320)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_RECEIVE", file: !489, line: 510, baseType: !577)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "Cancel", scope: !490, file: !489, line: 595, baseType: !665, size: 64, offset: 384)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_CANCEL", file: !489, line: 546, baseType: !577)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "Poll", scope: !490, file: !489, line: 596, baseType: !667, size: 64, offset: 448)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_POLL", file: !489, line: 580, baseType: !668)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = !DISubroutineType(types: !670)
!670 = !{!242, !487}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "Ip4Config2", scope: !218, file: !217, line: 121, baseType: !672, size: 64, offset: 960)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_CONFIG2_PROTOCOL", file: !6, line: 23, baseType: !674)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_IP4_CONFIG2_PROTOCOL", file: !6, line: 307, size: 256, elements: !675)
!675 = !{!676, !682, !687, !692}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "SetData", scope: !674, file: !6, line: 308, baseType: !677, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_CONFIG2_SET_DATA", file: !6, line: 203, baseType: !678)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = !DISubroutineType(types: !680)
!680 = !{!242, !672, !681, !203, !164}
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_CONFIG2_DATA_TYPE", file: !6, line: 76, baseType: !5)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "GetData", scope: !674, file: !6, line: 309, baseType: !683, size: 64, offset: 64)
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_CONFIG2_GET_DATA", file: !6, line: 245, baseType: !684)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DISubroutineType(types: !686)
!686 = !{!242, !672, !681, !280, !164}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "RegisterDataNotify", scope: !674, file: !6, line: 310, baseType: !688, size: 64, offset: 128)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_CONFIG2_REGISTER_NOTIFY", file: !6, line: 274, baseType: !689)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DISubroutineType(types: !691)
!691 = !{!242, !672, !681, !359}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "UnregisterDataNotify", scope: !674, file: !6, line: 311, baseType: !693, size: 64, offset: 192)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_CONFIG2_UNREGISTER_NOTIFY", file: !6, line: 295, baseType: !689)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "Dhcp4", scope: !218, file: !217, line: 122, baseType: !695, size: 64, offset: 1024)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP4_PROTOCOL", file: !16, line: 28, baseType: !697)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_DHCP4_PROTOCOL", file: !16, line: 747, size: 576, elements: !698)
!698 = !{!699, !779, !785, !790, !795, !800, !802, !807, !834}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "GetModeData", scope: !697, file: !16, line: 748, baseType: !700, size: 64)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP4_GET_MODE_DATA", file: !16, line: 421, baseType: !701)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DISubroutineType(types: !703)
!703 = !{!242, !695, !704}
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP4_MODE_DATA", file: !16, line: 338, baseType: !706)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_DHCP4_MODE_DATA", file: !16, line: 297, size: 1152, elements: !707)
!707 = !{!708, !710, !772, !773, !774, !775, !776, !777, !778}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "State", scope: !706, file: !16, line: 301, baseType: !709, size: 32)
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP4_STATE", file: !16, line: 139, baseType: !15)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "ConfigData", scope: !706, file: !16, line: 305, baseType: !711, size: 576, offset: 64)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP4_CONFIG_DATA", file: !16, line: 295, baseType: !712)
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_DHCP4_CONFIG_DATA", file: !16, line: 241, size: 576, elements: !713)
!713 = !{!714, !715, !716, !717, !718, !719, !761, !762, !763}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "DiscoverTryCount", scope: !712, file: !16, line: 247, baseType: !175, size: 32)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "DiscoverTimeout", scope: !712, file: !16, line: 253, baseType: !347, size: 64, offset: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "RequestTryCount", scope: !712, file: !16, line: 259, baseType: !175, size: 32, offset: 128)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "RequestTimeout", scope: !712, file: !16, line: 265, baseType: !347, size: 64, offset: 192)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "ClientAddress", scope: !712, file: !16, line: 273, baseType: !323, size: 32, offset: 256)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "Dhcp4Callback", scope: !712, file: !16, line: 278, baseType: !720, size: 64, offset: 320)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP4_CALLBACK", file: !16, line: 232, baseType: !721)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DISubroutineType(types: !723)
!723 = !{!242, !695, !164, !709, !724, !725, !760}
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP4_EVENT", file: !16, line: 196, baseType: !27)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP4_PACKET", file: !16, line: 95, baseType: !727)
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_DHCP4_PACKET", file: !16, line: 70, size: 1992, elements: !728)
!728 = !{!729, !730, !731, !759}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !727, file: !16, line: 74, baseType: !175, size: 32)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !727, file: !16, line: 79, baseType: !175, size: 32, offset: 32)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !727, file: !16, line: 81, size: 1928, elements: !732)
!732 = !{!733, !757, !758}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "Header", scope: !731, file: !16, line: 85, baseType: !734, size: 1888)
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP4_HEADER", file: !16, line: 66, baseType: !735)
!735 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_DHCP4_HEADER", file: !16, line: 51, size: 1888, elements: !736)
!736 = !{!737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !753}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "OpCode", scope: !735, file: !16, line: 52, baseType: !143, size: 8)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "HwType", scope: !735, file: !16, line: 53, baseType: !143, size: 8, offset: 8)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "HwAddrLen", scope: !735, file: !16, line: 54, baseType: !143, size: 8, offset: 16)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "Hops", scope: !735, file: !16, line: 55, baseType: !143, size: 8, offset: 24)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "Xid", scope: !735, file: !16, line: 56, baseType: !175, size: 32, offset: 32)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "Seconds", scope: !735, file: !16, line: 57, baseType: !137, size: 16, offset: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved", scope: !735, file: !16, line: 58, baseType: !137, size: 16, offset: 80)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "ClientAddr", scope: !735, file: !16, line: 59, baseType: !323, size: 32, offset: 96)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "YourAddr", scope: !735, file: !16, line: 60, baseType: !323, size: 32, offset: 128)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "ServerAddr", scope: !735, file: !16, line: 61, baseType: !323, size: 32, offset: 160)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "GatewayAddr", scope: !735, file: !16, line: 62, baseType: !323, size: 32, offset: 192)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "ClientHwAddr", scope: !735, file: !16, line: 63, baseType: !334, size: 128, offset: 224)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "ServerName", scope: !735, file: !16, line: 64, baseType: !750, size: 512, offset: 352)
!750 = !DICompositeType(tag: DW_TAG_array_type, baseType: !212, size: 512, elements: !751)
!751 = !{!752}
!752 = !DISubrange(count: 64)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "BootFileName", scope: !735, file: !16, line: 65, baseType: !754, size: 1024, offset: 864)
!754 = !DICompositeType(tag: DW_TAG_array_type, baseType: !212, size: 1024, elements: !755)
!755 = !{!756}
!756 = !DISubrange(count: 128)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "Magik", scope: !731, file: !16, line: 89, baseType: !175, size: 32, offset: 1888)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "Option", scope: !731, file: !16, line: 93, baseType: !142, size: 8, offset: 1920)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "Dhcp4", scope: !727, file: !16, line: 94, baseType: !731, size: 1928, offset: 64)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "CallbackContext", scope: !712, file: !16, line: 282, baseType: !164, size: 64, offset: 384)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "OptionCount", scope: !712, file: !16, line: 286, baseType: !175, size: 32, offset: 448)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "OptionList", scope: !712, file: !16, line: 294, baseType: !764, size: 64, offset: 512)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP4_PACKET_OPTION", file: !16, line: 44, baseType: !767)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_DHCP4_PACKET_OPTION", file: !16, line: 31, size: 24, elements: !768)
!768 = !{!769, !770, !771}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "OpCode", scope: !767, file: !16, line: 35, baseType: !143, size: 8)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !767, file: !16, line: 39, baseType: !143, size: 8, offset: 8)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !767, file: !16, line: 43, baseType: !142, size: 8, offset: 16)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "ClientAddress", scope: !706, file: !16, line: 310, baseType: !323, size: 32, offset: 640)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "ClientMacAddress", scope: !706, file: !16, line: 314, baseType: !263, size: 256, offset: 672)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "ServerAddress", scope: !706, file: !16, line: 318, baseType: !323, size: 32, offset: 928)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "RouterAddress", scope: !706, file: !16, line: 323, baseType: !323, size: 32, offset: 960)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "SubnetMask", scope: !706, file: !16, line: 327, baseType: !323, size: 32, offset: 992)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "LeaseTime", scope: !706, file: !16, line: 333, baseType: !175, size: 32, offset: 1024)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "ReplyPacket", scope: !706, file: !16, line: 337, baseType: !725, size: 64, offset: 1088)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "Configure", scope: !697, file: !16, line: 749, baseType: !780, size: 64, offset: 64)
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP4_CONFIGURE", file: !16, line: 476, baseType: !781)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = !DISubroutineType(types: !783)
!783 = !{!242, !695, !784}
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "Start", scope: !697, file: !16, line: 750, baseType: !786, size: 64, offset: 128)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP4_START", file: !16, line: 524, baseType: !787)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = !DISubroutineType(types: !789)
!789 = !{!242, !695, !359}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "RenewRebind", scope: !697, file: !16, line: 751, baseType: !791, size: 64, offset: 192)
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP4_RENEW_REBIND", file: !16, line: 569, baseType: !792)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DISubroutineType(types: !794)
!794 = !{!242, !695, !210, !359}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "Release", scope: !697, file: !16, line: 752, baseType: !796, size: 64, offset: 256)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP4_RELEASE", file: !16, line: 598, baseType: !797)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = !DISubroutineType(types: !799)
!799 = !{!242, !695}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "Stop", scope: !697, file: !16, line: 753, baseType: !801, size: 64, offset: 320)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP4_STOP", file: !16, line: 619, baseType: !797)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "Build", scope: !697, file: !16, line: 754, baseType: !803, size: 64, offset: 384)
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP4_BUILD", file: !16, line: 660, baseType: !804)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DISubroutineType(types: !806)
!806 = !{!242, !695, !725, !175, !156, !175, !764, !760}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "TransmitReceive", scope: !697, file: !16, line: 755, baseType: !808, size: 64, offset: 448)
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP4_TRANSMIT_RECEIVE", file: !16, line: 697, baseType: !809)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DISubroutineType(types: !811)
!811 = !{!242, !695, !812}
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP4_TRANSMIT_RECEIVE_TOKEN", file: !16, line: 404, baseType: !814)
!814 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_DHCP4_TRANSMIT_RECEIVE_TOKEN", file: !16, line: 357, size: 576, elements: !815)
!815 = !{!816, !817, !818, !819, !820, !821, !822, !830, !831, !832, !833}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "Status", scope: !814, file: !16, line: 361, baseType: !242, size: 64)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "CompletionEvent", scope: !814, file: !16, line: 366, baseType: !359, size: 64, offset: 64)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "RemoteAddress", scope: !814, file: !16, line: 370, baseType: !323, size: 32, offset: 128)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "RemotePort", scope: !814, file: !16, line: 374, baseType: !137, size: 16, offset: 160)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "GatewayAddress", scope: !814, file: !16, line: 378, baseType: !323, size: 32, offset: 176)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "ListenPointCount", scope: !814, file: !16, line: 382, baseType: !175, size: 32, offset: 224)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "ListenPoints", scope: !814, file: !16, line: 387, baseType: !823, size: 64, offset: 256)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP4_LISTEN_POINT", file: !16, line: 355, baseType: !825)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_DHCP4_LISTEN_POINT", file: !16, line: 340, size: 80, elements: !826)
!826 = !{!827, !828, !829}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "ListenAddress", scope: !825, file: !16, line: 344, baseType: !323, size: 32)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "SubnetMask", scope: !825, file: !16, line: 349, baseType: !323, size: 32, offset: 32)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "ListenPort", scope: !825, file: !16, line: 354, baseType: !137, size: 16, offset: 64)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "TimeoutValue", scope: !814, file: !16, line: 391, baseType: !175, size: 32, offset: 320)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "Packet", scope: !814, file: !16, line: 395, baseType: !725, size: 64, offset: 384)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "ResponseCount", scope: !814, file: !16, line: 399, baseType: !175, size: 32, offset: 448)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "ResponseList", scope: !814, file: !16, line: 403, baseType: !725, size: 64, offset: 512)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "Parse", scope: !697, file: !16, line: 756, baseType: !835, size: 64, offset: 512)
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP4_PARSE", file: !16, line: 736, baseType: !836)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = !DISubroutineType(types: !838)
!838 = !{!242, !695, !725, !347, !764}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "Mtftp4", scope: !218, file: !217, line: 123, baseType: !840, size: 64, offset: 1088)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_PROTOCOL", file: !842, line: 25, baseType: !843)
!842 = !DIFile(filename: "MdePkg/Include/Protocol/Mtftp4.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "c9a1c8f575ac713db30924bf8cbd8b17")
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_MTFTP4_PROTOCOL", file: !842, line: 499, size: 512, elements: !844)
!844 = !{!845, !872, !878, !952, !958, !989, !991, !993}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "GetModeData", scope: !843, file: !842, line: 500, baseType: !846, size: 64)
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_GET_MODE_DATA", file: !842, line: 263, baseType: !847)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = !DISubroutineType(types: !849)
!849 = !{!242, !840, !850}
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_MODE_DATA", file: !842, line: 164, baseType: !852)
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_MTFTP4_MODE_DATA", file: !842, line: 158, size: 448, elements: !853)
!853 = !{!854, !867, !868, !870, !871}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "ConfigData", scope: !852, file: !842, line: 159, baseType: !855, size: 208)
!855 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_CONFIG_DATA", file: !842, line: 156, baseType: !856)
!856 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_MTFTP4_CONFIG_DATA", file: !842, line: 146, size: 208, elements: !857)
!857 = !{!858, !859, !860, !861, !862, !863, !864, !865, !866}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultSetting", scope: !856, file: !842, line: 147, baseType: !210, size: 8)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "StationIp", scope: !856, file: !842, line: 148, baseType: !323, size: 32, offset: 8)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "SubnetMask", scope: !856, file: !842, line: 149, baseType: !323, size: 32, offset: 40)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "LocalPort", scope: !856, file: !842, line: 150, baseType: !137, size: 16, offset: 80)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "GatewayIp", scope: !856, file: !842, line: 151, baseType: !323, size: 32, offset: 96)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "ServerIp", scope: !856, file: !842, line: 152, baseType: !323, size: 32, offset: 128)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "InitialServerPort", scope: !856, file: !842, line: 153, baseType: !137, size: 16, offset: 160)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "TryCount", scope: !856, file: !842, line: 154, baseType: !137, size: 16, offset: 176)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "TimeoutValue", scope: !856, file: !842, line: 155, baseType: !137, size: 16, offset: 192)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "SupportedOptionCount", scope: !852, file: !842, line: 160, baseType: !143, size: 8, offset: 208)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "SupportedOptoins", scope: !852, file: !842, line: 161, baseType: !869, size: 64, offset: 256)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "UnsupportedOptionCount", scope: !852, file: !842, line: 162, baseType: !143, size: 8, offset: 320)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "UnsupportedOptoins", scope: !852, file: !842, line: 163, baseType: !869, size: 64, offset: 384)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "Configure", scope: !843, file: !842, line: 501, baseType: !873, size: 64, offset: 64)
!873 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_CONFIGURE", file: !842, line: 292, baseType: !874)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!875 = !DISubroutineType(types: !876)
!876 = !{!242, !840, !877}
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "GetInfo", scope: !843, file: !842, line: 502, baseType: !879, size: 64, offset: 128)
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_GET_INFO", file: !842, line: 343, baseType: !880)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!881 = !DISubroutineType(types: !882)
!882 = !{!242, !840, !883, !156, !156, !143, !892, !347, !898}
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!884 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_OVERRIDE_DATA", file: !842, line: 172, baseType: !885)
!885 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_MTFTP4_OVERRIDE_DATA", file: !842, line: 166, size: 112, elements: !886)
!886 = !{!887, !888, !889, !890, !891}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "GatewayIp", scope: !885, file: !842, line: 167, baseType: !323, size: 32)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "ServerIp", scope: !885, file: !842, line: 168, baseType: !323, size: 32, offset: 32)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "ServerPort", scope: !885, file: !842, line: 169, baseType: !137, size: 16, offset: 64)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "TryCount", scope: !885, file: !842, line: 170, baseType: !137, size: 16, offset: 80)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "TimeoutValue", scope: !885, file: !842, line: 171, baseType: !137, size: 16, offset: 96)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64)
!893 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_OPTION", file: !842, line: 144, baseType: !894)
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_MTFTP4_OPTION", file: !842, line: 141, size: 128, elements: !895)
!895 = !{!896, !897}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "OptionStr", scope: !894, file: !842, line: 142, baseType: !156, size: 64)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "ValueStr", scope: !894, file: !842, line: 143, baseType: !156, size: 64, offset: 64)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64)
!900 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_PACKET", file: !842, line: 134, baseType: !901)
!901 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "EFI_MTFTP4_PACKET", file: !842, line: 97, size: 88, elements: !902)
!902 = !{!903, !904, !910, !911, !917, !924, !931, !938, !945}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "OpCode", scope: !901, file: !842, line: 101, baseType: !137, size: 16)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "Rrq", scope: !901, file: !842, line: 105, baseType: !905, size: 24)
!905 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_REQ_HEADER", file: !842, line: 62, baseType: !906)
!906 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_MTFTP4_REQ_HEADER", file: !842, line: 59, size: 24, elements: !907)
!907 = !{!908, !909}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "OpCode", scope: !906, file: !842, line: 60, baseType: !137, size: 16)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "Filename", scope: !906, file: !842, line: 61, baseType: !142, size: 8, offset: 16)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "Wrq", scope: !901, file: !842, line: 109, baseType: !905, size: 24)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "Oack", scope: !901, file: !842, line: 113, baseType: !912, size: 24)
!912 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_OACK_HEADER", file: !842, line: 67, baseType: !913)
!913 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_MTFTP4_OACK_HEADER", file: !842, line: 64, size: 24, elements: !914)
!914 = !{!915, !916}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "OpCode", scope: !913, file: !842, line: 65, baseType: !137, size: 16)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !913, file: !842, line: 66, baseType: !142, size: 8, offset: 16)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !901, file: !842, line: 117, baseType: !918, size: 40)
!918 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_DATA_HEADER", file: !842, line: 73, baseType: !919)
!919 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_MTFTP4_DATA_HEADER", file: !842, line: 69, size: 40, elements: !920)
!920 = !{!921, !922, !923}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "OpCode", scope: !919, file: !842, line: 70, baseType: !137, size: 16)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "Block", scope: !919, file: !842, line: 71, baseType: !137, size: 16, offset: 16)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !919, file: !842, line: 72, baseType: !142, size: 8, offset: 32)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "Ack", scope: !901, file: !842, line: 121, baseType: !925, size: 32)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_ACK_HEADER", file: !842, line: 78, baseType: !926)
!926 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_MTFTP4_ACK_HEADER", file: !842, line: 75, size: 32, elements: !927)
!927 = !{!928, !929}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "OpCode", scope: !926, file: !842, line: 76, baseType: !137, size: 16)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "Block", scope: !926, file: !842, line: 77, baseType: !930, size: 16, offset: 16)
!930 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 16, elements: !145)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "Data8", scope: !901, file: !842, line: 125, baseType: !932, size: 88)
!932 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_DATA8_HEADER", file: !842, line: 84, baseType: !933)
!933 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_MTFTP4_DATA8_HEADER", file: !842, line: 80, size: 88, elements: !934)
!934 = !{!935, !936, !937}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "OpCode", scope: !933, file: !842, line: 81, baseType: !137, size: 16)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "Block", scope: !933, file: !842, line: 82, baseType: !204, size: 64, offset: 16)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !933, file: !842, line: 83, baseType: !142, size: 8, offset: 80)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "Ack8", scope: !901, file: !842, line: 129, baseType: !939, size: 80)
!939 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_ACK8_HEADER", file: !842, line: 89, baseType: !940)
!940 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_MTFTP4_ACK8_HEADER", file: !842, line: 86, size: 80, elements: !941)
!941 = !{!942, !943}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "OpCode", scope: !940, file: !842, line: 87, baseType: !137, size: 16)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "Block", scope: !940, file: !842, line: 88, baseType: !944, size: 64, offset: 16)
!944 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 64, elements: !145)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "Error", scope: !901, file: !842, line: 133, baseType: !946, size: 40)
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_ERROR_HEADER", file: !842, line: 95, baseType: !947)
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_MTFTP4_ERROR_HEADER", file: !842, line: 91, size: 40, elements: !948)
!948 = !{!949, !950, !951}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "OpCode", scope: !947, file: !842, line: 92, baseType: !137, size: 16)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "ErrorCode", scope: !947, file: !842, line: 93, baseType: !137, size: 16, offset: 16)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "ErrorMessage", scope: !947, file: !842, line: 94, baseType: !142, size: 8, offset: 32)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "ParseOptions", scope: !843, file: !842, line: 503, baseType: !953, size: 64, offset: 192)
!953 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_PARSE_OPTIONS", file: !842, line: 378, baseType: !954)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!955 = !DISubroutineType(types: !956)
!956 = !{!242, !840, !175, !899, !347, !957}
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "ReadFile", scope: !843, file: !842, line: 504, baseType: !959, size: 64, offset: 256)
!959 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_READ_FILE", file: !842, line: 411, baseType: !960)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!961 = !DISubroutineType(types: !962)
!962 = !{!242, !840, !963}
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64)
!964 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_TOKEN", file: !842, line: 26, baseType: !965)
!965 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_MTFTP4_TOKEN", file: !842, line: 510, size: 832, elements: !966)
!966 = !{!967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !982, !984}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "Status", scope: !965, file: !842, line: 515, baseType: !242, size: 64)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "Event", scope: !965, file: !842, line: 523, baseType: !359, size: 64, offset: 64)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "OverrideData", scope: !965, file: !842, line: 527, baseType: !883, size: 64, offset: 128)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "Filename", scope: !965, file: !842, line: 531, baseType: !156, size: 64, offset: 192)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "ModeStr", scope: !965, file: !842, line: 535, baseType: !156, size: 64, offset: 256)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "OptionCount", scope: !965, file: !842, line: 539, baseType: !175, size: 32, offset: 320)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "OptionList", scope: !965, file: !842, line: 543, baseType: !892, size: 64, offset: 384)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "BufferSize", scope: !965, file: !842, line: 547, baseType: !204, size: 64, offset: 448)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "Buffer", scope: !965, file: !842, line: 553, baseType: !164, size: 64, offset: 512)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "Context", scope: !965, file: !842, line: 558, baseType: !164, size: 64, offset: 576)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "CheckPacket", scope: !965, file: !842, line: 562, baseType: !978, size: 64, offset: 640)
!978 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_CHECK_PACKET", file: !842, line: 198, baseType: !979)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64)
!980 = !DISubroutineType(types: !981)
!981 = !{!242, !840, !963, !137, !899}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "TimeoutCallback", scope: !965, file: !842, line: 566, baseType: !983, size: 64, offset: 704)
!983 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_TIMEOUT_CALLBACK", file: !842, line: 221, baseType: !960)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "PacketNeeded", scope: !965, file: !842, line: 570, baseType: !985, size: 64, offset: 768)
!985 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_PACKET_NEEDED", file: !842, line: 243, baseType: !986)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64)
!987 = !DISubroutineType(types: !988)
!988 = !{!242, !840, !963, !214, !209}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "WriteFile", scope: !843, file: !842, line: 505, baseType: !990, size: 64, offset: 320)
!990 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_WRITE_FILE", file: !842, line: 439, baseType: !960)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "ReadDirectory", scope: !843, file: !842, line: 506, baseType: !992, size: 64, offset: 384)
!992 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_READ_DIRECTORY", file: !842, line: 468, baseType: !960)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "Poll", scope: !843, file: !842, line: 507, baseType: !994, size: 64, offset: 448)
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_POLL", file: !842, line: 490, baseType: !995)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64)
!996 = !DISubroutineType(types: !997)
!997 = !{!242, !840}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "Udp4Read", scope: !218, file: !217, line: 124, baseType: !999, size: 64, offset: 1152)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64)
!1000 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_UDP4_PROTOCOL", file: !1001, line: 32, baseType: !1002)
!1001 = !DIFile(filename: "MdePkg/Include/Protocol/Udp4.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "b43e113d8bfd3002b7bb0ecd1117fd63")
!1002 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_UDP4_PROTOCOL", file: !1001, line: 423, size: 512, elements: !1003)
!1003 = !{!1004, !1028, !1033, !1038, !1043, !1092, !1094, !1096}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "GetModeData", scope: !1002, file: !1001, line: 424, baseType: !1005, size: 64)
!1005 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_UDP4_GET_MODE_DATA", file: !1001, line: 142, baseType: !1006)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64)
!1007 = !DISubroutineType(types: !1008)
!1008 = !{!242, !999, !1009, !499, !544, !361}
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64)
!1010 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_UDP4_CONFIG_DATA", file: !1001, line: 92, baseType: !1011)
!1011 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_UDP4_CONFIG_DATA", file: !1001, line: 67, size: 288, elements: !1012)
!1012 = !{!1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "AcceptBroadcast", scope: !1011, file: !1001, line: 71, baseType: !210, size: 8)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "AcceptPromiscuous", scope: !1011, file: !1001, line: 72, baseType: !210, size: 8, offset: 8)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "AcceptAnyPort", scope: !1011, file: !1001, line: 73, baseType: !210, size: 8, offset: 16)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "AllowDuplicatePort", scope: !1011, file: !1001, line: 74, baseType: !210, size: 8, offset: 24)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "TypeOfService", scope: !1011, file: !1001, line: 78, baseType: !143, size: 8, offset: 32)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "TimeToLive", scope: !1011, file: !1001, line: 79, baseType: !143, size: 8, offset: 40)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "DoNotFragment", scope: !1011, file: !1001, line: 80, baseType: !210, size: 8, offset: 48)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "ReceiveTimeout", scope: !1011, file: !1001, line: 81, baseType: !175, size: 32, offset: 64)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "TransmitTimeout", scope: !1011, file: !1001, line: 82, baseType: !175, size: 32, offset: 96)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultAddress", scope: !1011, file: !1001, line: 86, baseType: !210, size: 8, offset: 128)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "StationAddress", scope: !1011, file: !1001, line: 87, baseType: !323, size: 32, offset: 136)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "SubnetMask", scope: !1011, file: !1001, line: 88, baseType: !323, size: 32, offset: 168)
