; ModuleID = './bcfiles/PxeBcMtftp.bc'
source_filename = "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main/NetworkPkg/UefiPxeBcDxe/PxeBcMtftp.c"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-windows-gnu"

%struct._EFI_MTFTP6_PROTOCOL = type { i64 (%struct._EFI_MTFTP6_PROTOCOL*, %struct.EFI_MTFTP6_MODE_DATA*)*, i64 (%struct._EFI_MTFTP6_PROTOCOL*, %struct.EFI_MTFTP6_CONFIG_DATA*)*, i64 (%struct._EFI_MTFTP6_PROTOCOL*, %struct.EFI_MTFTP6_OVERRIDE_DATA*, i8*, i8*, i8, %struct.EFI_MTFTP6_OPTION*, i32*, %union.EFI_MTFTP6_PACKET**)*, i64 (%struct._EFI_MTFTP6_PROTOCOL*, i32, %union.EFI_MTFTP6_PACKET*, i32*, %struct.EFI_MTFTP6_OPTION**)*, i64 (%struct._EFI_MTFTP6_PROTOCOL*, %struct._EFI_MTFTP6_TOKEN*)*, i64 (%struct._EFI_MTFTP6_PROTOCOL*, %struct._EFI_MTFTP6_TOKEN*)*, i64 (%struct._EFI_MTFTP6_PROTOCOL*, %struct._EFI_MTFTP6_TOKEN*)*, i64 (%struct._EFI_MTFTP6_PROTOCOL*)* }
%struct.EFI_MTFTP6_MODE_DATA = type { %struct.EFI_MTFTP6_CONFIG_DATA, i8, i8** }
%struct.EFI_MTFTP6_CONFIG_DATA = type { %struct.IPv6_ADDRESS, i16, %struct.IPv6_ADDRESS, i16, i16, i16 }
%struct.IPv6_ADDRESS = type { [16 x i8] }
%struct.EFI_MTFTP6_OVERRIDE_DATA = type { %struct.IPv6_ADDRESS, i16, i16, i16 }
%struct.EFI_MTFTP6_OPTION = type { i8*, i8* }

!71 = !DIEnumerator(name: "Dhcp6Rebinding", value: 8)
!72 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !61, line: 76, baseType: !7, size: 32, elements: !73)
!73 = !{!74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84}
!74 = !DIEnumerator(name: "Dhcp6SendSolicit", value: 0)
!75 = !DIEnumerator(name: "Dhcp6RcvdAdvertise", value: 1)
!76 = !DIEnumerator(name: "Dhcp6SelectAdvertise", value: 2)
!77 = !DIEnumerator(name: "Dhcp6SendRequest", value: 3)
!78 = !DIEnumerator(name: "Dhcp6RcvdReply", value: 4)
!79 = !DIEnumerator(name: "Dhcp6RcvdReconfigure", value: 5)
!80 = !DIEnumerator(name: "Dhcp6SendDecline", value: 6)
!81 = !DIEnumerator(name: "Dhcp6SendConfirm", value: 7)
!82 = !DIEnumerator(name: "Dhcp6SendRelease", value: 8)
!83 = !DIEnumerator(name: "Dhcp6EnterRenewing", value: 9)
!84 = !DIEnumerator(name: "Dhcp6EnterRebinding", value: 10)
!85 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !86, line: 192, baseType: !7, size: 32, elements: !87)
!86 = !DIFile(filename: "MdePkg/Include/Protocol/PxeBaseCode.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "5c81517a25a11d0772fd25cf3f99822b")
!87 = !{!88, !89, !90, !91, !92, !93, !94, !95, !96}
!88 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_TFTP_FIRST", value: 0)
!89 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_TFTP_GET_FILE_SIZE", value: 1)
!90 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_TFTP_READ_FILE", value: 2)
!91 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_TFTP_WRITE_FILE", value: 3)
!92 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_TFTP_READ_DIRECTORY", value: 4)
!93 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_MTFTP_GET_FILE_SIZE", value: 5)
!94 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_MTFTP_READ_FILE", value: 6)
!95 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_MTFTP_READ_DIRECTORY", value: 7)
!96 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_MTFTP_LAST", value: 8)
!97 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !98, line: 63, baseType: !7, size: 32, elements: !99)
!98 = !DIFile(filename: "MdePkg/Include/Protocol/PxeBaseCodeCallBack.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "620f8d98f32292d4cb970381b3122ad5")
!99 = !{!100, !101, !102, !103}
!100 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_CALLBACK_STATUS_FIRST", value: 0)
!101 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_CALLBACK_STATUS_CONTINUE", value: 1)
!102 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_CALLBACK_STATUS_ABORT", value: 2)
!103 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_CALLBACK_STATUS_LAST", value: 3)
!104 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !98, line: 48, baseType: !7, size: 32, elements: !105)
!105 = !{!106, !107, !108, !109, !110, !111, !112, !113, !114}
!106 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_FUNCTION_FIRST", value: 0)
!107 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_FUNCTION_DHCP", value: 1)
!108 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_FUNCTION_DISCOVER", value: 2)
!109 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_FUNCTION_MTFTP", value: 3)
!110 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_FUNCTION_UDP_WRITE", value: 4)
!111 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_FUNCTION_UDP_READ", value: 5)
!112 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_FUNCTION_ARP", value: 6)
!113 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_FUNCTION_IGMP", value: 7)
!114 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_PXE_FUNCTION_LAST", value: 8)
!115 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !116, line: 71, baseType: !7, size: 32, elements: !117)
!116 = !DIFile(filename: "NetworkPkg/UefiPxeBcDxe/PxeBcDhcp4.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "71d8c6a5b4dce053943495bbd9962c1e")
!117 = !{!118, !119, !120, !121, !122, !123, !124, !125, !126}
!118 = !DIEnumerator(name: "PxeOfferTypeDhcpOnly", value: 0)
!119 = !DIEnumerator(name: "PxeOfferTypeDhcpPxe10", value: 1)
!120 = !DIEnumerator(name: "PxeOfferTypeDhcpWfm11a", value: 2)
!121 = !DIEnumerator(name: "PxeOfferTypeDhcpBinl", value: 3)
!122 = !DIEnumerator(name: "PxeOfferTypeProxyPxe10", value: 4)
!123 = !DIEnumerator(name: "PxeOfferTypeProxyWfm11a", value: 5)
!124 = !DIEnumerator(name: "PxeOfferTypeProxyBinl", value: 6)
!125 = !DIEnumerator(name: "PxeOfferTypeBootp", value: 7)
!126 = !DIEnumerator(name: "PxeOfferTypeMax", value: 8)
!127 = !{!128, !161, !176, !191, !1698, !139, !1854, !2152, !743, !274, !1400, !814}
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "PXEBC_PRIVATE_DATA", file: !130, line: 52, baseType: !131)
!130 = !DIFile(filename: "NetworkPkg/UefiPxeBcDxe/PxeBcImpl.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "97799bc64a49caaa653ce382cd21c883")
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PXEBC_PRIVATE_DATA", file: !130, line: 101, size: 352960, elements: !132)
!132 = !{!133, !136, !140, !141, !148, !316, !347, !348, !349, !350, !351, !352, !353, !354, !417, !604, !627, !776, !935, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1212, !1235, !1368, !1518, !1611, !1612, !1730, !1747, !1978, !1991, !1992, !1993, !1994, !1995, !1996, !1997, !1998, !1999, !2000, !2001, !2002, !2003, !2004, !2005, !2006, !2007, !2008, !2009, !2010, !2011, !2012, !2013, !2014, !2015, !2016, !2017, !2018, !2019, !2020, !2021, !2022, !2023, !2139, !2140, !2141, !2142, !2143, !2144, !2145, !2147, !2148, !2149}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", scope: !131, file: !130, line: 102, baseType: !134, size: 32)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT32", file: !135, line: 170, baseType: !7)
!135 = !DIFile(filename: "MdePkg/Include/X64/ProcessorBind.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "ef2524a221fe61206fa09ec88dd4f59b")
!136 = !DIDerivedType(tag: DW_TAG_member, name: "Controller", scope: !131, file: !130, line: 103, baseType: !137, size: 64, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_HANDLE", file: !138, line: 33, baseType: !139)
!138 = !DIFile(filename: "MdePkg/Include/Uefi/UefiBaseType.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "dbec48e65949dff122bc920c9d9d9c6a")
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !131, file: !130, line: 104, baseType: !137, size: 64, offset: 128)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "Id", scope: !131, file: !130, line: 106, baseType: !142, size: 64, offset: 192)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "PXEBC_PRIVATE_PROTOCOL", file: !130, line: 53, baseType: !143)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PXEBC_PRIVATE_PROTOCOL", file: !130, line: 89, size: 64, elements: !144)
!144 = !{!145}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved", scope: !143, file: !130, line: 90, baseType: !146, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT64", file: !135, line: 162, baseType: !147)
!147 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "Snp", scope: !131, file: !130, line: 107, baseType: !149, size: 64, offset: 256)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_NETWORK_PROTOCOL", file: !151, line: 28, baseType: !152)
!151 = !DIFile(filename: "MdePkg/Include/Protocol/SimpleNetwork.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "ce4888de327acb559b98965e4f2a0a5b")
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_SIMPLE_NETWORK_PROTOCOL", file: !151, line: 643, size: 1024, elements: !153)
!153 = !{!154, !155, !164, !166, !171, !178, !180, !194, !199, !235, !264, !269, !276, !284, !289, !291}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "Revision", scope: !152, file: !151, line: 649, baseType: !146, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "Start", scope: !152, file: !151, line: 650, baseType: !156, size: 64, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_NETWORK_START", file: !151, line: 262, baseType: !157)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DISubroutineType(types: !159)
!159 = !{!160, !149}
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_STATUS", file: !138, line: 29, baseType: !161)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "RETURN_STATUS", file: !162, line: 1026, baseType: !163)
!162 = !DIFile(filename: "MdePkg/Include/Base.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "0c11ea3d1992443d8a8f590a064e50ff")
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINTN", file: !135, line: 211, baseType: !146)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "Stop", scope: !152, file: !151, line: 651, baseType: !165, size: 64, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_NETWORK_STOP", file: !151, line: 280, baseType: !157)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "Initialize", scope: !152, file: !151, line: 652, baseType: !167, size: 64, offset: 192)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_NETWORK_INITIALIZE", file: !151, line: 312, baseType: !168)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DISubroutineType(types: !170)
!170 = !{!160, !149, !163, !163}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "Reset", scope: !152, file: !151, line: 653, baseType: !172, size: 64, offset: 256)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_NETWORK_RESET", file: !151, line: 336, baseType: !173)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DISubroutineType(types: !175)
!175 = !{!160, !149, !176}
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "BOOLEAN", file: !135, line: 192, baseType: !177)
!177 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "Shutdown", scope: !152, file: !151, line: 654, baseType: !179, size: 64, offset: 320)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_NETWORK_SHUTDOWN", file: !151, line: 356, baseType: !157)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "ReceiveFilters", scope: !152, file: !151, line: 655, baseType: !181, size: 64, offset: 384)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_NETWORK_RECEIVE_FILTERS", file: !151, line: 386, baseType: !182)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DISubroutineType(types: !184)
!184 = !{!160, !149, !134, !134, !176, !163, !185}
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MAC_ADDRESS", file: !138, line: 97, baseType: !187)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_MAC_ADDRESS", file: !138, line: 95, size: 256, elements: !188)
!188 = !{!189}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "Addr", scope: !187, file: !138, line: 96, baseType: !190, size: 256)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !191, size: 256, elements: !192)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT8", file: !135, line: 196, baseType: !177)
!192 = !{!193}
!193 = !DISubrange(count: 32)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "StationAddress", scope: !152, file: !151, line: 656, baseType: !195, size: 64, offset: 448)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_NETWORK_STATION_ADDRESS", file: !151, line: 412, baseType: !196)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!160, !149, !176, !185}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "Statistics", scope: !152, file: !151, line: 657, baseType: !200, size: 64, offset: 512)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_NETWORK_STATISTICS", file: !151, line: 441, baseType: !201)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DISubroutineType(types: !203)
!203 = !{!160, !149, !176, !204, !205}
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_NETWORK_STATISTICS", file: !151, line: 136, baseType: !207)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_NETWORK_STATISTICS", file: !151, line: 38, size: 1664, elements: !208)
!208 = !{!209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "RxTotalFrames", scope: !207, file: !151, line: 43, baseType: !146, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "RxGoodFrames", scope: !207, file: !151, line: 48, baseType: !146, size: 64, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "RxUndersizeFrames", scope: !207, file: !151, line: 54, baseType: !146, size: 64, offset: 128)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "RxOversizeFrames", scope: !207, file: !151, line: 60, baseType: !146, size: 64, offset: 192)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "RxDroppedFrames", scope: !207, file: !151, line: 65, baseType: !146, size: 64, offset: 256)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "RxUnicastFrames", scope: !207, file: !151, line: 70, baseType: !146, size: 64, offset: 320)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "RxBroadcastFrames", scope: !207, file: !151, line: 75, baseType: !146, size: 64, offset: 384)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "RxMulticastFrames", scope: !207, file: !151, line: 80, baseType: !146, size: 64, offset: 448)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "RxCrcErrorFrames", scope: !207, file: !151, line: 85, baseType: !146, size: 64, offset: 512)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "RxTotalBytes", scope: !207, file: !151, line: 91, baseType: !146, size: 64, offset: 576)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "TxTotalFrames", scope: !207, file: !151, line: 96, baseType: !146, size: 64, offset: 640)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "TxGoodFrames", scope: !207, file: !151, line: 97, baseType: !146, size: 64, offset: 704)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "TxUndersizeFrames", scope: !207, file: !151, line: 98, baseType: !146, size: 64, offset: 768)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "TxOversizeFrames", scope: !207, file: !151, line: 99, baseType: !146, size: 64, offset: 832)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "TxDroppedFrames", scope: !207, file: !151, line: 100, baseType: !146, size: 64, offset: 896)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "TxUnicastFrames", scope: !207, file: !151, line: 101, baseType: !146, size: 64, offset: 960)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "TxBroadcastFrames", scope: !207, file: !151, line: 102, baseType: !146, size: 64, offset: 1024)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "TxMulticastFrames", scope: !207, file: !151, line: 103, baseType: !146, size: 64, offset: 1088)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "TxCrcErrorFrames", scope: !207, file: !151, line: 104, baseType: !146, size: 64, offset: 1152)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "TxTotalBytes", scope: !207, file: !151, line: 105, baseType: !146, size: 64, offset: 1216)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "Collisions", scope: !207, file: !151, line: 110, baseType: !146, size: 64, offset: 1280)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "UnsupportedProtocol", scope: !207, file: !151, line: 115, baseType: !146, size: 64, offset: 1344)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "RxDuplicatedFrames", scope: !207, file: !151, line: 120, baseType: !146, size: 64, offset: 1408)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "RxDecryptErrorFrames", scope: !207, file: !151, line: 125, baseType: !146, size: 64, offset: 1472)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "TxErrorFrames", scope: !207, file: !151, line: 130, baseType: !146, size: 64, offset: 1536)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "TxRetryFrames", scope: !207, file: !151, line: 135, baseType: !146, size: 64, offset: 1600)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "MCastIpToMac", scope: !152, file: !151, line: 658, baseType: !236, size: 64, offset: 576)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_NETWORK_MCAST_IP_TO_MAC", file: !151, line: 471, baseType: !237)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DISubroutineType(types: !239)
!239 = !{!160, !149, !176, !240, !185}
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP_ADDRESS", file: !138, line: 107, baseType: !242)
!242 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "EFI_IP_ADDRESS", file: !138, line: 103, size: 128, elements: !243)
!243 = !{!244, !248, !255}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "Addr", scope: !242, file: !138, line: 104, baseType: !245, size: 128)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 128, elements: !246)
!246 = !{!247}
!247 = !DISubrange(count: 4)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !242, file: !138, line: 105, baseType: !249, size: 32)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IPv4_ADDRESS", file: !138, line: 85, baseType: !250)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPv4_ADDRESS", file: !162, line: 225, baseType: !251)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IPv4_ADDRESS", file: !162, line: 223, size: 32, elements: !252)
!252 = !{!253}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "Addr", scope: !251, file: !162, line: 224, baseType: !254, size: 32)
!254 = !DICompositeType(tag: DW_TAG_array_type, baseType: !191, size: 32, elements: !246)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !242, file: !138, line: 106, baseType: !256, size: 128)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IPv6_ADDRESS", file: !138, line: 90, baseType: !257)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPv6_ADDRESS", file: !162, line: 232, baseType: !258)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IPv6_ADDRESS", file: !162, line: 230, size: 128, elements: !259)
!259 = !{!260}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "Addr", scope: !258, file: !162, line: 231, baseType: !261, size: 128)
!261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !191, size: 128, elements: !262)
!262 = !{!263}
!263 = !DISubrange(count: 16)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "NvData", scope: !152, file: !151, line: 659, baseType: !265, size: 64, offset: 640)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_NETWORK_NVDATA", file: !151, line: 500, baseType: !266)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DISubroutineType(types: !268)
!268 = !{!160, !149, !176, !163, !163, !139}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "GetStatus", scope: !152, file: !151, line: 660, baseType: !270, size: 64, offset: 704)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_NETWORK_GET_STATUS", file: !151, line: 535, baseType: !271)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DISubroutineType(types: !273)
!273 = !{!160, !149, !274, !275}
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "Transmit", scope: !152, file: !151, line: 661, baseType: !277, size: 64, offset: 768)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_NETWORK_TRANSMIT", file: !151, line: 576, baseType: !278)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DISubroutineType(types: !280)
!280 = !{!160, !149, !163, !163, !139, !185, !185, !281}
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT16", file: !135, line: 178, baseType: !283)
!283 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "Receive", scope: !152, file: !151, line: 662, baseType: !285, size: 64, offset: 832)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_NETWORK_RECEIVE", file: !151, line: 620, baseType: !286)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DISubroutineType(types: !288)
!288 = !{!160, !149, !204, !204, !139, !185, !185, !281}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "WaitForPacket", scope: !152, file: !151, line: 666, baseType: !290, size: 64, offset: 896)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_EVENT", file: !138, line: 37, baseType: !139)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "Mode", scope: !152, file: !151, line: 670, baseType: !292, size: 64, offset: 960)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_NETWORK_MODE", file: !151, line: 242, baseType: !294)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_SIMPLE_NETWORK_MODE", file: !151, line: 162, size: 5248, elements: !295)
!295 = !{!296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !308, !309, !310, !311, !312, !313, !314, !315}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "State", scope: !294, file: !151, line: 166, baseType: !134, size: 32)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "HwAddressSize", scope: !294, file: !151, line: 170, baseType: !134, size: 32, offset: 32)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "MediaHeaderSize", scope: !294, file: !151, line: 174, baseType: !134, size: 32, offset: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "MaxPacketSize", scope: !294, file: !151, line: 178, baseType: !134, size: 32, offset: 96)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "NvRamSize", scope: !294, file: !151, line: 182, baseType: !134, size: 32, offset: 128)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "NvRamAccessSize", scope: !294, file: !151, line: 189, baseType: !134, size: 32, offset: 160)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "ReceiveFilterMask", scope: !294, file: !151, line: 193, baseType: !134, size: 32, offset: 192)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "ReceiveFilterSetting", scope: !294, file: !151, line: 197, baseType: !134, size: 32, offset: 224)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "MaxMCastFilterCount", scope: !294, file: !151, line: 201, baseType: !134, size: 32, offset: 256)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "MCastFilterCount", scope: !294, file: !151, line: 205, baseType: !134, size: 32, offset: 288)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "MCastFilter", scope: !294, file: !151, line: 209, baseType: !307, size: 4096, offset: 320)
!307 = !DICompositeType(tag: DW_TAG_array_type, baseType: !186, size: 4096, elements: !262)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "CurrentAddress", scope: !294, file: !151, line: 213, baseType: !186, size: 256, offset: 4416)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "BroadcastAddress", scope: !294, file: !151, line: 217, baseType: !186, size: 256, offset: 4672)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "PermanentAddress", scope: !294, file: !151, line: 221, baseType: !186, size: 256, offset: 4928)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "IfType", scope: !294, file: !151, line: 225, baseType: !191, size: 8, offset: 5184)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "MacAddressChangeable", scope: !294, file: !151, line: 229, baseType: !176, size: 8, offset: 5192)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "MultipleTxSupported", scope: !294, file: !151, line: 233, baseType: !176, size: 8, offset: 5200)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "MediaPresentSupported", scope: !294, file: !151, line: 237, baseType: !176, size: 8, offset: 5208)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "MediaPresent", scope: !294, file: !151, line: 241, baseType: !176, size: 8, offset: 5216)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "Ip4Nic", scope: !131, file: !130, line: 109, baseType: !317, size: 64, offset: 320)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "PXEBC_VIRTUAL_NIC", file: !130, line: 54, baseType: !319)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PXEBC_VIRTUAL_NIC", file: !130, line: 93, size: 320, elements: !320)
!320 = !{!321, !322, !323, !345, !346}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", scope: !319, file: !130, line: 94, baseType: !134, size: 32)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "Controller", scope: !319, file: !130, line: 95, baseType: !137, size: 64, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "LoadFile", scope: !319, file: !130, line: 96, baseType: !324, size: 64, offset: 128)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_LOAD_FILE_PROTOCOL", file: !325, line: 28, baseType: !326)
!325 = !DIFile(filename: "MdePkg/Include/Protocol/LoadFile.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "15734a5f551782ac503b5b1cf42f1c66")
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_LOAD_FILE_PROTOCOL", file: !325, line: 76, size: 64, elements: !327)
!327 = !{!328}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "LoadFile", scope: !326, file: !325, line: 77, baseType: !329, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_LOAD_FILE", file: !325, line: 65, baseType: !330)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DISubroutineType(types: !332)
!332 = !{!160, !333, !334, !176, !204, !139}
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DEVICE_PATH_PROTOCOL", file: !336, line: 58, baseType: !337)
!336 = !DIFile(filename: "MdePkg/Include/Protocol/DevicePath.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "6b6d593d171f69b933a87911e52d4607")
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_DEVICE_PATH_PROTOCOL", file: !336, line: 43, size: 32, elements: !338)
!338 = !{!339, !340, !341}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !337, file: !336, line: 44, baseType: !191, size: 8)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "SubType", scope: !337, file: !336, line: 51, baseType: !191, size: 8, offset: 8)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !337, file: !336, line: 56, baseType: !342, size: 16, offset: 16)
!342 = !DICompositeType(tag: DW_TAG_array_type, baseType: !191, size: 16, elements: !343)
!343 = !{!344}
!344 = !DISubrange(count: 2)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "DevicePath", scope: !319, file: !130, line: 97, baseType: !334, size: 64, offset: 192)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "Private", scope: !319, file: !130, line: 98, baseType: !128, size: 64, offset: 256)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "Ip6Nic", scope: !131, file: !130, line: 110, baseType: !317, size: 64, offset: 384)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "ArpChild", scope: !131, file: !130, line: 112, baseType: !137, size: 64, offset: 448)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "Ip4Child", scope: !131, file: !130, line: 113, baseType: !137, size: 64, offset: 512)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "Dhcp4Child", scope: !131, file: !130, line: 114, baseType: !137, size: 64, offset: 576)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "Mtftp4Child", scope: !131, file: !130, line: 115, baseType: !137, size: 64, offset: 640)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "Udp4ReadChild", scope: !131, file: !130, line: 116, baseType: !137, size: 64, offset: 704)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "Udp4WriteChild", scope: !131, file: !130, line: 117, baseType: !137, size: 64, offset: 768)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "Arp", scope: !131, file: !130, line: 119, baseType: !355, size: 64, offset: 832)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_ARP_PROTOCOL", file: !357, line: 31, baseType: !358)
!357 = !DIFile(filename: "MdePkg/Include/Protocol/Arp.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "8142067718decedafa618d42505fb9b3")
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_ARP_PROTOCOL", file: !357, line: 363, size: 448, elements: !359)
!359 = !{!360, !375, !380, !397, !402, !407, !412}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "Configure", scope: !358, file: !357, line: 364, baseType: !361, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_ARP_CONFIGURE", file: !357, line: 142, baseType: !362)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DISubroutineType(types: !364)
!364 = !{!160, !355, !365}
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_ARP_CONFIG_DATA", file: !357, line: 110, baseType: !367)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_ARP_CONFIG_DATA", file: !357, line: 72, size: 256, elements: !368)
!368 = !{!369, !370, !371, !372, !373, !374}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "SwAddressType", scope: !367, file: !357, line: 76, baseType: !282, size: 16)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "SwAddressLength", scope: !367, file: !357, line: 81, baseType: !191, size: 8, offset: 16)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "StationAddress", scope: !367, file: !357, line: 89, baseType: !139, size: 64, offset: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "EntryTimeOut", scope: !367, file: !357, line: 96, baseType: !134, size: 32, offset: 128)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "RetryCount", scope: !367, file: !357, line: 102, baseType: !134, size: 32, offset: 160)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "RetryTimeOut", scope: !367, file: !357, line: 109, baseType: !134, size: 32, offset: 192)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "Add", scope: !358, file: !357, line: 365, baseType: !376, size: 64, offset: 64)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_ARP_ADD", file: !357, line: 194, baseType: !377)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DISubroutineType(types: !379)
!379 = !{!160, !355, !176, !139, !139, !134, !176}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "Find", scope: !358, file: !357, line: 366, baseType: !381, size: 64, offset: 128)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_ARP_FIND", file: !357, line: 239, baseType: !382)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DISubroutineType(types: !384)
!384 = !{!160, !355, !176, !139, !274, !274, !385, !176}
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_ARP_FIND_DATA", file: !357, line: 70, baseType: !388)
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_ARP_FIND_DATA", file: !357, line: 33, size: 96, elements: !389)
!389 = !{!390, !391, !392, !393, !394, !395, !396}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !388, file: !357, line: 37, baseType: !134, size: 32)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "DenyFlag", scope: !388, file: !357, line: 43, baseType: !176, size: 8, offset: 32)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "StaticFlag", scope: !388, file: !357, line: 49, baseType: !176, size: 8, offset: 40)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "HwAddressType", scope: !388, file: !357, line: 54, baseType: !282, size: 16, offset: 48)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "SwAddressType", scope: !388, file: !357, line: 59, baseType: !282, size: 16, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "HwAddressLength", scope: !388, file: !357, line: 64, baseType: !191, size: 8, offset: 80)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "SwAddressLength", scope: !388, file: !357, line: 69, baseType: !191, size: 8, offset: 88)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "Delete", scope: !358, file: !357, line: 367, baseType: !398, size: 64, offset: 192)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_ARP_DELETE", file: !357, line: 268, baseType: !399)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DISubroutineType(types: !401)
!401 = !{!160, !355, !176, !139}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "Flush", scope: !358, file: !357, line: 368, baseType: !403, size: 64, offset: 256)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_ARP_FLUSH", file: !357, line: 288, baseType: !404)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DISubroutineType(types: !406)
!406 = !{!160, !355}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "Request", scope: !358, file: !357, line: 369, baseType: !408, size: 64, offset: 320)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_ARP_REQUEST", file: !357, line: 316, baseType: !409)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DISubroutineType(types: !411)
!411 = !{!160, !355, !139, !290, !139}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "Cancel", scope: !358, file: !357, line: 370, baseType: !413, size: 64, offset: 384)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_ARP_CANCEL", file: !357, line: 353, baseType: !414)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DISubroutineType(types: !416)
!416 = !{!160, !355, !139, !290}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "Ip4", scope: !131, file: !130, line: 120, baseType: !418, size: 64, offset: 896)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_PROTOCOL", file: !420, line: 36, baseType: !421)
!420 = !DIFile(filename: "MdePkg/Include/Protocol/Ip4.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "1ff13a8b379fde89ccc818c3d7035657")
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_IP4_PROTOCOL", file: !420, line: 588, size: 512, elements: !422)
!422 = !{!423, !490, !496, !501, !506, !595, !597, !599}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "GetModeData", scope: !421, file: !420, line: 589, baseType: !424, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_GET_MODE_DATA", file: !420, line: 282, baseType: !425)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DISubroutineType(types: !427)
!427 = !{!160, !428, !430, !475, !292}
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !419)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_MODE_DATA", file: !420, line: 182, baseType: !432)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_IP4_MODE_DATA", file: !420, line: 141, size: 704, elements: !433)
!433 = !{!434, !435, !436, !454, !455, !456, !458, !459, !467, !468}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "IsStarted", scope: !432, file: !420, line: 145, baseType: !176, size: 8)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "MaxPacketSize", scope: !432, file: !420, line: 149, baseType: !134, size: 32, offset: 32)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "ConfigData", scope: !432, file: !420, line: 153, baseType: !437, size: 224, offset: 64)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_CONFIG_DATA", file: !420, line: 128, baseType: !438)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_IP4_CONFIG_DATA", file: !420, line: 58, size: 224, elements: !439)
!439 = !{!440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "DefaultProtocol", scope: !438, file: !420, line: 63, baseType: !191, size: 8)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "AcceptAnyProtocol", scope: !438, file: !420, line: 69, baseType: !176, size: 8, offset: 8)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "AcceptIcmpErrors", scope: !438, file: !420, line: 74, baseType: !176, size: 8, offset: 16)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "AcceptBroadcast", scope: !438, file: !420, line: 80, baseType: !176, size: 8, offset: 24)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "AcceptPromiscuous", scope: !438, file: !420, line: 86, baseType: !176, size: 8, offset: 32)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultAddress", scope: !438, file: !420, line: 90, baseType: !176, size: 8, offset: 40)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "StationAddress", scope: !438, file: !420, line: 94, baseType: !249, size: 32, offset: 48)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "SubnetMask", scope: !438, file: !420, line: 98, baseType: !249, size: 32, offset: 80)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "TypeOfService", scope: !438, file: !420, line: 102, baseType: !191, size: 8, offset: 112)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "TimeToLive", scope: !438, file: !420, line: 106, baseType: !191, size: 8, offset: 120)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "DoNotFragment", scope: !438, file: !420, line: 110, baseType: !176, size: 8, offset: 128)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "RawData", scope: !438, file: !420, line: 115, baseType: !176, size: 8, offset: 136)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "ReceiveTimeout", scope: !438, file: !420, line: 121, baseType: !134, size: 32, offset: 160)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "TransmitTimeout", scope: !438, file: !420, line: 127, baseType: !134, size: 32, offset: 192)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "IsConfigured", scope: !432, file: !420, line: 157, baseType: !176, size: 8, offset: 288)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "GroupCount", scope: !432, file: !420, line: 161, baseType: !134, size: 32, offset: 320)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "GroupTable", scope: !432, file: !420, line: 165, baseType: !457, size: 64, offset: 384)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "RouteCount", scope: !432, file: !420, line: 169, baseType: !134, size: 32, offset: 448)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "RouteTable", scope: !432, file: !420, line: 173, baseType: !460, size: 64, offset: 512)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_ROUTE_TABLE", file: !420, line: 134, baseType: !462)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_IP4_ROUTE_TABLE", file: !420, line: 130, size: 96, elements: !463)
!463 = !{!464, !465, !466}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "SubnetAddress", scope: !462, file: !420, line: 131, baseType: !249, size: 32)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "SubnetMask", scope: !462, file: !420, line: 132, baseType: !249, size: 32, offset: 32)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "GatewayAddress", scope: !462, file: !420, line: 133, baseType: !249, size: 32, offset: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "IcmpTypeCount", scope: !432, file: !420, line: 177, baseType: !134, size: 32, offset: 576)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "IcmpTypeList", scope: !432, file: !420, line: 181, baseType: !469, size: 64, offset: 640)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_ICMP_TYPE", file: !420, line: 139, baseType: !471)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_IP4_ICMP_TYPE", file: !420, line: 136, size: 16, elements: !472)
!472 = !{!473, !474}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !471, file: !420, line: 137, baseType: !191, size: 8)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "Code", scope: !471, file: !420, line: 138, baseType: !191, size: 8, offset: 8)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MANAGED_NETWORK_CONFIG_DATA", file: !477, line: 84, baseType: !478)
!477 = !DIFile(filename: "MdePkg/Include/Protocol/ManagedNetwork.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "8951452d2c79255944d265d14ed27585")
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_MANAGED_NETWORK_CONFIG_DATA", file: !477, line: 30, size: 160, elements: !479)
!479 = !{!480, !481, !482, !483, !484, !485, !486, !487, !488, !489}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "ReceivedQueueTimeoutValue", scope: !478, file: !477, line: 35, baseType: !134, size: 32)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "TransmitQueueTimeoutValue", scope: !478, file: !477, line: 40, baseType: !134, size: 32, offset: 32)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "ProtocolTypeFilter", scope: !478, file: !477, line: 45, baseType: !282, size: 16, offset: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "EnableUnicastReceive", scope: !478, file: !477, line: 50, baseType: !176, size: 8, offset: 80)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "EnableMulticastReceive", scope: !478, file: !477, line: 55, baseType: !176, size: 8, offset: 88)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "EnableBroadcastReceive", scope: !478, file: !477, line: 60, baseType: !176, size: 8, offset: 96)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "EnablePromiscuousReceive", scope: !478, file: !477, line: 65, baseType: !176, size: 8, offset: 104)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "FlushQueuesOnReset", scope: !478, file: !477, line: 70, baseType: !176, size: 8, offset: 112)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "EnableReceiveTimestamps", scope: !478, file: !477, line: 76, baseType: !176, size: 8, offset: 120)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "DisableBackgroundPolling", scope: !478, file: !477, line: 83, baseType: !176, size: 8, offset: 128)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "Configure", scope: !421, file: !420, line: 590, baseType: !491, size: 64, offset: 64)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_CONFIGURE", file: !420, line: 337, baseType: !492)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DISubroutineType(types: !494)
!494 = !{!160, !418, !495}
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "Groups", scope: !421, file: !420, line: 591, baseType: !497, size: 64, offset: 128)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_GROUPS", file: !420, line: 374, baseType: !498)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DISubroutineType(types: !500)
!500 = !{!160, !418, !176, !457}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "Routes", scope: !421, file: !420, line: 592, baseType: !502, size: 64, offset: 192)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_ROUTES", file: !420, line: 432, baseType: !503)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DISubroutineType(types: !505)
!505 = !{!160, !418, !176, !457, !457, !457}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "Transmit", scope: !421, file: !420, line: 593, baseType: !507, size: 64, offset: 256)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_TRANSMIT", file: !420, line: 471, baseType: !508)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DISubroutineType(types: !510)
!510 = !{!160, !418, !511}
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_COMPLETION_TOKEN", file: !420, line: 260, baseType: !513)
!513 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_IP4_COMPLETION_TOKEN", file: !420, line: 237, size: 192, elements: !514)
!514 = !{!515, !516, !517, !594}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "Event", scope: !513, file: !420, line: 244, baseType: !290, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "Status", scope: !513, file: !420, line: 249, baseType: !160, size: 64, offset: 64)
!517 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !513, file: !420, line: 250, size: 64, elements: !518)
!518 = !{!519, !572}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "RxData", scope: !517, file: !420, line: 254, baseType: !520, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_RECEIVE_DATA", file: !420, line: 216, baseType: !522)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_IP4_RECEIVE_DATA", file: !420, line: 206, size: 640, elements: !523)
!523 = !{!524, !541, !542, !543, !559, !560, !561, !562, !563}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "TimeStamp", scope: !522, file: !420, line: 207, baseType: !525, size: 128)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TIME", file: !138, line: 80, baseType: !526)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_TIME", file: !138, line: 68, size: 128, elements: !527)
!527 = !{!528, !529, !530, !531, !532, !533, !534, !535, !536, !539, !540}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "Year", scope: !526, file: !138, line: 69, baseType: !282, size: 16)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "Month", scope: !526, file: !138, line: 70, baseType: !191, size: 8, offset: 16)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "Day", scope: !526, file: !138, line: 71, baseType: !191, size: 8, offset: 24)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "Hour", scope: !526, file: !138, line: 72, baseType: !191, size: 8, offset: 32)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "Minute", scope: !526, file: !138, line: 73, baseType: !191, size: 8, offset: 40)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "Second", scope: !526, file: !138, line: 74, baseType: !191, size: 8, offset: 48)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "Pad1", scope: !526, file: !138, line: 75, baseType: !191, size: 8, offset: 56)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "Nanosecond", scope: !526, file: !138, line: 76, baseType: !134, size: 32, offset: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "TimeZone", scope: !526, file: !138, line: 77, baseType: !537, size: 16, offset: 96)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT16", file: !135, line: 187, baseType: !538)
!538 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "Daylight", scope: !526, file: !138, line: 78, baseType: !191, size: 8, offset: 112)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "Pad2", scope: !526, file: !138, line: 79, baseType: !191, size: 8, offset: 120)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "RecycleSignal", scope: !522, file: !420, line: 208, baseType: !290, size: 64, offset: 128)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "HeaderLength", scope: !522, file: !420, line: 209, baseType: !134, size: 32, offset: 192)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "Header", scope: !522, file: !420, line: 210, baseType: !544, size: 64, offset: 256)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_HEADER", file: !420, line: 198, baseType: !546)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_IP4_HEADER", file: !420, line: 186, size: 160, elements: !547)
!547 = !{!548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "HeaderLength", scope: !546, file: !420, line: 187, baseType: !191, size: 4, flags: DIFlagBitField, extraData: i64 0)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "Version", scope: !546, file: !420, line: 188, baseType: !191, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "TypeOfService", scope: !546, file: !420, line: 189, baseType: !191, size: 8, offset: 8)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "TotalLength", scope: !546, file: !420, line: 190, baseType: !282, size: 16, offset: 16)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "Identification", scope: !546, file: !420, line: 191, baseType: !282, size: 16, offset: 32)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "Fragmentation", scope: !546, file: !420, line: 192, baseType: !282, size: 16, offset: 48)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "TimeToLive", scope: !546, file: !420, line: 193, baseType: !191, size: 8, offset: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "Protocol", scope: !546, file: !420, line: 194, baseType: !191, size: 8, offset: 72)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "Checksum", scope: !546, file: !420, line: 195, baseType: !282, size: 16, offset: 80)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "SourceAddress", scope: !546, file: !420, line: 196, baseType: !249, size: 32, offset: 96)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "DestinationAddress", scope: !546, file: !420, line: 197, baseType: !249, size: 32, offset: 128)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "OptionsLength", scope: !522, file: !420, line: 211, baseType: !134, size: 32, offset: 320)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "Options", scope: !522, file: !420, line: 212, baseType: !139, size: 64, offset: 384)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "DataLength", scope: !522, file: !420, line: 213, baseType: !134, size: 32, offset: 448)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "FragmentCount", scope: !522, file: !420, line: 214, baseType: !134, size: 32, offset: 480)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "FragmentTable", scope: !522, file: !420, line: 215, baseType: !564, size: 128, offset: 512)
!564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !565, size: 128, elements: !570)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_FRAGMENT_DATA", file: !420, line: 204, baseType: !566)
!566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_IP4_FRAGMENT_DATA", file: !420, line: 201, size: 128, elements: !567)
!567 = !{!568, !569}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "FragmentLength", scope: !566, file: !420, line: 202, baseType: !134, size: 32)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "FragmentBuffer", scope: !566, file: !420, line: 203, baseType: !139, size: 64, offset: 64)
!570 = !{!571}
!571 = !DISubrange(count: 1)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "TxData", scope: !517, file: !420, line: 258, baseType: !573, size: 64)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_TRANSMIT_DATA", file: !420, line: 235, baseType: !575)
!575 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_IP4_TRANSMIT_DATA", file: !420, line: 227, size: 448, elements: !576)
!576 = !{!577, !578, !589, !590, !591, !592, !593}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "DestinationAddress", scope: !575, file: !420, line: 228, baseType: !249, size: 32)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "OverrideData", scope: !575, file: !420, line: 229, baseType: !579, size: 64, offset: 64)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_OVERRIDE_DATA", file: !420, line: 225, baseType: !581)
!581 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_IP4_OVERRIDE_DATA", file: !420, line: 218, size: 96, elements: !582)
!582 = !{!583, !584, !585, !586, !587, !588}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "SourceAddress", scope: !581, file: !420, line: 219, baseType: !249, size: 32)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "GatewayAddress", scope: !581, file: !420, line: 220, baseType: !249, size: 32, offset: 32)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "Protocol", scope: !581, file: !420, line: 221, baseType: !191, size: 8, offset: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "TypeOfService", scope: !581, file: !420, line: 222, baseType: !191, size: 8, offset: 72)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "TimeToLive", scope: !581, file: !420, line: 223, baseType: !191, size: 8, offset: 80)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "DoNotFragment", scope: !581, file: !420, line: 224, baseType: !176, size: 8, offset: 88)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "OptionsLength", scope: !575, file: !420, line: 230, baseType: !134, size: 32, offset: 128)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "OptionsBuffer", scope: !575, file: !420, line: 231, baseType: !139, size: 64, offset: 192)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "TotalDataLength", scope: !575, file: !420, line: 232, baseType: !134, size: 32, offset: 256)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "FragmentCount", scope: !575, file: !420, line: 233, baseType: !134, size: 32, offset: 288)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "FragmentTable", scope: !575, file: !420, line: 234, baseType: !564, size: 128, offset: 320)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "Packet", scope: !513, file: !420, line: 259, baseType: !517, size: 64, offset: 128)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "Receive", scope: !421, file: !420, line: 594, baseType: !596, size: 64, offset: 320)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_RECEIVE", file: !420, line: 510, baseType: !508)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "Cancel", scope: !421, file: !420, line: 595, baseType: !598, size: 64, offset: 384)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_CANCEL", file: !420, line: 546, baseType: !508)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "Poll", scope: !421, file: !420, line: 596, baseType: !600, size: 64, offset: 448)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_POLL", file: !420, line: 580, baseType: !601)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DISubroutineType(types: !603)
!603 = !{!160, !418}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "Ip4Config2", scope: !131, file: !130, line: 121, baseType: !605, size: 64, offset: 960)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_CONFIG2_PROTOCOL", file: !6, line: 23, baseType: !607)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_IP4_CONFIG2_PROTOCOL", file: !6, line: 307, size: 256, elements: !608)
!608 = !{!609, !615, !620, !625}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "SetData", scope: !607, file: !6, line: 308, baseType: !610, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_CONFIG2_SET_DATA", file: !6, line: 203, baseType: !611)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DISubroutineType(types: !613)
!613 = !{!160, !605, !614, !163, !139}
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_CONFIG2_DATA_TYPE", file: !6, line: 76, baseType: !5)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "GetData", scope: !607, file: !6, line: 309, baseType: !616, size: 64, offset: 64)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_CONFIG2_GET_DATA", file: !6, line: 245, baseType: !617)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DISubroutineType(types: !619)
!619 = !{!160, !605, !614, !204, !139}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "RegisterDataNotify", scope: !607, file: !6, line: 310, baseType: !621, size: 64, offset: 128)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_CONFIG2_REGISTER_NOTIFY", file: !6, line: 274, baseType: !622)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DISubroutineType(types: !624)
!624 = !{!160, !605, !614, !290}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "UnregisterDataNotify", scope: !607, file: !6, line: 311, baseType: !626, size: 64, offset: 192)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_CONFIG2_UNREGISTER_NOTIFY", file: !6, line: 295, baseType: !622)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "Dhcp4", scope: !131, file: !130, line: 122, baseType: !628, size: 64, offset: 1024)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP4_PROTOCOL", file: !16, line: 28, baseType: !630)
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_DHCP4_PROTOCOL", file: !16, line: 747, size: 576, elements: !631)
!631 = !{!632, !715, !721, !726, !731, !736, !738, !744, !771}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "GetModeData", scope: !630, file: !16, line: 748, baseType: !633, size: 64)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP4_GET_MODE_DATA", file: !16, line: 421, baseType: !634)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DISubroutineType(types: !636)
!636 = !{!160, !628, !637}
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP4_MODE_DATA", file: !16, line: 338, baseType: !639)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_DHCP4_MODE_DATA", file: !16, line: 297, size: 1152, elements: !640)
!640 = !{!641, !643, !708, !709, !710, !711, !712, !713, !714}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "State", scope: !639, file: !16, line: 301, baseType: !642, size: 32)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP4_STATE", file: !16, line: 139, baseType: !15)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "ConfigData", scope: !639, file: !16, line: 305, baseType: !644, size: 576, offset: 64)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP4_CONFIG_DATA", file: !16, line: 295, baseType: !645)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_DHCP4_CONFIG_DATA", file: !16, line: 241, size: 576, elements: !646)
!646 = !{!647, !648, !649, !650, !651, !652, !697, !698, !699}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "DiscoverTryCount", scope: !645, file: !16, line: 247, baseType: !134, size: 32)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "DiscoverTimeout", scope: !645, file: !16, line: 253, baseType: !274, size: 64, offset: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "RequestTryCount", scope: !645, file: !16, line: 259, baseType: !134, size: 32, offset: 128)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "RequestTimeout", scope: !645, file: !16, line: 265, baseType: !274, size: 64, offset: 192)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "ClientAddress", scope: !645, file: !16, line: 273, baseType: !249, size: 32, offset: 256)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "Dhcp4Callback", scope: !645, file: !16, line: 278, baseType: !653, size: 64, offset: 320)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP4_CALLBACK", file: !16, line: 232, baseType: !654)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DISubroutineType(types: !656)
!656 = !{!160, !628, !139, !642, !657, !658, !696}
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP4_EVENT", file: !16, line: 196, baseType: !27)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP4_PACKET", file: !16, line: 95, baseType: !660)
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_DHCP4_PACKET", file: !16, line: 70, size: 1992, elements: !661)
!661 = !{!662, !663, !664, !695}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !660, file: !16, line: 74, baseType: !134, size: 32)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !660, file: !16, line: 79, baseType: !134, size: 32, offset: 32)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !660, file: !16, line: 81, size: 1928, elements: !665)
!665 = !{!666, !692, !693}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "Header", scope: !664, file: !16, line: 85, baseType: !667, size: 1888)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP4_HEADER", file: !16, line: 66, baseType: !668)
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_DHCP4_HEADER", file: !16, line: 51, size: 1888, elements: !669)
!669 = !{!670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !688}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "OpCode", scope: !668, file: !16, line: 52, baseType: !191, size: 8)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "HwType", scope: !668, file: !16, line: 53, baseType: !191, size: 8, offset: 8)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "HwAddrLen", scope: !668, file: !16, line: 54, baseType: !191, size: 8, offset: 16)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "Hops", scope: !668, file: !16, line: 55, baseType: !191, size: 8, offset: 24)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "Xid", scope: !668, file: !16, line: 56, baseType: !134, size: 32, offset: 32)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "Seconds", scope: !668, file: !16, line: 57, baseType: !282, size: 16, offset: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved", scope: !668, file: !16, line: 58, baseType: !282, size: 16, offset: 80)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "ClientAddr", scope: !668, file: !16, line: 59, baseType: !249, size: 32, offset: 96)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "YourAddr", scope: !668, file: !16, line: 60, baseType: !249, size: 32, offset: 128)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "ServerAddr", scope: !668, file: !16, line: 61, baseType: !249, size: 32, offset: 160)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "GatewayAddr", scope: !668, file: !16, line: 62, baseType: !249, size: 32, offset: 192)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "ClientHwAddr", scope: !668, file: !16, line: 63, baseType: !261, size: 128, offset: 224)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "ServerName", scope: !668, file: !16, line: 64, baseType: !683, size: 512, offset: 352)
!683 = !DICompositeType(tag: DW_TAG_array_type, baseType: !684, size: 512, elements: !686)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHAR8", file: !135, line: 200, baseType: !685)
!685 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!686 = !{!687}
!687 = !DISubrange(count: 64)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "BootFileName", scope: !668, file: !16, line: 65, baseType: !689, size: 1024, offset: 864)
!689 = !DICompositeType(tag: DW_TAG_array_type, baseType: !684, size: 1024, elements: !690)
!690 = !{!691}
!691 = !DISubrange(count: 128)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "Magik", scope: !664, file: !16, line: 89, baseType: !134, size: 32, offset: 1888)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "Option", scope: !664, file: !16, line: 93, baseType: !694, size: 8, offset: 1920)
!694 = !DICompositeType(tag: DW_TAG_array_type, baseType: !191, size: 8, elements: !570)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "Dhcp4", scope: !660, file: !16, line: 94, baseType: !664, size: 1928, offset: 64)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "CallbackContext", scope: !645, file: !16, line: 282, baseType: !139, size: 64, offset: 384)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "OptionCount", scope: !645, file: !16, line: 286, baseType: !134, size: 32, offset: 448)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "OptionList", scope: !645, file: !16, line: 294, baseType: !700, size: 64, offset: 512)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP4_PACKET_OPTION", file: !16, line: 44, baseType: !703)
!703 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_DHCP4_PACKET_OPTION", file: !16, line: 31, size: 24, elements: !704)
!704 = !{!705, !706, !707}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "OpCode", scope: !703, file: !16, line: 35, baseType: !191, size: 8)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !703, file: !16, line: 39, baseType: !191, size: 8, offset: 8)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !703, file: !16, line: 43, baseType: !694, size: 8, offset: 16)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "ClientAddress", scope: !639, file: !16, line: 310, baseType: !249, size: 32, offset: 640)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "ClientMacAddress", scope: !639, file: !16, line: 314, baseType: !186, size: 256, offset: 672)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "ServerAddress", scope: !639, file: !16, line: 318, baseType: !249, size: 32, offset: 928)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "RouterAddress", scope: !639, file: !16, line: 323, baseType: !249, size: 32, offset: 960)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "SubnetMask", scope: !639, file: !16, line: 327, baseType: !249, size: 32, offset: 992)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "LeaseTime", scope: !639, file: !16, line: 333, baseType: !134, size: 32, offset: 1024)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "ReplyPacket", scope: !639, file: !16, line: 337, baseType: !658, size: 64, offset: 1088)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "Configure", scope: !630, file: !16, line: 749, baseType: !716, size: 64, offset: 64)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP4_CONFIGURE", file: !16, line: 476, baseType: !717)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = !DISubroutineType(types: !719)
!719 = !{!160, !628, !720}
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "Start", scope: !630, file: !16, line: 750, baseType: !722, size: 64, offset: 128)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP4_START", file: !16, line: 524, baseType: !723)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DISubroutineType(types: !725)
!725 = !{!160, !628, !290}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "RenewRebind", scope: !630, file: !16, line: 751, baseType: !727, size: 64, offset: 192)
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP4_RENEW_REBIND", file: !16, line: 569, baseType: !728)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = !DISubroutineType(types: !730)
!730 = !{!160, !628, !176, !290}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "Release", scope: !630, file: !16, line: 752, baseType: !732, size: 64, offset: 256)
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP4_RELEASE", file: !16, line: 598, baseType: !733)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = !DISubroutineType(types: !735)
!735 = !{!160, !628}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "Stop", scope: !630, file: !16, line: 753, baseType: !737, size: 64, offset: 320)
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP4_STOP", file: !16, line: 619, baseType: !733)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "Build", scope: !630, file: !16, line: 754, baseType: !739, size: 64, offset: 384)
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP4_BUILD", file: !16, line: 660, baseType: !740)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = !DISubroutineType(types: !742)
!742 = !{!160, !628, !658, !134, !743, !134, !700, !696}
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "TransmitReceive", scope: !630, file: !16, line: 755, baseType: !745, size: 64, offset: 448)
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP4_TRANSMIT_RECEIVE", file: !16, line: 697, baseType: !746)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DISubroutineType(types: !748)
!748 = !{!160, !628, !749}
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP4_TRANSMIT_RECEIVE_TOKEN", file: !16, line: 404, baseType: !751)
!751 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_DHCP4_TRANSMIT_RECEIVE_TOKEN", file: !16, line: 357, size: 576, elements: !752)
!752 = !{!753, !754, !755, !756, !757, !758, !759, !767, !768, !769, !770}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "Status", scope: !751, file: !16, line: 361, baseType: !160, size: 64)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "CompletionEvent", scope: !751, file: !16, line: 366, baseType: !290, size: 64, offset: 64)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "RemoteAddress", scope: !751, file: !16, line: 370, baseType: !249, size: 32, offset: 128)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "RemotePort", scope: !751, file: !16, line: 374, baseType: !282, size: 16, offset: 160)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "GatewayAddress", scope: !751, file: !16, line: 378, baseType: !249, size: 32, offset: 176)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "ListenPointCount", scope: !751, file: !16, line: 382, baseType: !134, size: 32, offset: 224)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "ListenPoints", scope: !751, file: !16, line: 387, baseType: !760, size: 64, offset: 256)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP4_LISTEN_POINT", file: !16, line: 355, baseType: !762)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_DHCP4_LISTEN_POINT", file: !16, line: 340, size: 80, elements: !763)
!763 = !{!764, !765, !766}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "ListenAddress", scope: !762, file: !16, line: 344, baseType: !249, size: 32)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "SubnetMask", scope: !762, file: !16, line: 349, baseType: !249, size: 32, offset: 32)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "ListenPort", scope: !762, file: !16, line: 354, baseType: !282, size: 16, offset: 64)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "TimeoutValue", scope: !751, file: !16, line: 391, baseType: !134, size: 32, offset: 320)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "Packet", scope: !751, file: !16, line: 395, baseType: !658, size: 64, offset: 384)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "ResponseCount", scope: !751, file: !16, line: 399, baseType: !134, size: 32, offset: 448)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "ResponseList", scope: !751, file: !16, line: 403, baseType: !658, size: 64, offset: 512)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "Parse", scope: !630, file: !16, line: 756, baseType: !772, size: 64, offset: 512)
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP4_PARSE", file: !16, line: 736, baseType: !773)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DISubroutineType(types: !775)
!775 = !{!160, !628, !658, !274, !700}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "Mtftp4", scope: !131, file: !130, line: 123, baseType: !777, size: 64, offset: 1088)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_PROTOCOL", file: !779, line: 25, baseType: !780)
!779 = !DIFile(filename: "MdePkg/Include/Protocol/Mtftp4.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "c9a1c8f575ac713db30924bf8cbd8b17")
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_MTFTP4_PROTOCOL", file: !779, line: 499, size: 512, elements: !781)
!781 = !{!782, !809, !815, !889, !895, !926, !928, !930}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "GetModeData", scope: !780, file: !779, line: 500, baseType: !783, size: 64)
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_GET_MODE_DATA", file: !779, line: 263, baseType: !784)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DISubroutineType(types: !786)
!786 = !{!160, !777, !787}
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_MODE_DATA", file: !779, line: 164, baseType: !789)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_MTFTP4_MODE_DATA", file: !779, line: 158, size: 448, elements: !790)
!790 = !{!791, !804, !805, !807, !808}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "ConfigData", scope: !789, file: !779, line: 159, baseType: !792, size: 208)
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_CONFIG_DATA", file: !779, line: 156, baseType: !793)
!793 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_MTFTP4_CONFIG_DATA", file: !779, line: 146, size: 208, elements: !794)
!794 = !{!795, !796, !797, !798, !799, !800, !801, !802, !803}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultSetting", scope: !793, file: !779, line: 147, baseType: !176, size: 8)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "StationIp", scope: !793, file: !779, line: 148, baseType: !249, size: 32, offset: 8)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "SubnetMask", scope: !793, file: !779, line: 149, baseType: !249, size: 32, offset: 40)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "LocalPort", scope: !793, file: !779, line: 150, baseType: !282, size: 16, offset: 80)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "GatewayIp", scope: !793, file: !779, line: 151, baseType: !249, size: 32, offset: 96)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "ServerIp", scope: !793, file: !779, line: 152, baseType: !249, size: 32, offset: 128)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "InitialServerPort", scope: !793, file: !779, line: 153, baseType: !282, size: 16, offset: 160)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "TryCount", scope: !793, file: !779, line: 154, baseType: !282, size: 16, offset: 176)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "TimeoutValue", scope: !793, file: !779, line: 155, baseType: !282, size: 16, offset: 192)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "SupportedOptionCount", scope: !789, file: !779, line: 160, baseType: !191, size: 8, offset: 208)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "SupportedOptoins", scope: !789, file: !779, line: 161, baseType: !806, size: 64, offset: 256)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "UnsupportedOptionCount", scope: !789, file: !779, line: 162, baseType: !191, size: 8, offset: 320)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "UnsupportedOptoins", scope: !789, file: !779, line: 163, baseType: !806, size: 64, offset: 384)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "Configure", scope: !780, file: !779, line: 501, baseType: !810, size: 64, offset: 64)
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_CONFIGURE", file: !779, line: 292, baseType: !811)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = !DISubroutineType(types: !813)
!813 = !{!160, !777, !814}
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "GetInfo", scope: !780, file: !779, line: 502, baseType: !816, size: 64, offset: 128)
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_GET_INFO", file: !779, line: 343, baseType: !817)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = !DISubroutineType(types: !819)
!819 = !{!160, !777, !820, !743, !743, !191, !829, !274, !835}
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_OVERRIDE_DATA", file: !779, line: 172, baseType: !822)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_MTFTP4_OVERRIDE_DATA", file: !779, line: 166, size: 112, elements: !823)
!823 = !{!824, !825, !826, !827, !828}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "GatewayIp", scope: !822, file: !779, line: 167, baseType: !249, size: 32)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "ServerIp", scope: !822, file: !779, line: 168, baseType: !249, size: 32, offset: 32)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "ServerPort", scope: !822, file: !779, line: 169, baseType: !282, size: 16, offset: 64)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "TryCount", scope: !822, file: !779, line: 170, baseType: !282, size: 16, offset: 80)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "TimeoutValue", scope: !822, file: !779, line: 171, baseType: !282, size: 16, offset: 96)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_OPTION", file: !779, line: 144, baseType: !831)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_MTFTP4_OPTION", file: !779, line: 141, size: 128, elements: !832)
!832 = !{!833, !834}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "OptionStr", scope: !831, file: !779, line: 142, baseType: !743, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "ValueStr", scope: !831, file: !779, line: 143, baseType: !743, size: 64, offset: 64)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_PACKET", file: !779, line: 134, baseType: !838)
!838 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "EFI_MTFTP4_PACKET", file: !779, line: 97, size: 88, elements: !839)
!839 = !{!840, !841, !847, !848, !854, !861, !868, !875, !882}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "OpCode", scope: !838, file: !779, line: 101, baseType: !282, size: 16)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "Rrq", scope: !838, file: !779, line: 105, baseType: !842, size: 24)
!842 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_REQ_HEADER", file: !779, line: 62, baseType: !843)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_MTFTP4_REQ_HEADER", file: !779, line: 59, size: 24, elements: !844)
!844 = !{!845, !846}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "OpCode", scope: !843, file: !779, line: 60, baseType: !282, size: 16)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "Filename", scope: !843, file: !779, line: 61, baseType: !694, size: 8, offset: 16)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "Wrq", scope: !838, file: !779, line: 109, baseType: !842, size: 24)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "Oack", scope: !838, file: !779, line: 113, baseType: !849, size: 24)
!849 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_OACK_HEADER", file: !779, line: 67, baseType: !850)
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_MTFTP4_OACK_HEADER", file: !779, line: 64, size: 24, elements: !851)
!851 = !{!852, !853}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "OpCode", scope: !850, file: !779, line: 65, baseType: !282, size: 16)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !850, file: !779, line: 66, baseType: !694, size: 8, offset: 16)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !838, file: !779, line: 117, baseType: !855, size: 40)
!855 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_DATA_HEADER", file: !779, line: 73, baseType: !856)
!856 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_MTFTP4_DATA_HEADER", file: !779, line: 69, size: 40, elements: !857)
!857 = !{!858, !859, !860}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "OpCode", scope: !856, file: !779, line: 70, baseType: !282, size: 16)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "Block", scope: !856, file: !779, line: 71, baseType: !282, size: 16, offset: 16)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !856, file: !779, line: 72, baseType: !694, size: 8, offset: 32)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "Ack", scope: !838, file: !779, line: 121, baseType: !862, size: 32)
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_ACK_HEADER", file: !779, line: 78, baseType: !863)
!863 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_MTFTP4_ACK_HEADER", file: !779, line: 75, size: 32, elements: !864)
!864 = !{!865, !866}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "OpCode", scope: !863, file: !779, line: 76, baseType: !282, size: 16)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "Block", scope: !863, file: !779, line: 77, baseType: !867, size: 16, offset: 16)
!867 = !DICompositeType(tag: DW_TAG_array_type, baseType: !282, size: 16, elements: !570)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "Data8", scope: !838, file: !779, line: 125, baseType: !869, size: 88)
!869 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_DATA8_HEADER", file: !779, line: 84, baseType: !870)
!870 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_MTFTP4_DATA8_HEADER", file: !779, line: 80, size: 88, elements: !871)
!871 = !{!872, !873, !874}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "OpCode", scope: !870, file: !779, line: 81, baseType: !282, size: 16)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "Block", scope: !870, file: !779, line: 82, baseType: !146, size: 64, offset: 16)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !870, file: !779, line: 83, baseType: !694, size: 8, offset: 80)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "Ack8", scope: !838, file: !779, line: 129, baseType: !876, size: 80)
!876 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_ACK8_HEADER", file: !779, line: 89, baseType: !877)
!877 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_MTFTP4_ACK8_HEADER", file: !779, line: 86, size: 80, elements: !878)
!878 = !{!879, !880}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "OpCode", scope: !877, file: !779, line: 87, baseType: !282, size: 16)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "Block", scope: !877, file: !779, line: 88, baseType: !881, size: 64, offset: 16)
!881 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 64, elements: !570)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "Error", scope: !838, file: !779, line: 133, baseType: !883, size: 40)
!883 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_ERROR_HEADER", file: !779, line: 95, baseType: !884)
!884 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_MTFTP4_ERROR_HEADER", file: !779, line: 91, size: 40, elements: !885)
!885 = !{!886, !887, !888}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "OpCode", scope: !884, file: !779, line: 92, baseType: !282, size: 16)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "ErrorCode", scope: !884, file: !779, line: 93, baseType: !282, size: 16, offset: 16)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "ErrorMessage", scope: !884, file: !779, line: 94, baseType: !694, size: 8, offset: 32)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "ParseOptions", scope: !780, file: !779, line: 503, baseType: !890, size: 64, offset: 192)
!890 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_PARSE_OPTIONS", file: !779, line: 378, baseType: !891)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = !DISubroutineType(types: !893)
!893 = !{!160, !777, !134, !836, !274, !894}
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "ReadFile", scope: !780, file: !779, line: 504, baseType: !896, size: 64, offset: 256)
!896 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_READ_FILE", file: !779, line: 411, baseType: !897)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64)
!898 = !DISubroutineType(types: !899)
!899 = !{!160, !777, !900}
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64)
!901 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_TOKEN", file: !779, line: 26, baseType: !902)
!902 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_MTFTP4_TOKEN", file: !779, line: 510, size: 832, elements: !903)
!903 = !{!904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !919, !921}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "Status", scope: !902, file: !779, line: 515, baseType: !160, size: 64)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "Event", scope: !902, file: !779, line: 523, baseType: !290, size: 64, offset: 64)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "OverrideData", scope: !902, file: !779, line: 527, baseType: !820, size: 64, offset: 128)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "Filename", scope: !902, file: !779, line: 531, baseType: !743, size: 64, offset: 192)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "ModeStr", scope: !902, file: !779, line: 535, baseType: !743, size: 64, offset: 256)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "OptionCount", scope: !902, file: !779, line: 539, baseType: !134, size: 32, offset: 320)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "OptionList", scope: !902, file: !779, line: 543, baseType: !829, size: 64, offset: 384)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "BufferSize", scope: !902, file: !779, line: 547, baseType: !146, size: 64, offset: 448)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "Buffer", scope: !902, file: !779, line: 553, baseType: !139, size: 64, offset: 512)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "Context", scope: !902, file: !779, line: 558, baseType: !139, size: 64, offset: 576)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "CheckPacket", scope: !902, file: !779, line: 562, baseType: !915, size: 64, offset: 640)
!915 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_CHECK_PACKET", file: !779, line: 198, baseType: !916)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DISubroutineType(types: !918)
!918 = !{!160, !777, !900, !282, !836}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "TimeoutCallback", scope: !902, file: !779, line: 566, baseType: !920, size: 64, offset: 704)
!920 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_TIMEOUT_CALLBACK", file: !779, line: 221, baseType: !897)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "PacketNeeded", scope: !902, file: !779, line: 570, baseType: !922, size: 64, offset: 768)
!922 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_PACKET_NEEDED", file: !779, line: 243, baseType: !923)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!924 = !DISubroutineType(types: !925)
!925 = !{!160, !777, !900, !281, !275}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "WriteFile", scope: !780, file: !779, line: 505, baseType: !927, size: 64, offset: 320)
!927 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_WRITE_FILE", file: !779, line: 439, baseType: !897)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "ReadDirectory", scope: !780, file: !779, line: 506, baseType: !929, size: 64, offset: 384)
!929 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_READ_DIRECTORY", file: !779, line: 468, baseType: !897)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "Poll", scope: !780, file: !779, line: 507, baseType: !931, size: 64, offset: 448)
!931 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_POLL", file: !779, line: 490, baseType: !932)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = !DISubroutineType(types: !934)
!934 = !{!160, !777}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "Udp4Read", scope: !131, file: !130, line: 124, baseType: !936, size: 64, offset: 1152)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!937 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_UDP4_PROTOCOL", file: !938, line: 32, baseType: !939)
!938 = !DIFile(filename: "MdePkg/Include/Protocol/Udp4.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "b43e113d8bfd3002b7bb0ecd1117fd63")
!939 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_UDP4_PROTOCOL", file: !938, line: 423, size: 512, elements: !940)
!940 = !{!941, !965, !970, !975, !980, !1029, !1031, !1033}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "GetModeData", scope: !939, file: !938, line: 424, baseType: !942, size: 64)
!942 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_UDP4_GET_MODE_DATA", file: !938, line: 142, baseType: !943)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64)
!944 = !DISubroutineType(types: !945)
!945 = !{!160, !936, !946, !430, !475, !292}
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!947 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_UDP4_CONFIG_DATA", file: !938, line: 92, baseType: !948)
!948 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_UDP4_CONFIG_DATA", file: !938, line: 67, size: 288, elements: !949)
!949 = !{!950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "AcceptBroadcast", scope: !948, file: !938, line: 71, baseType: !176, size: 8)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "AcceptPromiscuous", scope: !948, file: !938, line: 72, baseType: !176, size: 8, offset: 8)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "AcceptAnyPort", scope: !948, file: !938, line: 73, baseType: !176, size: 8, offset: 16)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "AllowDuplicatePort", scope: !948, file: !938, line: 74, baseType: !176, size: 8, offset: 24)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "TypeOfService", scope: !948, file: !938, line: 78, baseType: !191, size: 8, offset: 32)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "TimeToLive", scope: !948, file: !938, line: 79, baseType: !191, size: 8, offset: 40)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "DoNotFragment", scope: !948, file: !938, line: 80, baseType: !176, size: 8, offset: 48)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "ReceiveTimeout", scope: !948, file: !938, line: 81, baseType: !134, size: 32, offset: 64)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "TransmitTimeout", scope: !948, file: !938, line: 82, baseType: !134, size: 32, offset: 96)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultAddress", scope: !948, file: !938, line: 86, baseType: !176, size: 8, offset: 128)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "StationAddress", scope: !948, file: !938, line: 87, baseType: !249, size: 32, offset: 136)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "SubnetMask", scope: !948, file: !938, line: 88, baseType: !249, size: 32, offset: 168)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "StationPort", scope: !948, file: !938, line: 89, baseType: !282, size: 16, offset: 208)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "RemoteAddress", scope: !948, file: !938, line: 90, baseType: !249, size: 32, offset: 224)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "RemotePort", scope: !948, file: !938, line: 91, baseType: !282, size: 16, offset: 256)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "Configure", scope: !939, file: !938, line: 425, baseType: !966, size: 64, offset: 64)
!966 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_UDP4_CONFIGURE", file: !938, line: 190, baseType: !967)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64)
!968 = !DISubroutineType(types: !969)
!969 = !{!160, !936, !946}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "Groups", scope: !939, file: !938, line: 426, baseType: !971, size: 64, offset: 128)
!971 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_UDP4_GROUPS", file: !938, line: 226, baseType: !972)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64)
!973 = !DISubroutineType(types: !974)
!974 = !{!160, !936, !176, !457}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "Routes", scope: !939, file: !938, line: 427, baseType: !976, size: 64, offset: 192)
!976 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_UDP4_ROUTES", file: !938, line: 272, baseType: !977)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64)
!978 = !DISubroutineType(types: !979)
!979 = !{!160, !936, !176, !457, !457, !457}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "Transmit", scope: !939, file: !938, line: 428, baseType: !981, size: 64, offset: 256)
!981 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_UDP4_TRANSMIT", file: !938, line: 376, baseType: !982)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
!983 = !DISubroutineType(types: !984)
!984 = !{!160, !936, !985}
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64)
!986 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_UDP4_COMPLETION_TOKEN", file: !938, line: 118, baseType: !987)
!987 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_UDP4_COMPLETION_TOKEN", file: !938, line: 111, size: 192, elements: !988)
!988 = !{!989, !990, !991, !1028}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "Event", scope: !987, file: !938, line: 112, baseType: !290, size: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "Status", scope: !987, file: !938, line: 113, baseType: !160, size: 64, offset: 64)
!991 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !987, file: !938, line: 114, size: 64, elements: !992)
!992 = !{!993, !1017}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "RxData", scope: !991, file: !938, line: 115, baseType: !994, size: 64)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64)
!995 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_UDP4_RECEIVE_DATA", file: !938, line: 109, baseType: !996)
!996 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_UDP4_RECEIVE_DATA", file: !938, line: 102, size: 512, elements: !997)
!997 = !{!998, !999, !1000, !1008, !1009, !1010}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "TimeStamp", scope: !996, file: !938, line: 103, baseType: !525, size: 128)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "RecycleSignal", scope: !996, file: !938, line: 104, baseType: !290, size: 64, offset: 128)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "UdpSession", scope: !996, file: !938, line: 105, baseType: !1001, size: 96, offset: 192)
!1001 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_UDP4_SESSION_DATA", file: !938, line: 66, baseType: !1002)
!1002 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_UDP4_SESSION_DATA", file: !938, line: 61, size: 96, elements: !1003)
!1003 = !{!1004, !1005, !1006, !1007}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "SourceAddress", scope: !1002, file: !938, line: 62, baseType: !249, size: 32)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "SourcePort", scope: !1002, file: !938, line: 63, baseType: !282, size: 16, offset: 32)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "DestinationAddress", scope: !1002, file: !938, line: 64, baseType: !249, size: 32, offset: 48)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "DestinationPort", scope: !1002, file: !938, line: 65, baseType: !282, size: 16, offset: 80)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "DataLength", scope: !996, file: !938, line: 106, baseType: !134, size: 32, offset: 288)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "FragmentCount", scope: !996, file: !938, line: 107, baseType: !134, size: 32, offset: 320)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "FragmentTable", scope: !996, file: !938, line: 108, baseType: !1011, size: 128, offset: 384)
!1011 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1012, size: 128, elements: !570)
!1012 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_UDP4_FRAGMENT_DATA", file: !938, line: 59, baseType: !1013)
!1013 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_UDP4_FRAGMENT_DATA", file: !938, line: 56, size: 128, elements: !1014)
!1014 = !{!1015, !1016}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "FragmentLength", scope: !1013, file: !938, line: 57, baseType: !134, size: 32)
