; ModuleID = './bcfiles/PxeBcBoot.bc'
source_filename = "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main/NetworkPkg/UefiPxeBcDxe/PxeBcBoot.c"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-windows-gnu"


!78 = !DIEnumerator(name: "Dhcp6SendDecline", value: 6)
!79 = !DIEnumerator(name: "Dhcp6SendConfirm", value: 7)
!80 = !DIEnumerator(name: "Dhcp6SendRelease", value: 8)
!81 = !DIEnumerator(name: "Dhcp6EnterRenewing", value: 9)
!82 = !DIEnumerator(name: "Dhcp6EnterRebinding", value: 10)
!83 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !84, line: 192, baseType: !5, size: 32, elements: !85)
!84 = !DIFile(filename: "MdePkg/Include/Protocol/PxeBaseCode.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "5c81517a25a11d0772fd25cf3f99822b")
!85 = !{!86, !87, !88, !89, !90, !91, !92, !93, !94}
!86 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_TFTP_FIRST", value: 0)
!87 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_TFTP_GET_FILE_SIZE", value: 1)
!88 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_TFTP_READ_FILE", value: 2)
!89 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_TFTP_WRITE_FILE", value: 3)
!90 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_TFTP_READ_DIRECTORY", value: 4)
!91 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_MTFTP_GET_FILE_SIZE", value: 5)
!92 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_MTFTP_READ_FILE", value: 6)
!93 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_MTFTP_READ_DIRECTORY", value: 7)
!94 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_MTFTP_LAST", value: 8)
!95 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !96, line: 63, baseType: !5, size: 32, elements: !97)
!96 = !DIFile(filename: "MdePkg/Include/Protocol/PxeBaseCodeCallBack.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "620f8d98f32292d4cb970381b3122ad5")
!97 = !{!98, !99, !100, !101}
!98 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_CALLBACK_STATUS_FIRST", value: 0)
!99 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_CALLBACK_STATUS_CONTINUE", value: 1)
!100 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_CALLBACK_STATUS_ABORT", value: 2)
!101 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_CALLBACK_STATUS_LAST", value: 3)
!102 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !96, line: 48, baseType: !5, size: 32, elements: !103)
!103 = !{!104, !105, !106, !107, !108, !109, !110, !111, !112}
!104 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_FUNCTION_FIRST", value: 0)
!105 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_FUNCTION_DHCP", value: 1)
!106 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_FUNCTION_DISCOVER", value: 2)
!107 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_FUNCTION_MTFTP", value: 3)
!108 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_FUNCTION_UDP_WRITE", value: 4)
!109 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_FUNCTION_UDP_READ", value: 5)
!110 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_FUNCTION_ARP", value: 6)
!111 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_FUNCTION_IGMP", value: 7)
!112 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_PXE_FUNCTION_LAST", value: 8)
!113 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !114, line: 71, baseType: !5, size: 32, elements: !115)
!114 = !DIFile(filename: "NetworkPkg/UefiPxeBcDxe/PxeBcDhcp4.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "71d8c6a5b4dce053943495bbd9962c1e")
!115 = !{!116, !117, !118, !119, !120, !121, !122, !123, !124}
!116 = !DIEnumerator(name: "PxeOfferTypeDhcpOnly", value: 0)
!117 = !DIEnumerator(name: "PxeOfferTypeDhcpPxe10", value: 1)
!118 = !DIEnumerator(name: "PxeOfferTypeDhcpWfm11a", value: 2)
!119 = !DIEnumerator(name: "PxeOfferTypeDhcpBinl", value: 3)
!120 = !DIEnumerator(name: "PxeOfferTypeProxyPxe10", value: 4)
!121 = !DIEnumerator(name: "PxeOfferTypeProxyWfm11a", value: 5)
!122 = !DIEnumerator(name: "PxeOfferTypeProxyBinl", value: 6)
!123 = !DIEnumerator(name: "PxeOfferTypeBootp", value: 7)
!124 = !DIEnumerator(name: "PxeOfferTypeMax", value: 8)
!125 = !{!126, !129, !130, !135, !136, !139, !151, !144, !132, !152, !155, !156, !173, !188, !190, !191}
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT8", file: !127, line: 196, baseType: !128)
!127 = !DIFile(filename: "MdePkg/Include/X64/ProcessorBind.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "ef2524a221fe61206fa09ec88dd4f59b")
!128 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "RETURN_STATUS", file: !131, line: 1026, baseType: !132)
!131 = !DIFile(filename: "MdePkg/Include/Base.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "0c11ea3d1992443d8a8f590a064e50ff")
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINTN", file: !127, line: 211, baseType: !133)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT64", file: !127, line: 162, baseType: !134)
!134 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "BOOLEAN", file: !127, line: 192, baseType: !128)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTN", file: !127, line: 216, baseType: !137)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT64", file: !127, line: 166, baseType: !138)
!138 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "PXEBC_BOOT_MENU_ENTRY", file: !114, line: 231, baseType: !141)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PXEBC_BOOT_MENU_ENTRY", file: !114, line: 227, size: 32, elements: !142)
!142 = !{!143, !146, !147}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !141, file: !114, line: 228, baseType: !144, size: 16)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT16", file: !127, line: 178, baseType: !145)
!145 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "DescLen", scope: !141, file: !114, line: 229, baseType: !126, size: 8, offset: 16)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "DescStr", scope: !141, file: !114, line: 230, baseType: !148, size: 8, offset: 24)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 8, elements: !149)
!149 = !{!150}
!150 = !DISubrange(count: 1)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHAR8", file: !127, line: 200, baseType: !154)
!154 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT32", file: !127, line: 170, baseType: !5)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "PXEBC_BOOT_SVR_ENTRY", file: !114, line: 225, baseType: !158)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PXEBC_BOOT_SVR_ENTRY", file: !114, line: 221, size: 56, elements: !159)
!159 = !{!160, !161, !162}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !158, file: !114, line: 222, baseType: !144, size: 16)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "IpCnt", scope: !158, file: !114, line: 223, baseType: !126, size: 8, offset: 16)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "IpAddr", scope: !158, file: !114, line: 224, baseType: !163, size: 32, offset: 24)
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 32, elements: !149)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IPv4_ADDRESS", file: !165, line: 85, baseType: !166)
!165 = !DIFile(filename: "MdePkg/Include/Uefi/UefiBaseType.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "dbec48e65949dff122bc920c9d9d9c6a")
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPv4_ADDRESS", file: !131, line: 225, baseType: !167)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IPv4_ADDRESS", file: !131, line: 223, size: 32, elements: !168)
!168 = !{!169}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "Addr", scope: !167, file: !131, line: 224, baseType: !170, size: 32)
!170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 32, elements: !171)
!171 = !{!172}
!172 = !DISubrange(count: 4)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "NETWORK_OBJECT", file: !114, line: 250, baseType: !175)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NETWORK_OBJECT", file: !114, line: 247, size: 192, elements: !176)
!176 = !{!177, !182}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "Header", scope: !175, file: !114, line: 248, baseType: !178, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "NETWORK_OBJECT_HEADER", file: !114, line: 240, baseType: !179)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NETWORK_OBJECT_HEADER", file: !114, line: 238, size: 64, elements: !180)
!180 = !{!181}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "ReferenceCount", scope: !179, file: !114, line: 239, baseType: !133, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "Body", scope: !175, file: !114, line: 249, baseType: !183, size: 128, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "NETWORK_OBJECT_BODY", file: !114, line: 245, baseType: !184)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NETWORK_OBJECT_BODY", file: !114, line: 242, size: 128, elements: !185)
!185 = !{!186, !187}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "ContentLength", scope: !184, file: !114, line: 243, baseType: !133, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "ContentData", scope: !184, file: !114, line: 244, baseType: !188, size: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHAR16", file: !127, line: 183, baseType: !145)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!192 = !{!193, !196, !198, !201, !203, !205, !207}
!193 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression(DW_OP_constu, 4, DW_OP_stack_value))
!194 = distinct !DIGlobalVariable(name: "PxeOfferTypeProxyPxe10", scope: !0, file: !114, line: 76, type: !195, isLocal: true, isDefinition: true)
!195 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression(DW_OP_constu, 1, DW_OP_stack_value))
!197 = distinct !DIGlobalVariable(name: "PxeOfferTypeDhcpPxe10", scope: !0, file: !114, line: 73, type: !195, isLocal: true, isDefinition: true)
!198 = !DIGlobalVariableExpression(var: !199, expr: !DIExpression(DW_OP_constu, 2, DW_OP_stack_value))
!199 = distinct !DIGlobalVariable(name: "TimerRelative", scope: !0, file: !200, line: 518, type: !195, isLocal: true, isDefinition: true)
!200 = !DIFile(filename: "MdePkg/Include/Uefi/UefiSpec.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "dd07249351b00161d82576c2d3d57d19")
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression(DW_OP_constu, 1, DW_OP_stack_value))
!202 = distinct !DIGlobalVariable(name: "TimerPeriodic", scope: !0, file: !200, line: 514, type: !195, isLocal: true, isDefinition: true)
!203 = !DIGlobalVariableExpression(var: !204, expr: !DIExpression(DW_OP_constu, 1, DW_OP_stack_value))
!204 = distinct !DIGlobalVariable(name: "EFI_PXE_BASE_CODE_TFTP_GET_FILE_SIZE", scope: !0, file: !84, line: 194, type: !195, isLocal: true, isDefinition: true)
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression(DW_OP_constu, 0, DW_OP_stack_value))
!206 = distinct !DIGlobalVariable(name: "EFI_NATIVE_INTERFACE", scope: !0, file: !200, line: 1148, type: !195, isLocal: true, isDefinition: true)
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression(DW_OP_constu, 2, DW_OP_stack_value))
!208 = distinct !DIGlobalVariable(name: "EFI_PXE_BASE_CODE_TFTP_READ_FILE", scope: !0, file: !84, line: 195, type: !195, isLocal: true, isDefinition: true)
!209 = !{i32 2, !"CodeView", i32 1}
!210 = !{i32 2, !"Debug Info Version", i32 3}
!211 = !{i32 1, !"wchar_size", i32 2}
!212 = !{i32 7, !"PIC Level", i32 2}
!213 = !{i32 1, !"Code Model", i32 1}
!214 = !{i32 7, !"uwtable", i32 1}
!215 = !{i32 1, !"ThinLTO", i32 0}
!216 = !{i32 1, !"EnableSplitLTOUnit", i32 1}
!217 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!218 = distinct !DISubprogram(name: "PxeBcDisplayBootItem", scope: !219, file: !219, line: 23, type: !220, scopeLine: 27, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !222)
!219 = !DIFile(filename: "NetworkPkg/UefiPxeBcDxe/PxeBcBoot.c", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "c1d0d3dd499b97ad21ce851a058dc8ed")
!220 = !DISubroutineType(types: !221)
!221 = !{null, !151, !126}
!222 = !{}
!223 = !DILocalVariable(name: "Str", arg: 1, scope: !218, file: !219, line: 24, type: !151)
!224 = !DILocation(line: 24, scope: !218)
!225 = !DILocalVariable(name: "Len", arg: 2, scope: !218, file: !219, line: 25, type: !126)
!226 = !DILocation(line: 25, scope: !218)
!227 = !DILocalVariable(name: "Tmp", scope: !218, file: !219, line: 28, type: !126)
!228 = !DILocation(line: 28, scope: !218)
!229 = !DILocation(line: 33, scope: !218)
!230 = !DILocation(line: 34, scope: !218)
!231 = !DILocation(line: 35, scope: !218)
!232 = !DILocation(line: 36, scope: !218)
!233 = !DILocation(line: 41, scope: !218)
!234 = !DILocation(line: 42, scope: !218)
!235 = distinct !DISubprogram(name: "PxeBcSelectBootPrompt", scope: !219, file: !219, line: 57, type: !236, scopeLine: 60, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !222)
!236 = !DISubroutineType(types: !237)
!237 = !{!238, !239}
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_STATUS", file: !165, line: 29, baseType: !130)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "PXEBC_PRIVATE_DATA", file: !241, line: 52, baseType: !242)
!241 = !DIFile(filename: "NetworkPkg/UefiPxeBcDxe/PxeBcImpl.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "97799bc64a49caaa653ce382cd21c883")
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PXEBC_PRIVATE_DATA", file: !241, line: 101, size: 352960, elements: !243)
!243 = !{!244, !245, !247, !248, !253, !403, !434, !435, !436, !437, !438, !439, !440, !441, !504, !689, !712, !857, !1016, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1293, !1316, !1449, !1599, !1692, !1693, !1808, !1825, !2056, !2069, !2070, !2071, !2072, !2073, !2074, !2075, !2076, !2077, !2078, !2079, !2080, !2081, !2082, !2083, !2084, !2085, !2086, !2087, !2088, !2089, !2090, !2091, !2092, !2093, !2094, !2095, !2096, !2097, !2098, !2099, !2100, !2101, !2187, !2188, !2189, !2190, !2191, !2192, !2193, !2195, !2196, !2197}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", scope: !242, file: !241, line: 102, baseType: !155, size: 32)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "Controller", scope: !242, file: !241, line: 103, baseType: !246, size: 64, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_HANDLE", file: !165, line: 33, baseType: !129)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !242, file: !241, line: 104, baseType: !246, size: 64, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "Id", scope: !242, file: !241, line: 106, baseType: !249, size: 64, offset: 192)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "PXEBC_PRIVATE_PROTOCOL", file: !241, line: 53, baseType: !250)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PXEBC_PRIVATE_PROTOCOL", file: !241, line: 89, size: 64, elements: !251)
!251 = !{!252}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved", scope: !250, file: !241, line: 90, baseType: !133, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "Snp", scope: !242, file: !241, line: 107, baseType: !254, size: 64, offset: 256)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_NETWORK_PROTOCOL", file: !256, line: 28, baseType: !257)
!256 = !DIFile(filename: "MdePkg/Include/Protocol/SimpleNetwork.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "ce4888de327acb559b98965e4f2a0a5b")
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_SIMPLE_NETWORK_PROTOCOL", file: !256, line: 643, size: 1024, elements: !258)
!258 = !{!259, !260, !265, !267, !272, !277, !279, !292, !297, !333, !354, !359, !365, !371, !376, !378}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "Revision", scope: !257, file: !256, line: 649, baseType: !133, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "Start", scope: !257, file: !256, line: 650, baseType: !261, size: 64, offset: 64)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_NETWORK_START", file: !256, line: 262, baseType: !262)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DISubroutineType(types: !264)
!264 = !{!238, !254}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "Stop", scope: !257, file: !256, line: 651, baseType: !266, size: 64, offset: 128)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_NETWORK_STOP", file: !256, line: 280, baseType: !262)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "Initialize", scope: !257, file: !256, line: 652, baseType: !268, size: 64, offset: 192)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_NETWORK_INITIALIZE", file: !256, line: 312, baseType: !269)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DISubroutineType(types: !271)
!271 = !{!238, !254, !132, !132}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "Reset", scope: !257, file: !256, line: 653, baseType: !273, size: 64, offset: 256)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_NETWORK_RESET", file: !256, line: 336, baseType: !274)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DISubroutineType(types: !276)
!276 = !{!238, !254, !135}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "Shutdown", scope: !257, file: !256, line: 654, baseType: !278, size: 64, offset: 320)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_NETWORK_SHUTDOWN", file: !256, line: 356, baseType: !262)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "ReceiveFilters", scope: !257, file: !256, line: 655, baseType: !280, size: 64, offset: 384)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_NETWORK_RECEIVE_FILTERS", file: !256, line: 386, baseType: !281)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DISubroutineType(types: !283)
!283 = !{!238, !254, !155, !155, !135, !132, !284}
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MAC_ADDRESS", file: !165, line: 97, baseType: !286)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_MAC_ADDRESS", file: !165, line: 95, size: 256, elements: !287)
!287 = !{!288}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "Addr", scope: !286, file: !165, line: 96, baseType: !289, size: 256)
!289 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 256, elements: !290)
!290 = !{!291}
!291 = !DISubrange(count: 32)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "StationAddress", scope: !257, file: !256, line: 656, baseType: !293, size: 64, offset: 448)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_NETWORK_STATION_ADDRESS", file: !256, line: 412, baseType: !294)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DISubroutineType(types: !296)
!296 = !{!238, !254, !135, !284}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "Statistics", scope: !257, file: !256, line: 657, baseType: !298, size: 64, offset: 512)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_NETWORK_STATISTICS", file: !256, line: 441, baseType: !299)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DISubroutineType(types: !301)
!301 = !{!238, !254, !135, !302, !303}
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_NETWORK_STATISTICS", file: !256, line: 136, baseType: !305)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_NETWORK_STATISTICS", file: !256, line: 38, size: 1664, elements: !306)
!306 = !{!307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "RxTotalFrames", scope: !305, file: !256, line: 43, baseType: !133, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "RxGoodFrames", scope: !305, file: !256, line: 48, baseType: !133, size: 64, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "RxUndersizeFrames", scope: !305, file: !256, line: 54, baseType: !133, size: 64, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "RxOversizeFrames", scope: !305, file: !256, line: 60, baseType: !133, size: 64, offset: 192)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "RxDroppedFrames", scope: !305, file: !256, line: 65, baseType: !133, size: 64, offset: 256)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "RxUnicastFrames", scope: !305, file: !256, line: 70, baseType: !133, size: 64, offset: 320)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "RxBroadcastFrames", scope: !305, file: !256, line: 75, baseType: !133, size: 64, offset: 384)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "RxMulticastFrames", scope: !305, file: !256, line: 80, baseType: !133, size: 64, offset: 448)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "RxCrcErrorFrames", scope: !305, file: !256, line: 85, baseType: !133, size: 64, offset: 512)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "RxTotalBytes", scope: !305, file: !256, line: 91, baseType: !133, size: 64, offset: 576)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "TxTotalFrames", scope: !305, file: !256, line: 96, baseType: !133, size: 64, offset: 640)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "TxGoodFrames", scope: !305, file: !256, line: 97, baseType: !133, size: 64, offset: 704)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "TxUndersizeFrames", scope: !305, file: !256, line: 98, baseType: !133, size: 64, offset: 768)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "TxOversizeFrames", scope: !305, file: !256, line: 99, baseType: !133, size: 64, offset: 832)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "TxDroppedFrames", scope: !305, file: !256, line: 100, baseType: !133, size: 64, offset: 896)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "TxUnicastFrames", scope: !305, file: !256, line: 101, baseType: !133, size: 64, offset: 960)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "TxBroadcastFrames", scope: !305, file: !256, line: 102, baseType: !133, size: 64, offset: 1024)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "TxMulticastFrames", scope: !305, file: !256, line: 103, baseType: !133, size: 64, offset: 1088)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "TxCrcErrorFrames", scope: !305, file: !256, line: 104, baseType: !133, size: 64, offset: 1152)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "TxTotalBytes", scope: !305, file: !256, line: 105, baseType: !133, size: 64, offset: 1216)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "Collisions", scope: !305, file: !256, line: 110, baseType: !133, size: 64, offset: 1280)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "UnsupportedProtocol", scope: !305, file: !256, line: 115, baseType: !133, size: 64, offset: 1344)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "RxDuplicatedFrames", scope: !305, file: !256, line: 120, baseType: !133, size: 64, offset: 1408)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "RxDecryptErrorFrames", scope: !305, file: !256, line: 125, baseType: !133, size: 64, offset: 1472)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "TxErrorFrames", scope: !305, file: !256, line: 130, baseType: !133, size: 64, offset: 1536)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "TxRetryFrames", scope: !305, file: !256, line: 135, baseType: !133, size: 64, offset: 1600)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "MCastIpToMac", scope: !257, file: !256, line: 658, baseType: !334, size: 64, offset: 576)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_NETWORK_MCAST_IP_TO_MAC", file: !256, line: 471, baseType: !335)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DISubroutineType(types: !337)
!337 = !{!238, !254, !135, !338, !284}
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP_ADDRESS", file: !165, line: 107, baseType: !340)
!340 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "EFI_IP_ADDRESS", file: !165, line: 103, size: 128, elements: !341)
!341 = !{!342, !344, !345}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "Addr", scope: !340, file: !165, line: 104, baseType: !343, size: 128)
!343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !155, size: 128, elements: !171)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !340, file: !165, line: 105, baseType: !164, size: 32)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !340, file: !165, line: 106, baseType: !346, size: 128)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IPv6_ADDRESS", file: !165, line: 90, baseType: !347)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPv6_ADDRESS", file: !131, line: 232, baseType: !348)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IPv6_ADDRESS", file: !131, line: 230, size: 128, elements: !349)
!349 = !{!350}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "Addr", scope: !348, file: !131, line: 231, baseType: !351, size: 128)
!351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 128, elements: !352)
!352 = !{!353}
!353 = !DISubrange(count: 16)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "NvData", scope: !257, file: !256, line: 659, baseType: !355, size: 64, offset: 640)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_NETWORK_NVDATA", file: !256, line: 500, baseType: !356)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DISubroutineType(types: !358)
!358 = !{!238, !254, !135, !132, !132, !129}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "GetStatus", scope: !257, file: !256, line: 660, baseType: !360, size: 64, offset: 704)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_NETWORK_GET_STATUS", file: !256, line: 535, baseType: !361)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DISubroutineType(types: !363)
!363 = !{!238, !254, !364, !191}
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "Transmit", scope: !257, file: !256, line: 661, baseType: !366, size: 64, offset: 768)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_NETWORK_TRANSMIT", file: !256, line: 576, baseType: !367)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DISubroutineType(types: !369)
!369 = !{!238, !254, !132, !132, !129, !284, !284, !370}
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "Receive", scope: !257, file: !256, line: 662, baseType: !372, size: 64, offset: 832)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_NETWORK_RECEIVE", file: !256, line: 620, baseType: !373)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DISubroutineType(types: !375)
!375 = !{!238, !254, !302, !302, !129, !284, !284, !370}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "WaitForPacket", scope: !257, file: !256, line: 666, baseType: !377, size: 64, offset: 896)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_EVENT", file: !165, line: 37, baseType: !129)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "Mode", scope: !257, file: !256, line: 670, baseType: !379, size: 64, offset: 960)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_NETWORK_MODE", file: !256, line: 242, baseType: !381)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_SIMPLE_NETWORK_MODE", file: !256, line: 162, size: 5248, elements: !382)
!382 = !{!383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !395, !396, !397, !398, !399, !400, !401, !402}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "State", scope: !381, file: !256, line: 166, baseType: !155, size: 32)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "HwAddressSize", scope: !381, file: !256, line: 170, baseType: !155, size: 32, offset: 32)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "MediaHeaderSize", scope: !381, file: !256, line: 174, baseType: !155, size: 32, offset: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "MaxPacketSize", scope: !381, file: !256, line: 178, baseType: !155, size: 32, offset: 96)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "NvRamSize", scope: !381, file: !256, line: 182, baseType: !155, size: 32, offset: 128)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "NvRamAccessSize", scope: !381, file: !256, line: 189, baseType: !155, size: 32, offset: 160)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "ReceiveFilterMask", scope: !381, file: !256, line: 193, baseType: !155, size: 32, offset: 192)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "ReceiveFilterSetting", scope: !381, file: !256, line: 197, baseType: !155, size: 32, offset: 224)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "MaxMCastFilterCount", scope: !381, file: !256, line: 201, baseType: !155, size: 32, offset: 256)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "MCastFilterCount", scope: !381, file: !256, line: 205, baseType: !155, size: 32, offset: 288)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "MCastFilter", scope: !381, file: !256, line: 209, baseType: !394, size: 4096, offset: 320)
!394 = !DICompositeType(tag: DW_TAG_array_type, baseType: !285, size: 4096, elements: !352)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "CurrentAddress", scope: !381, file: !256, line: 213, baseType: !285, size: 256, offset: 4416)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "BroadcastAddress", scope: !381, file: !256, line: 217, baseType: !285, size: 256, offset: 4672)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "PermanentAddress", scope: !381, file: !256, line: 221, baseType: !285, size: 256, offset: 4928)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "IfType", scope: !381, file: !256, line: 225, baseType: !126, size: 8, offset: 5184)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "MacAddressChangeable", scope: !381, file: !256, line: 229, baseType: !135, size: 8, offset: 5192)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "MultipleTxSupported", scope: !381, file: !256, line: 233, baseType: !135, size: 8, offset: 5200)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "MediaPresentSupported", scope: !381, file: !256, line: 237, baseType: !135, size: 8, offset: 5208)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "MediaPresent", scope: !381, file: !256, line: 241, baseType: !135, size: 8, offset: 5216)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "Ip4Nic", scope: !242, file: !241, line: 109, baseType: !404, size: 64, offset: 320)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "PXEBC_VIRTUAL_NIC", file: !241, line: 54, baseType: !406)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PXEBC_VIRTUAL_NIC", file: !241, line: 93, size: 320, elements: !407)
!407 = !{!408, !409, !410, !432, !433}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", scope: !406, file: !241, line: 94, baseType: !155, size: 32)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "Controller", scope: !406, file: !241, line: 95, baseType: !246, size: 64, offset: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "LoadFile", scope: !406, file: !241, line: 96, baseType: !411, size: 64, offset: 128)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_LOAD_FILE_PROTOCOL", file: !412, line: 28, baseType: !413)
!412 = !DIFile(filename: "MdePkg/Include/Protocol/LoadFile.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "15734a5f551782ac503b5b1cf42f1c66")
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_LOAD_FILE_PROTOCOL", file: !412, line: 76, size: 64, elements: !414)
!414 = !{!415}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "LoadFile", scope: !413, file: !412, line: 77, baseType: !416, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_LOAD_FILE", file: !412, line: 65, baseType: !417)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DISubroutineType(types: !419)
!419 = !{!238, !420, !421, !135, !302, !129}
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DEVICE_PATH_PROTOCOL", file: !423, line: 58, baseType: !424)
!423 = !DIFile(filename: "MdePkg/Include/Protocol/DevicePath.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "6b6d593d171f69b933a87911e52d4607")
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_DEVICE_PATH_PROTOCOL", file: !423, line: 43, size: 32, elements: !425)
!425 = !{!426, !427, !428}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !424, file: !423, line: 44, baseType: !126, size: 8)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "SubType", scope: !424, file: !423, line: 51, baseType: !126, size: 8, offset: 8)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !424, file: !423, line: 56, baseType: !429, size: 16, offset: 16)
!429 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 16, elements: !430)
!430 = !{!431}
!431 = !DISubrange(count: 2)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "DevicePath", scope: !406, file: !241, line: 97, baseType: !421, size: 64, offset: 192)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "Private", scope: !406, file: !241, line: 98, baseType: !239, size: 64, offset: 256)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "Ip6Nic", scope: !242, file: !241, line: 110, baseType: !404, size: 64, offset: 384)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "ArpChild", scope: !242, file: !241, line: 112, baseType: !246, size: 64, offset: 448)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "Ip4Child", scope: !242, file: !241, line: 113, baseType: !246, size: 64, offset: 512)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "Dhcp4Child", scope: !242, file: !241, line: 114, baseType: !246, size: 64, offset: 576)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "Mtftp4Child", scope: !242, file: !241, line: 115, baseType: !246, size: 64, offset: 640)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "Udp4ReadChild", scope: !242, file: !241, line: 116, baseType: !246, size: 64, offset: 704)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "Udp4WriteChild", scope: !242, file: !241, line: 117, baseType: !246, size: 64, offset: 768)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "Arp", scope: !242, file: !241, line: 119, baseType: !442, size: 64, offset: 832)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_ARP_PROTOCOL", file: !444, line: 31, baseType: !445)
!444 = !DIFile(filename: "MdePkg/Include/Protocol/Arp.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "8142067718decedafa618d42505fb9b3")
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_ARP_PROTOCOL", file: !444, line: 363, size: 448, elements: !446)
!446 = !{!447, !462, !467, !484, !489, !494, !499}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "Configure", scope: !445, file: !444, line: 364, baseType: !448, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_ARP_CONFIGURE", file: !444, line: 142, baseType: !449)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DISubroutineType(types: !451)
!451 = !{!238, !442, !452}
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_ARP_CONFIG_DATA", file: !444, line: 110, baseType: !454)
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_ARP_CONFIG_DATA", file: !444, line: 72, size: 256, elements: !455)
!455 = !{!456, !457, !458, !459, !460, !461}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "SwAddressType", scope: !454, file: !444, line: 76, baseType: !144, size: 16)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "SwAddressLength", scope: !454, file: !444, line: 81, baseType: !126, size: 8, offset: 16)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "StationAddress", scope: !454, file: !444, line: 89, baseType: !129, size: 64, offset: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "EntryTimeOut", scope: !454, file: !444, line: 96, baseType: !155, size: 32, offset: 128)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "RetryCount", scope: !454, file: !444, line: 102, baseType: !155, size: 32, offset: 160)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "RetryTimeOut", scope: !454, file: !444, line: 109, baseType: !155, size: 32, offset: 192)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "Add", scope: !445, file: !444, line: 365, baseType: !463, size: 64, offset: 64)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_ARP_ADD", file: !444, line: 194, baseType: !464)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DISubroutineType(types: !466)
!466 = !{!238, !442, !135, !129, !129, !155, !135}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "Find", scope: !445, file: !444, line: 366, baseType: !468, size: 64, offset: 128)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_ARP_FIND", file: !444, line: 239, baseType: !469)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DISubroutineType(types: !471)
!471 = !{!238, !442, !135, !129, !364, !364, !472, !135}
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_ARP_FIND_DATA", file: !444, line: 70, baseType: !475)
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_ARP_FIND_DATA", file: !444, line: 33, size: 96, elements: !476)
!476 = !{!477, !478, !479, !480, !481, !482, !483}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !475, file: !444, line: 37, baseType: !155, size: 32)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "DenyFlag", scope: !475, file: !444, line: 43, baseType: !135, size: 8, offset: 32)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "StaticFlag", scope: !475, file: !444, line: 49, baseType: !135, size: 8, offset: 40)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "HwAddressType", scope: !475, file: !444, line: 54, baseType: !144, size: 16, offset: 48)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "SwAddressType", scope: !475, file: !444, line: 59, baseType: !144, size: 16, offset: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "HwAddressLength", scope: !475, file: !444, line: 64, baseType: !126, size: 8, offset: 80)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "SwAddressLength", scope: !475, file: !444, line: 69, baseType: !126, size: 8, offset: 88)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "Delete", scope: !445, file: !444, line: 367, baseType: !485, size: 64, offset: 192)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_ARP_DELETE", file: !444, line: 268, baseType: !486)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = !DISubroutineType(types: !488)
!488 = !{!238, !442, !135, !129}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "Flush", scope: !445, file: !444, line: 368, baseType: !490, size: 64, offset: 256)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_ARP_FLUSH", file: !444, line: 288, baseType: !491)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DISubroutineType(types: !493)
!493 = !{!238, !442}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "Request", scope: !445, file: !444, line: 369, baseType: !495, size: 64, offset: 320)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_ARP_REQUEST", file: !444, line: 316, baseType: !496)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DISubroutineType(types: !498)
!498 = !{!238, !442, !129, !377, !129}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "Cancel", scope: !445, file: !444, line: 370, baseType: !500, size: 64, offset: 384)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_ARP_CANCEL", file: !444, line: 353, baseType: !501)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DISubroutineType(types: !503)
!503 = !{!238, !442, !129, !377}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "Ip4", scope: !242, file: !241, line: 120, baseType: !505, size: 64, offset: 896)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_PROTOCOL", file: !507, line: 36, baseType: !508)
!507 = !DIFile(filename: "MdePkg/Include/Protocol/Ip4.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "1ff13a8b379fde89ccc818c3d7035657")
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_IP4_PROTOCOL", file: !507, line: 588, size: 512, elements: !509)
!509 = !{!510, !577, !583, !588, !593, !680, !682, !684}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "GetModeData", scope: !508, file: !507, line: 589, baseType: !511, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_GET_MODE_DATA", file: !507, line: 282, baseType: !512)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DISubroutineType(types: !514)
!514 = !{!238, !515, !517, !562, !379}
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !506)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_MODE_DATA", file: !507, line: 182, baseType: !519)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_IP4_MODE_DATA", file: !507, line: 141, size: 704, elements: !520)
!520 = !{!521, !522, !523, !541, !542, !543, !545, !546, !554, !555}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "IsStarted", scope: !519, file: !507, line: 145, baseType: !135, size: 8)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "MaxPacketSize", scope: !519, file: !507, line: 149, baseType: !155, size: 32, offset: 32)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "ConfigData", scope: !519, file: !507, line: 153, baseType: !524, size: 224, offset: 64)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_CONFIG_DATA", file: !507, line: 128, baseType: !525)
!525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_IP4_CONFIG_DATA", file: !507, line: 58, size: 224, elements: !526)
!526 = !{!527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "DefaultProtocol", scope: !525, file: !507, line: 63, baseType: !126, size: 8)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "AcceptAnyProtocol", scope: !525, file: !507, line: 69, baseType: !135, size: 8, offset: 8)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "AcceptIcmpErrors", scope: !525, file: !507, line: 74, baseType: !135, size: 8, offset: 16)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "AcceptBroadcast", scope: !525, file: !507, line: 80, baseType: !135, size: 8, offset: 24)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "AcceptPromiscuous", scope: !525, file: !507, line: 86, baseType: !135, size: 8, offset: 32)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultAddress", scope: !525, file: !507, line: 90, baseType: !135, size: 8, offset: 40)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "StationAddress", scope: !525, file: !507, line: 94, baseType: !164, size: 32, offset: 48)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "SubnetMask", scope: !525, file: !507, line: 98, baseType: !164, size: 32, offset: 80)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "TypeOfService", scope: !525, file: !507, line: 102, baseType: !126, size: 8, offset: 112)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "TimeToLive", scope: !525, file: !507, line: 106, baseType: !126, size: 8, offset: 120)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "DoNotFragment", scope: !525, file: !507, line: 110, baseType: !135, size: 8, offset: 128)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "RawData", scope: !525, file: !507, line: 115, baseType: !135, size: 8, offset: 136)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "ReceiveTimeout", scope: !525, file: !507, line: 121, baseType: !155, size: 32, offset: 160)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "TransmitTimeout", scope: !525, file: !507, line: 127, baseType: !155, size: 32, offset: 192)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "IsConfigured", scope: !519, file: !507, line: 157, baseType: !135, size: 8, offset: 288)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "GroupCount", scope: !519, file: !507, line: 161, baseType: !155, size: 32, offset: 320)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "GroupTable", scope: !519, file: !507, line: 165, baseType: !544, size: 64, offset: 384)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "RouteCount", scope: !519, file: !507, line: 169, baseType: !155, size: 32, offset: 448)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "RouteTable", scope: !519, file: !507, line: 173, baseType: !547, size: 64, offset: 512)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_ROUTE_TABLE", file: !507, line: 134, baseType: !549)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_IP4_ROUTE_TABLE", file: !507, line: 130, size: 96, elements: !550)
!550 = !{!551, !552, !553}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "SubnetAddress", scope: !549, file: !507, line: 131, baseType: !164, size: 32)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "SubnetMask", scope: !549, file: !507, line: 132, baseType: !164, size: 32, offset: 32)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "GatewayAddress", scope: !549, file: !507, line: 133, baseType: !164, size: 32, offset: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "IcmpTypeCount", scope: !519, file: !507, line: 177, baseType: !155, size: 32, offset: 576)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "IcmpTypeList", scope: !519, file: !507, line: 181, baseType: !556, size: 64, offset: 640)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_ICMP_TYPE", file: !507, line: 139, baseType: !558)
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_IP4_ICMP_TYPE", file: !507, line: 136, size: 16, elements: !559)
!559 = !{!560, !561}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !558, file: !507, line: 137, baseType: !126, size: 8)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "Code", scope: !558, file: !507, line: 138, baseType: !126, size: 8, offset: 8)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MANAGED_NETWORK_CONFIG_DATA", file: !564, line: 84, baseType: !565)
!564 = !DIFile(filename: "MdePkg/Include/Protocol/ManagedNetwork.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "8951452d2c79255944d265d14ed27585")
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_MANAGED_NETWORK_CONFIG_DATA", file: !564, line: 30, size: 160, elements: !566)
!566 = !{!567, !568, !569, !570, !571, !572, !573, !574, !575, !576}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "ReceivedQueueTimeoutValue", scope: !565, file: !564, line: 35, baseType: !155, size: 32)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "TransmitQueueTimeoutValue", scope: !565, file: !564, line: 40, baseType: !155, size: 32, offset: 32)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "ProtocolTypeFilter", scope: !565, file: !564, line: 45, baseType: !144, size: 16, offset: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "EnableUnicastReceive", scope: !565, file: !564, line: 50, baseType: !135, size: 8, offset: 80)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "EnableMulticastReceive", scope: !565, file: !564, line: 55, baseType: !135, size: 8, offset: 88)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "EnableBroadcastReceive", scope: !565, file: !564, line: 60, baseType: !135, size: 8, offset: 96)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "EnablePromiscuousReceive", scope: !565, file: !564, line: 65, baseType: !135, size: 8, offset: 104)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "FlushQueuesOnReset", scope: !565, file: !564, line: 70, baseType: !135, size: 8, offset: 112)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "EnableReceiveTimestamps", scope: !565, file: !564, line: 76, baseType: !135, size: 8, offset: 120)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "DisableBackgroundPolling", scope: !565, file: !564, line: 83, baseType: !135, size: 8, offset: 128)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "Configure", scope: !508, file: !507, line: 590, baseType: !578, size: 64, offset: 64)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_CONFIGURE", file: !507, line: 337, baseType: !579)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = !DISubroutineType(types: !581)
!581 = !{!238, !505, !582}
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "Groups", scope: !508, file: !507, line: 591, baseType: !584, size: 64, offset: 128)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_GROUPS", file: !507, line: 374, baseType: !585)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = !DISubroutineType(types: !587)
!587 = !{!238, !505, !135, !544}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "Routes", scope: !508, file: !507, line: 592, baseType: !589, size: 64, offset: 192)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_ROUTES", file: !507, line: 432, baseType: !590)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DISubroutineType(types: !592)
!592 = !{!238, !505, !135, !544, !544, !544}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "Transmit", scope: !508, file: !507, line: 593, baseType: !594, size: 64, offset: 256)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_TRANSMIT", file: !507, line: 471, baseType: !595)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DISubroutineType(types: !597)
!597 = !{!238, !505, !598}
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_COMPLETION_TOKEN", file: !507, line: 260, baseType: !600)
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_IP4_COMPLETION_TOKEN", file: !507, line: 237, size: 192, elements: !601)
!601 = !{!602, !603, !604, !679}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "Event", scope: !600, file: !507, line: 244, baseType: !377, size: 64)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "Status", scope: !600, file: !507, line: 249, baseType: !238, size: 64, offset: 64)
!604 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !600, file: !507, line: 250, size: 64, elements: !605)
!605 = !{!606, !657}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "RxData", scope: !604, file: !507, line: 254, baseType: !607, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_RECEIVE_DATA", file: !507, line: 216, baseType: !609)
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_IP4_RECEIVE_DATA", file: !507, line: 206, size: 640, elements: !610)
!610 = !{!611, !628, !629, !630, !646, !647, !648, !649, !650}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "TimeStamp", scope: !609, file: !507, line: 207, baseType: !612, size: 128)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TIME", file: !165, line: 80, baseType: !613)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_TIME", file: !165, line: 68, size: 128, elements: !614)
!614 = !{!615, !616, !617, !618, !619, !620, !621, !622, !623, !626, !627}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "Year", scope: !613, file: !165, line: 69, baseType: !144, size: 16)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "Month", scope: !613, file: !165, line: 70, baseType: !126, size: 8, offset: 16)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "Day", scope: !613, file: !165, line: 71, baseType: !126, size: 8, offset: 24)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "Hour", scope: !613, file: !165, line: 72, baseType: !126, size: 8, offset: 32)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "Minute", scope: !613, file: !165, line: 73, baseType: !126, size: 8, offset: 40)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "Second", scope: !613, file: !165, line: 74, baseType: !126, size: 8, offset: 48)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "Pad1", scope: !613, file: !165, line: 75, baseType: !126, size: 8, offset: 56)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "Nanosecond", scope: !613, file: !165, line: 76, baseType: !155, size: 32, offset: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "TimeZone", scope: !613, file: !165, line: 77, baseType: !624, size: 16, offset: 96)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT16", file: !127, line: 187, baseType: !625)
!625 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "Daylight", scope: !613, file: !165, line: 78, baseType: !126, size: 8, offset: 112)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "Pad2", scope: !613, file: !165, line: 79, baseType: !126, size: 8, offset: 120)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "RecycleSignal", scope: !609, file: !507, line: 208, baseType: !377, size: 64, offset: 128)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "HeaderLength", scope: !609, file: !507, line: 209, baseType: !155, size: 32, offset: 192)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "Header", scope: !609, file: !507, line: 210, baseType: !631, size: 64, offset: 256)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_HEADER", file: !507, line: 198, baseType: !633)
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_IP4_HEADER", file: !507, line: 186, size: 160, elements: !634)
!634 = !{!635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "HeaderLength", scope: !633, file: !507, line: 187, baseType: !126, size: 4, flags: DIFlagBitField, extraData: i64 0)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "Version", scope: !633, file: !507, line: 188, baseType: !126, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "TypeOfService", scope: !633, file: !507, line: 189, baseType: !126, size: 8, offset: 8)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "TotalLength", scope: !633, file: !507, line: 190, baseType: !144, size: 16, offset: 16)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "Identification", scope: !633, file: !507, line: 191, baseType: !144, size: 16, offset: 32)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "Fragmentation", scope: !633, file: !507, line: 192, baseType: !144, size: 16, offset: 48)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "TimeToLive", scope: !633, file: !507, line: 193, baseType: !126, size: 8, offset: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "Protocol", scope: !633, file: !507, line: 194, baseType: !126, size: 8, offset: 72)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "Checksum", scope: !633, file: !507, line: 195, baseType: !144, size: 16, offset: 80)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "SourceAddress", scope: !633, file: !507, line: 196, baseType: !164, size: 32, offset: 96)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "DestinationAddress", scope: !633, file: !507, line: 197, baseType: !164, size: 32, offset: 128)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "OptionsLength", scope: !609, file: !507, line: 211, baseType: !155, size: 32, offset: 320)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "Options", scope: !609, file: !507, line: 212, baseType: !129, size: 64, offset: 384)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "DataLength", scope: !609, file: !507, line: 213, baseType: !155, size: 32, offset: 448)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "FragmentCount", scope: !609, file: !507, line: 214, baseType: !155, size: 32, offset: 480)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "FragmentTable", scope: !609, file: !507, line: 215, baseType: !651, size: 128, offset: 512)
!651 = !DICompositeType(tag: DW_TAG_array_type, baseType: !652, size: 128, elements: !149)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_FRAGMENT_DATA", file: !507, line: 204, baseType: !653)
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_IP4_FRAGMENT_DATA", file: !507, line: 201, size: 128, elements: !654)
!654 = !{!655, !656}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "FragmentLength", scope: !653, file: !507, line: 202, baseType: !155, size: 32)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "FragmentBuffer", scope: !653, file: !507, line: 203, baseType: !129, size: 64, offset: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "TxData", scope: !604, file: !507, line: 258, baseType: !658, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_TRANSMIT_DATA", file: !507, line: 235, baseType: !660)
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_IP4_TRANSMIT_DATA", file: !507, line: 227, size: 448, elements: !661)
!661 = !{!662, !663, !674, !675, !676, !677, !678}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "DestinationAddress", scope: !660, file: !507, line: 228, baseType: !164, size: 32)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "OverrideData", scope: !660, file: !507, line: 229, baseType: !664, size: 64, offset: 64)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_OVERRIDE_DATA", file: !507, line: 225, baseType: !666)
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_IP4_OVERRIDE_DATA", file: !507, line: 218, size: 96, elements: !667)
!667 = !{!668, !669, !670, !671, !672, !673}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "SourceAddress", scope: !666, file: !507, line: 219, baseType: !164, size: 32)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "GatewayAddress", scope: !666, file: !507, line: 220, baseType: !164, size: 32, offset: 32)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "Protocol", scope: !666, file: !507, line: 221, baseType: !126, size: 8, offset: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "TypeOfService", scope: !666, file: !507, line: 222, baseType: !126, size: 8, offset: 72)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "TimeToLive", scope: !666, file: !507, line: 223, baseType: !126, size: 8, offset: 80)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "DoNotFragment", scope: !666, file: !507, line: 224, baseType: !135, size: 8, offset: 88)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "OptionsLength", scope: !660, file: !507, line: 230, baseType: !155, size: 32, offset: 128)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "OptionsBuffer", scope: !660, file: !507, line: 231, baseType: !129, size: 64, offset: 192)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "TotalDataLength", scope: !660, file: !507, line: 232, baseType: !155, size: 32, offset: 256)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "FragmentCount", scope: !660, file: !507, line: 233, baseType: !155, size: 32, offset: 288)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "FragmentTable", scope: !660, file: !507, line: 234, baseType: !651, size: 128, offset: 320)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "Packet", scope: !600, file: !507, line: 259, baseType: !604, size: 64, offset: 128)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "Receive", scope: !508, file: !507, line: 594, baseType: !681, size: 64, offset: 320)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_RECEIVE", file: !507, line: 510, baseType: !595)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "Cancel", scope: !508, file: !507, line: 595, baseType: !683, size: 64, offset: 384)
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_CANCEL", file: !507, line: 546, baseType: !595)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "Poll", scope: !508, file: !507, line: 596, baseType: !685, size: 64, offset: 448)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_POLL", file: !507, line: 580, baseType: !686)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = !DISubroutineType(types: !688)
!688 = !{!238, !505}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "Ip4Config2", scope: !242, file: !241, line: 121, baseType: !690, size: 64, offset: 960)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_CONFIG2_PROTOCOL", file: !4, line: 23, baseType: !692)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_IP4_CONFIG2_PROTOCOL", file: !4, line: 307, size: 256, elements: !693)
!693 = !{!694, !700, !705, !710}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "SetData", scope: !692, file: !4, line: 308, baseType: !695, size: 64)
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_CONFIG2_SET_DATA", file: !4, line: 203, baseType: !696)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DISubroutineType(types: !698)
!698 = !{!238, !690, !699, !132, !129}
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_CONFIG2_DATA_TYPE", file: !4, line: 76, baseType: !3)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "GetData", scope: !692, file: !4, line: 309, baseType: !701, size: 64, offset: 64)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_CONFIG2_GET_DATA", file: !4, line: 245, baseType: !702)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = !DISubroutineType(types: !704)
!704 = !{!238, !690, !699, !302, !129}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "RegisterDataNotify", scope: !692, file: !4, line: 310, baseType: !706, size: 64, offset: 128)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_CONFIG2_REGISTER_NOTIFY", file: !4, line: 274, baseType: !707)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = !DISubroutineType(types: !709)
!709 = !{!238, !690, !699, !377}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "UnregisterDataNotify", scope: !692, file: !4, line: 311, baseType: !711, size: 64, offset: 192)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IP4_CONFIG2_UNREGISTER_NOTIFY", file: !4, line: 295, baseType: !707)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "Dhcp4", scope: !242, file: !241, line: 122, baseType: !713, size: 64, offset: 1024)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP4_PROTOCOL", file: !14, line: 28, baseType: !715)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_DHCP4_PROTOCOL", file: !14, line: 747, size: 576, elements: !716)
!716 = !{!717, !797, !803, !808, !813, !818, !820, !825, !852}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "GetModeData", scope: !715, file: !14, line: 748, baseType: !718, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP4_GET_MODE_DATA", file: !14, line: 421, baseType: !719)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = !DISubroutineType(types: !721)
!721 = !{!238, !713, !722}
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP4_MODE_DATA", file: !14, line: 338, baseType: !724)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_DHCP4_MODE_DATA", file: !14, line: 297, size: 1152, elements: !725)
!725 = !{!726, !728, !790, !791, !792, !793, !794, !795, !796}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "State", scope: !724, file: !14, line: 301, baseType: !727, size: 32)
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP4_STATE", file: !14, line: 139, baseType: !13)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "ConfigData", scope: !724, file: !14, line: 305, baseType: !729, size: 576, offset: 64)
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP4_CONFIG_DATA", file: !14, line: 295, baseType: !730)
!730 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_DHCP4_CONFIG_DATA", file: !14, line: 241, size: 576, elements: !731)
!731 = !{!732, !733, !734, !735, !736, !737, !779, !780, !781}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "DiscoverTryCount", scope: !730, file: !14, line: 247, baseType: !155, size: 32)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "DiscoverTimeout", scope: !730, file: !14, line: 253, baseType: !364, size: 64, offset: 64)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "RequestTryCount", scope: !730, file: !14, line: 259, baseType: !155, size: 32, offset: 128)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "RequestTimeout", scope: !730, file: !14, line: 265, baseType: !364, size: 64, offset: 192)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "ClientAddress", scope: !730, file: !14, line: 273, baseType: !164, size: 32, offset: 256)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "Dhcp4Callback", scope: !730, file: !14, line: 278, baseType: !738, size: 64, offset: 320)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP4_CALLBACK", file: !14, line: 232, baseType: !739)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DISubroutineType(types: !741)
!741 = !{!238, !713, !129, !727, !742, !743, !778}
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP4_EVENT", file: !14, line: 196, baseType: !25)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP4_PACKET", file: !14, line: 95, baseType: !745)
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_DHCP4_PACKET", file: !14, line: 70, size: 1992, elements: !746)
!746 = !{!747, !748, !749, !777}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !745, file: !14, line: 74, baseType: !155, size: 32)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !745, file: !14, line: 79, baseType: !155, size: 32, offset: 32)
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !745, file: !14, line: 81, size: 1928, elements: !750)
!750 = !{!751, !775, !776}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "Header", scope: !749, file: !14, line: 85, baseType: !752, size: 1888)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP4_HEADER", file: !14, line: 66, baseType: !753)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_DHCP4_HEADER", file: !14, line: 51, size: 1888, elements: !754)
!754 = !{!755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !771}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "OpCode", scope: !753, file: !14, line: 52, baseType: !126, size: 8)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "HwType", scope: !753, file: !14, line: 53, baseType: !126, size: 8, offset: 8)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "HwAddrLen", scope: !753, file: !14, line: 54, baseType: !126, size: 8, offset: 16)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "Hops", scope: !753, file: !14, line: 55, baseType: !126, size: 8, offset: 24)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "Xid", scope: !753, file: !14, line: 56, baseType: !155, size: 32, offset: 32)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "Seconds", scope: !753, file: !14, line: 57, baseType: !144, size: 16, offset: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved", scope: !753, file: !14, line: 58, baseType: !144, size: 16, offset: 80)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "ClientAddr", scope: !753, file: !14, line: 59, baseType: !164, size: 32, offset: 96)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "YourAddr", scope: !753, file: !14, line: 60, baseType: !164, size: 32, offset: 128)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "ServerAddr", scope: !753, file: !14, line: 61, baseType: !164, size: 32, offset: 160)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "GatewayAddr", scope: !753, file: !14, line: 62, baseType: !164, size: 32, offset: 192)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "ClientHwAddr", scope: !753, file: !14, line: 63, baseType: !351, size: 128, offset: 224)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "ServerName", scope: !753, file: !14, line: 64, baseType: !768, size: 512, offset: 352)
!768 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 512, elements: !769)
!769 = !{!770}
!770 = !DISubrange(count: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "BootFileName", scope: !753, file: !14, line: 65, baseType: !772, size: 1024, offset: 864)
!772 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 1024, elements: !773)
!773 = !{!774}
!774 = !DISubrange(count: 128)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "Magik", scope: !749, file: !14, line: 89, baseType: !155, size: 32, offset: 1888)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "Option", scope: !749, file: !14, line: 93, baseType: !148, size: 8, offset: 1920)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "Dhcp4", scope: !745, file: !14, line: 94, baseType: !749, size: 1928, offset: 64)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "CallbackContext", scope: !730, file: !14, line: 282, baseType: !129, size: 64, offset: 384)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "OptionCount", scope: !730, file: !14, line: 286, baseType: !155, size: 32, offset: 448)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "OptionList", scope: !730, file: !14, line: 294, baseType: !782, size: 64, offset: 512)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP4_PACKET_OPTION", file: !14, line: 44, baseType: !785)
!785 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_DHCP4_PACKET_OPTION", file: !14, line: 31, size: 24, elements: !786)
!786 = !{!787, !788, !789}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "OpCode", scope: !785, file: !14, line: 35, baseType: !126, size: 8)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !785, file: !14, line: 39, baseType: !126, size: 8, offset: 8)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !785, file: !14, line: 43, baseType: !148, size: 8, offset: 16)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "ClientAddress", scope: !724, file: !14, line: 310, baseType: !164, size: 32, offset: 640)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "ClientMacAddress", scope: !724, file: !14, line: 314, baseType: !285, size: 256, offset: 672)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "ServerAddress", scope: !724, file: !14, line: 318, baseType: !164, size: 32, offset: 928)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "RouterAddress", scope: !724, file: !14, line: 323, baseType: !164, size: 32, offset: 960)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "SubnetMask", scope: !724, file: !14, line: 327, baseType: !164, size: 32, offset: 992)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "LeaseTime", scope: !724, file: !14, line: 333, baseType: !155, size: 32, offset: 1024)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "ReplyPacket", scope: !724, file: !14, line: 337, baseType: !743, size: 64, offset: 1088)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "Configure", scope: !715, file: !14, line: 749, baseType: !798, size: 64, offset: 64)
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP4_CONFIGURE", file: !14, line: 476, baseType: !799)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DISubroutineType(types: !801)
!801 = !{!238, !713, !802}
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "Start", scope: !715, file: !14, line: 750, baseType: !804, size: 64, offset: 128)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP4_START", file: !14, line: 524, baseType: !805)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!806 = !DISubroutineType(types: !807)
!807 = !{!238, !713, !377}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "RenewRebind", scope: !715, file: !14, line: 751, baseType: !809, size: 64, offset: 192)
!809 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP4_RENEW_REBIND", file: !14, line: 569, baseType: !810)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!811 = !DISubroutineType(types: !812)
!812 = !{!238, !713, !135, !377}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "Release", scope: !715, file: !14, line: 752, baseType: !814, size: 64, offset: 256)
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP4_RELEASE", file: !14, line: 598, baseType: !815)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = !DISubroutineType(types: !817)
!817 = !{!238, !713}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "Stop", scope: !715, file: !14, line: 753, baseType: !819, size: 64, offset: 320)
!819 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP4_STOP", file: !14, line: 619, baseType: !815)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "Build", scope: !715, file: !14, line: 754, baseType: !821, size: 64, offset: 384)
!821 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP4_BUILD", file: !14, line: 660, baseType: !822)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DISubroutineType(types: !824)
!824 = !{!238, !713, !743, !155, !151, !155, !782, !778}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "TransmitReceive", scope: !715, file: !14, line: 755, baseType: !826, size: 64, offset: 448)
!826 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP4_TRANSMIT_RECEIVE", file: !14, line: 697, baseType: !827)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = !DISubroutineType(types: !829)
!829 = !{!238, !713, !830}
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP4_TRANSMIT_RECEIVE_TOKEN", file: !14, line: 404, baseType: !832)
!832 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_DHCP4_TRANSMIT_RECEIVE_TOKEN", file: !14, line: 357, size: 576, elements: !833)
!833 = !{!834, !835, !836, !837, !838, !839, !840, !848, !849, !850, !851}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "Status", scope: !832, file: !14, line: 361, baseType: !238, size: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "CompletionEvent", scope: !832, file: !14, line: 366, baseType: !377, size: 64, offset: 64)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "RemoteAddress", scope: !832, file: !14, line: 370, baseType: !164, size: 32, offset: 128)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "RemotePort", scope: !832, file: !14, line: 374, baseType: !144, size: 16, offset: 160)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "GatewayAddress", scope: !832, file: !14, line: 378, baseType: !164, size: 32, offset: 176)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "ListenPointCount", scope: !832, file: !14, line: 382, baseType: !155, size: 32, offset: 224)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "ListenPoints", scope: !832, file: !14, line: 387, baseType: !841, size: 64, offset: 256)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!842 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP4_LISTEN_POINT", file: !14, line: 355, baseType: !843)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_DHCP4_LISTEN_POINT", file: !14, line: 340, size: 80, elements: !844)
!844 = !{!845, !846, !847}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "ListenAddress", scope: !843, file: !14, line: 344, baseType: !164, size: 32)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "SubnetMask", scope: !843, file: !14, line: 349, baseType: !164, size: 32, offset: 32)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "ListenPort", scope: !843, file: !14, line: 354, baseType: !144, size: 16, offset: 64)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "TimeoutValue", scope: !832, file: !14, line: 391, baseType: !155, size: 32, offset: 320)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "Packet", scope: !832, file: !14, line: 395, baseType: !743, size: 64, offset: 384)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "ResponseCount", scope: !832, file: !14, line: 399, baseType: !155, size: 32, offset: 448)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "ResponseList", scope: !832, file: !14, line: 403, baseType: !743, size: 64, offset: 512)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "Parse", scope: !715, file: !14, line: 756, baseType: !853, size: 64, offset: 512)
!853 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP4_PARSE", file: !14, line: 736, baseType: !854)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = !DISubroutineType(types: !856)
!856 = !{!238, !713, !743, !364, !782}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "Mtftp4", scope: !242, file: !241, line: 123, baseType: !858, size: 64, offset: 1088)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_PROTOCOL", file: !860, line: 25, baseType: !861)
!860 = !DIFile(filename: "MdePkg/Include/Protocol/Mtftp4.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "c9a1c8f575ac713db30924bf8cbd8b17")
!861 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_MTFTP4_PROTOCOL", file: !860, line: 499, size: 512, elements: !862)
!862 = !{!863, !890, !896, !970, !976, !1007, !1009, !1011}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "GetModeData", scope: !861, file: !860, line: 500, baseType: !864, size: 64)
!864 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_GET_MODE_DATA", file: !860, line: 263, baseType: !865)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = !DISubroutineType(types: !867)
!867 = !{!238, !858, !868}
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_MODE_DATA", file: !860, line: 164, baseType: !870)
!870 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_MTFTP4_MODE_DATA", file: !860, line: 158, size: 448, elements: !871)
!871 = !{!872, !885, !886, !888, !889}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "ConfigData", scope: !870, file: !860, line: 159, baseType: !873, size: 208)
!873 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_CONFIG_DATA", file: !860, line: 156, baseType: !874)
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_MTFTP4_CONFIG_DATA", file: !860, line: 146, size: 208, elements: !875)
!875 = !{!876, !877, !878, !879, !880, !881, !882, !883, !884}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultSetting", scope: !874, file: !860, line: 147, baseType: !135, size: 8)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "StationIp", scope: !874, file: !860, line: 148, baseType: !164, size: 32, offset: 8)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "SubnetMask", scope: !874, file: !860, line: 149, baseType: !164, size: 32, offset: 40)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "LocalPort", scope: !874, file: !860, line: 150, baseType: !144, size: 16, offset: 80)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "GatewayIp", scope: !874, file: !860, line: 151, baseType: !164, size: 32, offset: 96)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "ServerIp", scope: !874, file: !860, line: 152, baseType: !164, size: 32, offset: 128)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "InitialServerPort", scope: !874, file: !860, line: 153, baseType: !144, size: 16, offset: 160)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "TryCount", scope: !874, file: !860, line: 154, baseType: !144, size: 16, offset: 176)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "TimeoutValue", scope: !874, file: !860, line: 155, baseType: !144, size: 16, offset: 192)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "SupportedOptionCount", scope: !870, file: !860, line: 160, baseType: !126, size: 8, offset: 208)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "SupportedOptoins", scope: !870, file: !860, line: 161, baseType: !887, size: 64, offset: 256)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "UnsupportedOptionCount", scope: !870, file: !860, line: 162, baseType: !126, size: 8, offset: 320)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "UnsupportedOptoins", scope: !870, file: !860, line: 163, baseType: !887, size: 64, offset: 384)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "Configure", scope: !861, file: !860, line: 501, baseType: !891, size: 64, offset: 64)
!891 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_CONFIGURE", file: !860, line: 292, baseType: !892)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64)
!893 = !DISubroutineType(types: !894)
!894 = !{!238, !858, !895}
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "GetInfo", scope: !861, file: !860, line: 502, baseType: !897, size: 64, offset: 128)
!897 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_GET_INFO", file: !860, line: 343, baseType: !898)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = !DISubroutineType(types: !900)
!900 = !{!238, !858, !901, !151, !151, !126, !910, !364, !916}
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_OVERRIDE_DATA", file: !860, line: 172, baseType: !903)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_MTFTP4_OVERRIDE_DATA", file: !860, line: 166, size: 112, elements: !904)
!904 = !{!905, !906, !907, !908, !909}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "GatewayIp", scope: !903, file: !860, line: 167, baseType: !164, size: 32)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "ServerIp", scope: !903, file: !860, line: 168, baseType: !164, size: 32, offset: 32)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "ServerPort", scope: !903, file: !860, line: 169, baseType: !144, size: 16, offset: 64)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "TryCount", scope: !903, file: !860, line: 170, baseType: !144, size: 16, offset: 80)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "TimeoutValue", scope: !903, file: !860, line: 171, baseType: !144, size: 16, offset: 96)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!911 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_OPTION", file: !860, line: 144, baseType: !912)
!912 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_MTFTP4_OPTION", file: !860, line: 141, size: 128, elements: !913)
!913 = !{!914, !915}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "OptionStr", scope: !912, file: !860, line: 142, baseType: !151, size: 64)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "ValueStr", scope: !912, file: !860, line: 143, baseType: !151, size: 64, offset: 64)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!918 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_PACKET", file: !860, line: 134, baseType: !919)
!919 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "EFI_MTFTP4_PACKET", file: !860, line: 97, size: 88, elements: !920)
!920 = !{!921, !922, !928, !929, !935, !942, !949, !956, !963}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "OpCode", scope: !919, file: !860, line: 101, baseType: !144, size: 16)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "Rrq", scope: !919, file: !860, line: 105, baseType: !923, size: 24)
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_REQ_HEADER", file: !860, line: 62, baseType: !924)
!924 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_MTFTP4_REQ_HEADER", file: !860, line: 59, size: 24, elements: !925)
!925 = !{!926, !927}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "OpCode", scope: !924, file: !860, line: 60, baseType: !144, size: 16)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "Filename", scope: !924, file: !860, line: 61, baseType: !148, size: 8, offset: 16)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "Wrq", scope: !919, file: !860, line: 109, baseType: !923, size: 24)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "Oack", scope: !919, file: !860, line: 113, baseType: !930, size: 24)
!930 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_OACK_HEADER", file: !860, line: 67, baseType: !931)
!931 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_MTFTP4_OACK_HEADER", file: !860, line: 64, size: 24, elements: !932)
!932 = !{!933, !934}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "OpCode", scope: !931, file: !860, line: 65, baseType: !144, size: 16)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !931, file: !860, line: 66, baseType: !148, size: 8, offset: 16)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !919, file: !860, line: 117, baseType: !936, size: 40)
!936 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_DATA_HEADER", file: !860, line: 73, baseType: !937)
!937 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_MTFTP4_DATA_HEADER", file: !860, line: 69, size: 40, elements: !938)
!938 = !{!939, !940, !941}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "OpCode", scope: !937, file: !860, line: 70, baseType: !144, size: 16)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "Block", scope: !937, file: !860, line: 71, baseType: !144, size: 16, offset: 16)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !937, file: !860, line: 72, baseType: !148, size: 8, offset: 32)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "Ack", scope: !919, file: !860, line: 121, baseType: !943, size: 32)
!943 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_ACK_HEADER", file: !860, line: 78, baseType: !944)
!944 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_MTFTP4_ACK_HEADER", file: !860, line: 75, size: 32, elements: !945)
!945 = !{!946, !947}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "OpCode", scope: !944, file: !860, line: 76, baseType: !144, size: 16)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "Block", scope: !944, file: !860, line: 77, baseType: !948, size: 16, offset: 16)
!948 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 16, elements: !149)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "Data8", scope: !919, file: !860, line: 125, baseType: !950, size: 88)
!950 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_DATA8_HEADER", file: !860, line: 84, baseType: !951)
!951 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_MTFTP4_DATA8_HEADER", file: !860, line: 80, size: 88, elements: !952)
!952 = !{!953, !954, !955}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "OpCode", scope: !951, file: !860, line: 81, baseType: !144, size: 16)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "Block", scope: !951, file: !860, line: 82, baseType: !133, size: 64, offset: 16)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !951, file: !860, line: 83, baseType: !148, size: 8, offset: 80)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "Ack8", scope: !919, file: !860, line: 129, baseType: !957, size: 80)
!957 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_ACK8_HEADER", file: !860, line: 89, baseType: !958)
!958 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_MTFTP4_ACK8_HEADER", file: !860, line: 86, size: 80, elements: !959)
!959 = !{!960, !961}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "OpCode", scope: !958, file: !860, line: 87, baseType: !144, size: 16)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "Block", scope: !958, file: !860, line: 88, baseType: !962, size: 64, offset: 16)
!962 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 64, elements: !149)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "Error", scope: !919, file: !860, line: 133, baseType: !964, size: 40)
!964 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_ERROR_HEADER", file: !860, line: 95, baseType: !965)
!965 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_MTFTP4_ERROR_HEADER", file: !860, line: 91, size: 40, elements: !966)
!966 = !{!967, !968, !969}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "OpCode", scope: !965, file: !860, line: 92, baseType: !144, size: 16)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "ErrorCode", scope: !965, file: !860, line: 93, baseType: !144, size: 16, offset: 16)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "ErrorMessage", scope: !965, file: !860, line: 94, baseType: !148, size: 8, offset: 32)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "ParseOptions", scope: !861, file: !860, line: 503, baseType: !971, size: 64, offset: 192)
!971 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_PARSE_OPTIONS", file: !860, line: 378, baseType: !972)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64)
!973 = !DISubroutineType(types: !974)
!974 = !{!238, !858, !155, !917, !364, !975}
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "ReadFile", scope: !861, file: !860, line: 504, baseType: !977, size: 64, offset: 256)
!977 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_READ_FILE", file: !860, line: 411, baseType: !978)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!979 = !DISubroutineType(types: !980)
!980 = !{!238, !858, !981}
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
!982 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_TOKEN", file: !860, line: 26, baseType: !983)
!983 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_MTFTP4_TOKEN", file: !860, line: 510, size: 832, elements: !984)
!984 = !{!985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !1000, !1002}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "Status", scope: !983, file: !860, line: 515, baseType: !238, size: 64)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "Event", scope: !983, file: !860, line: 523, baseType: !377, size: 64, offset: 64)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "OverrideData", scope: !983, file: !860, line: 527, baseType: !901, size: 64, offset: 128)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "Filename", scope: !983, file: !860, line: 531, baseType: !151, size: 64, offset: 192)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "ModeStr", scope: !983, file: !860, line: 535, baseType: !151, size: 64, offset: 256)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "OptionCount", scope: !983, file: !860, line: 539, baseType: !155, size: 32, offset: 320)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "OptionList", scope: !983, file: !860, line: 543, baseType: !910, size: 64, offset: 384)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "BufferSize", scope: !983, file: !860, line: 547, baseType: !133, size: 64, offset: 448)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "Buffer", scope: !983, file: !860, line: 553, baseType: !129, size: 64, offset: 512)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "Context", scope: !983, file: !860, line: 558, baseType: !129, size: 64, offset: 576)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "CheckPacket", scope: !983, file: !860, line: 562, baseType: !996, size: 64, offset: 640)
!996 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_CHECK_PACKET", file: !860, line: 198, baseType: !997)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64)
!998 = !DISubroutineType(types: !999)
!999 = !{!238, !858, !981, !144, !917}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "TimeoutCallback", scope: !983, file: !860, line: 566, baseType: !1001, size: 64, offset: 704)
!1001 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_TIMEOUT_CALLBACK", file: !860, line: 221, baseType: !978)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "PacketNeeded", scope: !983, file: !860, line: 570, baseType: !1003, size: 64, offset: 768)
!1003 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_PACKET_NEEDED", file: !860, line: 243, baseType: !1004)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64)
!1005 = !DISubroutineType(types: !1006)
!1006 = !{!238, !858, !981, !370, !191}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "WriteFile", scope: !861, file: !860, line: 505, baseType: !1008, size: 64, offset: 320)
!1008 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_WRITE_FILE", file: !860, line: 439, baseType: !978)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "ReadDirectory", scope: !861, file: !860, line: 506, baseType: !1010, size: 64, offset: 384)
!1010 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_READ_DIRECTORY", file: !860, line: 468, baseType: !978)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "Poll", scope: !861, file: !860, line: 507, baseType: !1012, size: 64, offset: 448)
!1012 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MTFTP4_POLL", file: !860, line: 490, baseType: !1013)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64)
!1014 = !DISubroutineType(types: !1015)
!1015 = !{!238, !858}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "Udp4Read", scope: !242, file: !241, line: 124, baseType: !1017, size: 64, offset: 1152)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64)
!1018 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_UDP4_PROTOCOL", file: !1019, line: 32, baseType: !1020)
!1019 = !DIFile(filename: "MdePkg/Include/Protocol/Udp4.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "b43e113d8bfd3002b7bb0ecd1117fd63")
!1020 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_UDP4_PROTOCOL", file: !1019, line: 423, size: 512, elements: !1021)
!1021 = !{!1022, !1046, !1051, !1056, !1061, !1110, !1112, !1114}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "GetModeData", scope: !1020, file: !1019, line: 424, baseType: !1023, size: 64)
!1023 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_UDP4_GET_MODE_DATA", file: !1019, line: 142, baseType: !1024)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64)
!1025 = !DISubroutineType(types: !1026)
!1026 = !{!238, !1017, !1027, !517, !562, !379}
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64)
!1028 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_UDP4_CONFIG_DATA", file: !1019, line: 92, baseType: !1029)
!1029 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_UDP4_CONFIG_DATA", file: !1019, line: 67, size: 288, elements: !1030)
!1030 = !{!1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "AcceptBroadcast", scope: !1029, file: !1019, line: 71, baseType: !135, size: 8)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "AcceptPromiscuous", scope: !1029, file: !1019, line: 72, baseType: !135, size: 8, offset: 8)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "AcceptAnyPort", scope: !1029, file: !1019, line: 73, baseType: !135, size: 8, offset: 16)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "AllowDuplicatePort", scope: !1029, file: !1019, line: 74, baseType: !135, size: 8, offset: 24)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "TypeOfService", scope: !1029, file: !1019, line: 78, baseType: !126, size: 8, offset: 32)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "TimeToLive", scope: !1029, file: !1019, line: 79, baseType: !126, size: 8, offset: 40)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "DoNotFragment", scope: !1029, file: !1019, line: 80, baseType: !135, size: 8, offset: 48)
