; ModuleID = 'SmiHandlerProfile.bc'
source_filename = "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main/MdeModulePkg/Core/PiSmmCore/SmiHandlerProfile.c"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-windows-gnu"

%struct._LIST_ENTRY = type { %struct._LIST_ENTRY*, %struct._LIST_ENTRY* }
%struct._SMI_HANDLER_PROFILE_PROTOCOL = type { {}*, i64 (%struct._SMI_HANDLER_PROFILE_PROTOCOL*, %struct.GUID*, i64 (i8*, i8*, i8*, i64*)*, i8*, i64)* }
%struct.GUID = type { i32, i16, i16, [8 x i8] }
%struct.IMAGE_STRUCT = type { %struct.GUID, i64, i64, i64, i32, i16, i8* }
%struct._EFI_SMM_SYSTEM_TABLE2 = type { %struct.EFI_TABLE_HEADER, i16*, i32, i64 (%struct._EFI_SMM_SYSTEM_TABLE2*, %struct.GUID*, i8*, i64)*, %struct._EFI_MM_CPU_IO_PROTOCOL, i64 (i32, i64, i8**)*, i64 (i8*)*, i64 (i32, i32, i64, i64*)*, i64 (i64, i64)*, i64 (void (i8*)*, i64, i8*)*, i64, i64, i64*, i8**, i64, %struct.EFI_CONFIGURATION_TABLE*, i64 (i8**, %struct.GUID*, i32, i8*)*, i64 (i8*, %struct.GUID*, i8*)*, i64 (i8*, %struct.GUID*, i8**)*, i64 (%struct.GUID*, i64 (%struct.GUID*, i8*, i8*)*, i8**)*, i64 (i32, %struct.GUID*, i8*, i64*, i8**)*, i64 (%struct.GUID*, i8*, i8**)*, i64 (%struct.GUID*, i8*, i8*, i64*)*, i64 (i64 (i8*, i8*, i8*, i64*)*, %struct.GUID*, i8**)*, i64 (i8*)* }
%struct.EFI_TABLE_HEADER = type { i64, i32, i32, i32, i32 }

!38 = !DIEnumerator(name: "EfiMaxMemoryType", value: 16)
!39 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !14, line: 506, baseType: !7, size: 32, elements: !40)
!40 = !{!41, !42, !43}
!41 = !DIEnumerator(name: "TimerCancel", value: 0)
!42 = !DIEnumerator(name: "TimerPeriodic", value: 1)
!43 = !DIEnumerator(name: "TimerRelative", value: 2)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !14, line: 1144, baseType: !7, size: 32, elements: !45)
!45 = !{!46}
!46 = !DIEnumerator(name: "EFI_NATIVE_INTERFACE", value: 0)
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !14, line: 1460, baseType: !7, size: 32, elements: !48)
!48 = !{!49, !50, !51}
!49 = !DIEnumerator(name: "AllHandles", value: 0)
!50 = !DIEnumerator(name: "ByRegisterNotify", value: 1)
!51 = !DIEnumerator(name: "ByProtocol", value: 2)
!52 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !53, line: 25, baseType: !7, size: 32, elements: !54)
!53 = !DIFile(filename: "MdePkg/Include/Protocol/MmSxDispatch.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "854999adfec95397706dcae75abccf45")
!54 = !{!55, !56, !57, !58, !59, !60, !61}
!55 = !DIEnumerator(name: "SxS0", value: 0)
!56 = !DIEnumerator(name: "SxS1", value: 1)
!57 = !DIEnumerator(name: "SxS2", value: 2)
!58 = !DIEnumerator(name: "SxS3", value: 3)
!59 = !DIEnumerator(name: "SxS4", value: 4)
!60 = !DIEnumerator(name: "SxS5", value: 5)
!61 = !DIEnumerator(name: "EfiMaximumSleepType", value: 6)
!62 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !53, line: 38, baseType: !7, size: 32, elements: !63)
!63 = !{!64, !65, !66}
!64 = !DIEnumerator(name: "SxEntry", value: 0)
!65 = !DIEnumerator(name: "SxExit", value: 1)
!66 = !DIEnumerator(name: "EfiMaximumPhase", value: 2)
!67 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !68, line: 28, baseType: !7, size: 32, elements: !69)
!68 = !DIFile(filename: "MdePkg/Include/Protocol/MmPowerButtonDispatch.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "8952caff36e6895291f5e94a6b5b22a3")
!69 = !{!70, !71, !72}
!70 = !DIEnumerator(name: "EfiPowerButtonEntry", value: 0)
!71 = !DIEnumerator(name: "EfiPowerButtonExit", value: 1)
!72 = !DIEnumerator(name: "EfiPowerButtonMax", value: 2)
!73 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !74, line: 28, baseType: !7, size: 32, elements: !75)
!74 = !DIFile(filename: "MdePkg/Include/Protocol/MmStandbyButtonDispatch.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "e01e74c06bddd453c09978a030c21cec")
!75 = !{!76, !77, !78}
!76 = !DIEnumerator(name: "EfiStandbyButtonEntry", value: 0)
!77 = !DIEnumerator(name: "EfiStandbyButtonExit", value: 1)
!78 = !DIEnumerator(name: "EfiStandbyButtonMax", value: 2)
!79 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !80, line: 28, baseType: !7, size: 32, elements: !81)
!80 = !DIFile(filename: "MdePkg/Include/Protocol/MmIoTrapDispatch.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "d1fad48dd89aa52f54d074dc619d6515")
!81 = !{!82, !83, !84, !85}
!82 = !DIEnumerator(name: "WriteTrap", value: 0)
!83 = !DIEnumerator(name: "ReadTrap", value: 1)
!84 = !DIEnumerator(name: "ReadWriteTrap", value: 2)
!85 = !DIEnumerator(name: "IoTrapTypeMaximum", value: 3)
!86 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !87, line: 28, baseType: !7, size: 32, elements: !88)
!87 = !DIFile(filename: "MdePkg/Include/Protocol/MmUsbDispatch.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "88c36da7f5380076778e93b76675b7ed")
!88 = !{!89, !90}
!89 = !DIEnumerator(name: "UsbLegacy", value: 0)
!90 = !DIEnumerator(name: "UsbWake", value: 1)
!91 = !{!92, !96, !98, !131, !124, !122, !132, !133, !136, !137, !740, !743, !749, !759, !767, !775, !782, !790, !800, !155, !809, !825, !835, !857, !858, !94, !134, !869, !876, !882}
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINTN", file: !93, line: 211, baseType: !94)
!93 = !DIFile(filename: "MdePkg/Include/X64/ProcessorBind.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "ef2524a221fe61206fa09ec88dd4f59b")
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT64", file: !93, line: 162, baseType: !95)
!95 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "BOOLEAN", file: !93, line: 192, baseType: !97)
!97 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "MEDIA_FW_VOL_FILEPATH_DEVICE_PATH", file: !100, line: 1121, baseType: !101)
!100 = !DIFile(filename: "MdePkg/Include/Protocol/DevicePath.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "6b6d593d171f69b933a87911e52d4607")
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MEDIA_FW_VOL_FILEPATH_DEVICE_PATH", file: !100, line: 1115, size: 160, elements: !102)
!102 = !{!103, !114}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "Header", scope: !101, file: !100, line: 1116, baseType: !104, size: 32)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DEVICE_PATH_PROTOCOL", file: !100, line: 58, baseType: !105)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_DEVICE_PATH_PROTOCOL", file: !100, line: 43, size: 32, elements: !106)
!106 = !{!107, !109, !110}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !105, file: !100, line: 44, baseType: !108, size: 8)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT8", file: !93, line: 196, baseType: !97)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "SubType", scope: !105, file: !100, line: 51, baseType: !108, size: 8, offset: 8)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !105, file: !100, line: 56, baseType: !111, size: 16, offset: 16)
!111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 16, elements: !112)
!112 = !{!113}
!113 = !DISubrange(count: 2)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "FvFileName", scope: !101, file: !100, line: 1120, baseType: !115, size: 128, offset: 32)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GUID", file: !116, line: 25, baseType: !117)
!116 = !DIFile(filename: "MdePkg/Include/Uefi/UefiBaseType.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "dbec48e65949dff122bc920c9d9d9c6a")
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "GUID", file: !118, line: 218, baseType: !119)
!118 = !DIFile(filename: "MdePkg/Include/Base.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "0c11ea3d1992443d8a8f590a064e50ff")
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GUID", file: !118, line: 213, size: 128, elements: !120)
!120 = !{!121, !123, !126, !127}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "Data1", scope: !119, file: !118, line: 214, baseType: !122, size: 32)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT32", file: !93, line: 170, baseType: !7)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "Data2", scope: !119, file: !118, line: 215, baseType: !124, size: 16, offset: 32)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT16", file: !93, line: 178, baseType: !125)
!125 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "Data3", scope: !119, file: !118, line: 216, baseType: !124, size: 16, offset: 48)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "Data4", scope: !119, file: !118, line: 217, baseType: !128, size: 64, offset: 64)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 64, elements: !129)
!129 = !{!130}
!130 = !DISubrange(count: 8)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "RETURN_STATUS", file: !118, line: 1026, baseType: !92)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTN", file: !93, line: 216, baseType: !134)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT64", file: !93, line: 166, baseType: !135)
!135 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SMM_DRIVER_ENTRY", file: !139, line: 142, baseType: !140)
!139 = !DIFile(filename: "MdeModulePkg/Core/PiSmmCore/PiSmmCore.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "e4edf3842107ce4b1893f0150320562f")
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_SMM_DRIVER_ENTRY", file: !139, line: 103, size: 2112, elements: !141)
!141 = !{!142, !143, !150, !151, !153, !154, !156, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !734, !736, !737, !738, !739}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", scope: !140, file: !139, line: 104, baseType: !92, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "Link", scope: !140, file: !139, line: 105, baseType: !144, size: 128, offset: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "LIST_ENTRY", file: !118, line: 242, baseType: !145)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_LIST_ENTRY", file: !118, line: 247, size: 128, elements: !146)
!146 = !{!147, !149}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "ForwardLink", scope: !145, file: !118, line: 248, baseType: !148, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "BackLink", scope: !145, file: !118, line: 249, baseType: !148, size: 64, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "ScheduledLink", scope: !140, file: !139, line: 107, baseType: !144, size: 128, offset: 192)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "FvHandle", scope: !140, file: !139, line: 109, baseType: !152, size: 64, offset: 320)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_HANDLE", file: !116, line: 33, baseType: !131)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "FileName", scope: !140, file: !139, line: 110, baseType: !115, size: 128, offset: 384)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "FvFileDevicePath", scope: !140, file: !139, line: 111, baseType: !155, size: 64, offset: 512)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "Fv", scope: !140, file: !139, line: 112, baseType: !157, size: 64, offset: 576)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FIRMWARE_VOLUME2_PROTOCOL", file: !159, line: 22, baseType: !160)
!159 = !DIFile(filename: "MdePkg/Include/Protocol/FirmwareVolume2.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "e17565cad68c5de540c8e91ee2a96221")
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_FIRMWARE_VOLUME2_PROTOCOL", file: !159, line: 722, size: 640, elements: !161)
!161 = !{!162, !172, !174, !189, !195, !211, !216, !217, !218, !223}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "GetVolumeAttributes", scope: !160, file: !159, line: 723, baseType: !163, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FV_GET_ATTRIBUTES", file: !159, line: 106, baseType: !164)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DISubroutineType(types: !166)
!166 = !{!167, !168, !170}
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_STATUS", file: !116, line: 29, baseType: !132)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !158)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FV_ATTRIBUTES", file: !159, line: 27, baseType: !94)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "SetVolumeAttributes", scope: !160, file: !159, line: 724, baseType: !173, size: 64, offset: 64)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FV_SET_ATTRIBUTES", file: !159, line: 200, baseType: !164)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "ReadFile", scope: !160, file: !159, line: 725, baseType: !175, size: 64, offset: 128)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FV_READ_FILE", file: !159, line: 294, baseType: !176)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DISubroutineType(types: !178)
!178 = !{!167, !168, !179, !136, !181, !182, !185, !188}
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !115)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FV_FILETYPE", file: !184, line: 50, baseType: !108)
!184 = !DIFile(filename: "MdePkg/Include/Pi/PiFirmwareFile.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "942fe99f769f631cab0d641a8d548f4d")
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FV_FILE_ATTRIBUTES", file: !187, line: 18, baseType: !122)
!187 = !DIFile(filename: "MdePkg/Include/Pi/PiFirmwareVolume.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "9a02bea8b9edc1b887ae684c8d405b44")
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "ReadSection", scope: !160, file: !159, line: 726, baseType: !190, size: 64, offset: 192)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FV_READ_SECTION", file: !159, line: 400, baseType: !191)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DISubroutineType(types: !193)
!193 = !{!167, !168, !179, !194, !92, !136, !181, !188}
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SECTION_TYPE", file: !184, line: 193, baseType: !108)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "WriteFile", scope: !160, file: !159, line: 727, baseType: !196, size: 64, offset: 256)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FV_WRITE_FILE", file: !159, line: 511, baseType: !197)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DISubroutineType(types: !199)
!199 = !{!167, !168, !122, !200, !201}
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FV_WRITE_POLICY", file: !159, line: 413, baseType: !122)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FV_WRITE_FILE_DATA", file: !159, line: 441, baseType: !203)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_FV_WRITE_FILE_DATA", file: !159, line: 420, size: 256, elements: !204)
!204 = !{!205, !207, !208, !209, !210}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "NameGuid", scope: !203, file: !159, line: 424, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !203, file: !159, line: 428, baseType: !183, size: 8, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "FileAttributes", scope: !203, file: !159, line: 432, baseType: !186, size: 32, offset: 96)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "Buffer", scope: !203, file: !159, line: 436, baseType: !131, size: 64, offset: 128)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "BufferSize", scope: !203, file: !159, line: 440, baseType: !122, size: 32, offset: 192)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "GetNextFile", scope: !160, file: !159, line: 728, baseType: !212, size: 64, offset: 320)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FV_GET_NEXT_FILE", file: !159, line: 595, baseType: !213)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DISubroutineType(types: !215)
!215 = !{!167, !168, !131, !182, !206, !185, !181}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "KeySize", scope: !160, file: !159, line: 735, baseType: !122, size: 32, offset: 384)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "ParentHandle", scope: !160, file: !159, line: 740, baseType: !152, size: 64, offset: 448)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "GetInfo", scope: !160, file: !159, line: 741, baseType: !219, size: 64, offset: 512)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FV_GET_INFO", file: !159, line: 653, baseType: !220)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DISubroutineType(types: !222)
!222 = !{!167, !168, !179, !181, !131}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "SetInfo", scope: !160, file: !159, line: 742, baseType: !224, size: 64, offset: 576)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FV_SET_INFO", file: !159, line: 702, baseType: !225)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DISubroutineType(types: !227)
!227 = !{!167, !168, !179, !92, !228}
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "Depex", scope: !140, file: !139, line: 114, baseType: !131, size: 64, offset: 640)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "DepexSize", scope: !140, file: !139, line: 115, baseType: !92, size: 64, offset: 704)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "Before", scope: !140, file: !139, line: 117, baseType: !96, size: 8, offset: 768)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "After", scope: !140, file: !139, line: 118, baseType: !96, size: 8, offset: 776)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "BeforeAfterGuid", scope: !140, file: !139, line: 119, baseType: !115, size: 128, offset: 800)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "Dependent", scope: !140, file: !139, line: 121, baseType: !96, size: 8, offset: 928)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "Scheduled", scope: !140, file: !139, line: 122, baseType: !96, size: 8, offset: 936)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "Initialized", scope: !140, file: !139, line: 123, baseType: !96, size: 8, offset: 944)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "DepexProtocolError", scope: !140, file: !139, line: 124, baseType: !96, size: 8, offset: 952)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "ImageHandle", scope: !140, file: !139, line: 126, baseType: !152, size: 64, offset: 960)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "LoadedImage", scope: !140, file: !139, line: 127, baseType: !241, size: 64, offset: 1024)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_LOADED_IMAGE_PROTOCOL", file: !243, line: 72, baseType: !244)
!243 = !DIFile(filename: "MdePkg/Include/Protocol/LoadedImage.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "0bfc90f5c05009801c3af3d54bff9caa")
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_LOADED_IMAGE_PROTOCOL", file: !243, line: 43, size: 768, elements: !245)
!245 = !{!246, !247, !248, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "Revision", scope: !244, file: !243, line: 44, baseType: !122, size: 32)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "ParentHandle", scope: !244, file: !243, line: 46, baseType: !152, size: 64, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "SystemTable", scope: !244, file: !243, line: 48, baseType: !249, size: 64, offset: 128)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SYSTEM_TABLE", file: !14, line: 2038, baseType: !251)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_SYSTEM_TABLE", file: !14, line: 1977, size: 960, elements: !252)
!252 = !{!253, !262, !265, !266, !267, !291, !292, !347, !348, !349, !473, !716, !717}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "Hdr", scope: !251, file: !14, line: 1981, baseType: !254, size: 192)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TABLE_HEADER", file: !6, line: 177, baseType: !255)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_TABLE_HEADER", file: !6, line: 150, size: 192, elements: !256)
!256 = !{!257, !258, !259, !260, !261}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", scope: !255, file: !6, line: 156, baseType: !94, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "Revision", scope: !255, file: !6, line: 163, baseType: !122, size: 32, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "HeaderSize", scope: !255, file: !6, line: 167, baseType: !122, size: 32, offset: 96)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "CRC32", scope: !255, file: !6, line: 172, baseType: !122, size: 32, offset: 128)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved", scope: !255, file: !6, line: 176, baseType: !122, size: 32, offset: 160)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "FirmwareVendor", scope: !251, file: !14, line: 1986, baseType: !263, size: 64, offset: 192)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHAR16", file: !93, line: 183, baseType: !125)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "FirmwareRevision", scope: !251, file: !14, line: 1991, baseType: !122, size: 32, offset: 256)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "ConsoleInHandle", scope: !251, file: !14, line: 1996, baseType: !152, size: 64, offset: 320)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "ConIn", scope: !251, file: !14, line: 2001, baseType: !268, size: 64, offset: 384)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_TEXT_INPUT_PROTOCOL", file: !270, line: 20, baseType: !271)
!270 = !DIFile(filename: "MdePkg/Include/Protocol/SimpleTextIn.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "239cf4f3dddb25a8596c70fa738413fd")
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_SIMPLE_TEXT_INPUT_PROTOCOL", file: !270, line: 116, size: 192, elements: !272)
!272 = !{!273, !278, !289}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "Reset", scope: !271, file: !270, line: 117, baseType: !274, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_INPUT_RESET", file: !270, line: 86, baseType: !275)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DISubroutineType(types: !277)
!277 = !{!167, !268, !96}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "ReadKeyStroke", scope: !271, file: !270, line: 118, baseType: !279, size: 64, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_INPUT_READ_KEY", file: !270, line: 107, baseType: !280)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DISubroutineType(types: !282)
!282 = !{!167, !268, !283}
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_INPUT_KEY", file: !270, line: 38, baseType: !285)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_INPUT_KEY", file: !270, line: 35, size: 32, elements: !286)
!286 = !{!287, !288}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "ScanCode", scope: !285, file: !270, line: 36, baseType: !124, size: 16)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "UnicodeChar", scope: !285, file: !270, line: 37, baseType: !264, size: 16, offset: 16)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "WaitForKey", scope: !271, file: !270, line: 122, baseType: !290, size: 64, offset: 128)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_EVENT", file: !116, line: 37, baseType: !131)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "ConsoleOutHandle", scope: !251, file: !14, line: 2005, baseType: !152, size: 64, offset: 448)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "ConOut", scope: !251, file: !14, line: 2010, baseType: !293, size: 64, offset: 512)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_TEXT_OUTPUT_PROTOCOL", file: !295, line: 27, baseType: !296)
!295 = !DIFile(filename: "MdePkg/Include/Protocol/SimpleTextOut.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "685bec042927ad46d31bf42ae7f6ddcd")
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_SIMPLE_TEXT_OUTPUT_PROTOCOL", file: !295, line: 387, size: 640, elements: !297)
!297 = !{!298, !303, !308, !310, !315, !320, !322, !327, !332, !334}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "Reset", scope: !296, file: !295, line: 388, baseType: !299, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TEXT_RESET", file: !295, line: 167, baseType: !300)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DISubroutineType(types: !302)
!302 = !{!167, !293, !96}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "OutputString", scope: !296, file: !295, line: 390, baseType: !304, size: 64, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TEXT_STRING", file: !295, line: 192, baseType: !305)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DISubroutineType(types: !307)
!307 = !{!167, !293, !263}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "TestString", scope: !296, file: !295, line: 391, baseType: !309, size: 64, offset: 128)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TEXT_TEST_STRING", file: !295, line: 213, baseType: !305)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "QueryMode", scope: !296, file: !295, line: 393, baseType: !311, size: 64, offset: 192)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TEXT_QUERY_MODE", file: !295, line: 236, baseType: !312)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DISubroutineType(types: !314)
!314 = !{!167, !293, !92, !181, !181}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "SetMode", scope: !296, file: !295, line: 394, baseType: !316, size: 64, offset: 256)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TEXT_SET_MODE", file: !295, line: 256, baseType: !317)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DISubroutineType(types: !319)
!319 = !{!167, !293, !92}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "SetAttribute", scope: !296, file: !295, line: 395, baseType: !321, size: 64, offset: 320)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TEXT_SET_ATTRIBUTE", file: !295, line: 277, baseType: !317)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "ClearScreen", scope: !296, file: !295, line: 397, baseType: !323, size: 64, offset: 384)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TEXT_CLEAR_SCREEN", file: !295, line: 295, baseType: !324)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DISubroutineType(types: !326)
!326 = !{!167, !293}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "SetCursorPosition", scope: !296, file: !295, line: 398, baseType: !328, size: 64, offset: 448)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TEXT_SET_CURSOR_POSITION", file: !295, line: 318, baseType: !329)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DISubroutineType(types: !331)
!331 = !{!167, !293, !92, !92}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "EnableCursor", scope: !296, file: !295, line: 399, baseType: !333, size: 64, offset: 512)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TEXT_ENABLE_CURSOR", file: !295, line: 340, baseType: !300)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "Mode", scope: !296, file: !295, line: 404, baseType: !335, size: 64, offset: 576)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_TEXT_OUTPUT_MODE", file: !295, line: 379, baseType: !337)
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_SIMPLE_TEXT_OUTPUT_MODE", file: !295, line: 349, size: 192, elements: !338)
!338 = !{!339, !342, !343, !344, !345, !346}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "MaxMode", scope: !337, file: !295, line: 353, baseType: !340, size: 32)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT32", file: !93, line: 174, baseType: !341)
!341 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "Mode", scope: !337, file: !295, line: 362, baseType: !340, size: 32, offset: 32)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "Attribute", scope: !337, file: !295, line: 366, baseType: !340, size: 32, offset: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "CursorColumn", scope: !337, file: !295, line: 370, baseType: !340, size: 32, offset: 96)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "CursorRow", scope: !337, file: !295, line: 374, baseType: !340, size: 32, offset: 128)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "CursorVisible", scope: !337, file: !295, line: 378, baseType: !96, size: 8, offset: 160)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "StandardErrorHandle", scope: !251, file: !14, line: 2015, baseType: !152, size: 64, offset: 576)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "StdErr", scope: !251, file: !14, line: 2020, baseType: !293, size: 64, offset: 640)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "RuntimeServices", scope: !251, file: !14, line: 2024, baseType: !350, size: 64, offset: 704)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_RUNTIME_SERVICES", file: !14, line: 1856, baseType: !352)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_RUNTIME_SERVICES", file: !14, line: 1813, size: 1088, elements: !353)
!353 = !{!354, !355, !384, !389, !395, !400, !416, !421, !426, !431, !436, !441, !447, !461, !468}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "Hdr", scope: !352, file: !14, line: 1817, baseType: !254, size: 192)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "GetTime", scope: !352, file: !14, line: 1822, baseType: !356, size: 64, offset: 192)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GET_TIME", file: !14, line: 801, baseType: !357)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DISubroutineType(types: !359)
!359 = !{!167, !360, !377}
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TIME", file: !116, line: 80, baseType: !362)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_TIME", file: !116, line: 68, size: 128, elements: !363)
!363 = !{!364, !365, !366, !367, !368, !369, !370, !371, !372, !375, !376}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "Year", scope: !362, file: !116, line: 69, baseType: !124, size: 16)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "Month", scope: !362, file: !116, line: 70, baseType: !108, size: 8, offset: 16)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "Day", scope: !362, file: !116, line: 71, baseType: !108, size: 8, offset: 24)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "Hour", scope: !362, file: !116, line: 72, baseType: !108, size: 8, offset: 32)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "Minute", scope: !362, file: !116, line: 73, baseType: !108, size: 8, offset: 40)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "Second", scope: !362, file: !116, line: 74, baseType: !108, size: 8, offset: 48)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "Pad1", scope: !362, file: !116, line: 75, baseType: !108, size: 8, offset: 56)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "Nanosecond", scope: !362, file: !116, line: 76, baseType: !122, size: 32, offset: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "TimeZone", scope: !362, file: !116, line: 77, baseType: !373, size: 16, offset: 96)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT16", file: !93, line: 187, baseType: !374)
!374 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "Daylight", scope: !362, file: !116, line: 78, baseType: !108, size: 8, offset: 112)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "Pad2", scope: !362, file: !116, line: 79, baseType: !108, size: 8, offset: 120)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TIME_CAPABILITIES", file: !14, line: 784, baseType: !379)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_TIME_CAPABILITIES", file: !14, line: 761, size: 96, elements: !380)
!380 = !{!381, !382, !383}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "Resolution", scope: !379, file: !14, line: 768, baseType: !122, size: 32)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "Accuracy", scope: !379, file: !14, line: 775, baseType: !122, size: 32, offset: 32)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "SetsToZero", scope: !379, file: !14, line: 783, baseType: !96, size: 8, offset: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "SetTime", scope: !352, file: !14, line: 1823, baseType: !385, size: 64, offset: 256)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SET_TIME", file: !14, line: 818, baseType: !386)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DISubroutineType(types: !388)
!388 = !{!167, !360}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "GetWakeupTime", scope: !352, file: !14, line: 1824, baseType: !390, size: 64, offset: 320)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GET_WAKEUP_TIME", file: !14, line: 839, baseType: !391)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DISubroutineType(types: !393)
!393 = !{!167, !394, !394, !360}
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "SetWakeupTime", scope: !352, file: !14, line: 1825, baseType: !396, size: 64, offset: 384)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SET_WAKEUP_TIME", file: !14, line: 861, baseType: !397)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DISubroutineType(types: !399)
!399 = !{!167, !96, !360}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "SetVirtualAddressMap", scope: !352, file: !14, line: 1830, baseType: !401, size: 64, offset: 448)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SET_VIRTUAL_ADDRESS_MAP", file: !14, line: 312, baseType: !402)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DISubroutineType(types: !404)
!404 = !{!167, !92, !92, !122, !405}
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MEMORY_DESCRIPTOR", file: !14, line: 160, baseType: !407)
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_MEMORY_DESCRIPTOR", file: !14, line: 128, size: 320, elements: !408)
!408 = !{!409, !410, !412, !414, !415}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !407, file: !14, line: 134, baseType: !122, size: 32)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "PhysicalStart", scope: !407, file: !14, line: 140, baseType: !411, size: 64, offset: 64)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_PHYSICAL_ADDRESS", file: !116, line: 50, baseType: !94)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "VirtualStart", scope: !407, file: !14, line: 146, baseType: !413, size: 64, offset: 128)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_VIRTUAL_ADDRESS", file: !116, line: 55, baseType: !94)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "NumberOfPages", scope: !407, file: !14, line: 153, baseType: !94, size: 64, offset: 192)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "Attribute", scope: !407, file: !14, line: 159, baseType: !94, size: 64, offset: 256)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "ConvertPointer", scope: !352, file: !14, line: 1831, baseType: !417, size: 64, offset: 512)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CONVERT_POINTER", file: !14, line: 407, baseType: !418)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DISubroutineType(types: !420)
!420 = !{!167, !92, !136}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "GetVariable", scope: !352, file: !14, line: 1836, baseType: !422, size: 64, offset: 576)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GET_VARIABLE", file: !14, line: 671, baseType: !423)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DISubroutineType(types: !425)
!425 = !{!167, !263, !206, !188, !181, !131}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "GetNextVariableName", scope: !352, file: !14, line: 1837, baseType: !427, size: 64, offset: 640)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GET_NEXT_VARIABLE_NAME", file: !14, line: 707, baseType: !428)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DISubroutineType(types: !430)
!430 = !{!167, !181, !263, !206}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "SetVariable", scope: !352, file: !14, line: 1838, baseType: !432, size: 64, offset: 704)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SET_VARIABLE", file: !14, line: 749, baseType: !433)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DISubroutineType(types: !435)
!435 = !{!167, !263, !206, !122, !92, !131}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "GetNextHighMonotonicCount", scope: !352, file: !14, line: 1843, baseType: !437, size: 64, offset: 768)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GET_NEXT_HIGH_MONO_COUNT", file: !14, line: 1082, baseType: !438)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DISubroutineType(types: !440)
!440 = !{!167, !188}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "ResetSystem", scope: !352, file: !14, line: 1844, baseType: !442, size: 64, offset: 832)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_RESET_SYSTEM", file: !14, line: 1047, baseType: !443)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DISubroutineType(types: !445)
!445 = !{null, !446, !167, !92, !131}
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_RESET_TYPE", file: !6, line: 145, baseType: !5)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "UpdateCapsule", scope: !352, file: !14, line: 1849, baseType: !448, size: 64, offset: 896)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_UPDATE_CAPSULE", file: !14, line: 1708, baseType: !449)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DISubroutineType(types: !451)
!451 = !{!167, !452, !92, !411}
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CAPSULE_HEADER", file: !14, line: 1654, baseType: !455)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_CAPSULE_HEADER", file: !14, line: 1633, size: 224, elements: !456)
!456 = !{!457, !458, !459, !460}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "CapsuleGuid", scope: !455, file: !14, line: 1637, baseType: !115, size: 128)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "HeaderSize", scope: !455, file: !14, line: 1643, baseType: !122, size: 32, offset: 128)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !455, file: !14, line: 1649, baseType: !122, size: 32, offset: 160)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "CapsuleImageSize", scope: !455, file: !14, line: 1653, baseType: !122, size: 32, offset: 192)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "QueryCapsuleCapabilities", scope: !352, file: !14, line: 1850, baseType: !462, size: 64, offset: 960)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_QUERY_CAPSULE_CAPABILITIES", file: !14, line: 1739, baseType: !463)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = !DISubroutineType(types: !465)
!465 = !{!167, !452, !92, !466, !467}
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "QueryVariableInfo", scope: !352, file: !14, line: 1855, baseType: !469, size: 64, offset: 1024)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_QUERY_VARIABLE_INFO", file: !14, line: 1770, baseType: !470)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DISubroutineType(types: !472)
!472 = !{!167, !122, !466, !466, !466}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "BootServices", scope: !251, file: !14, line: 2028, baseType: !474, size: 64, offset: 768)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_BOOT_SERVICES", file: !14, line: 1957, baseType: !476)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_BOOT_SERVICES", file: !14, line: 1864, size: 3008, elements: !477)
!477 = !{!478, !479, !485, !490, !498, !503, !508, !513, !518, !528, !534, !539, !544, !546, !548, !555, !560, !565, !570, !571, !576, !582, !588, !593, !598, !604, !609, !614, !619, !624, !629, !634, !639, !644, !649, !654, !668, !675, !681, !686, !691, !696, !701, !706, !711}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "Hdr", scope: !476, file: !14, line: 1868, baseType: !254, size: 192)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "RaiseTPL", scope: !476, file: !14, line: 1873, baseType: !480, size: 64, offset: 192)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_RAISE_TPL", file: !14, line: 629, baseType: !481)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DISubroutineType(types: !483)
!483 = !{!484, !484}
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TPL", file: !116, line: 41, baseType: !92)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "RestoreTPL", scope: !476, file: !14, line: 1874, baseType: !486, size: 64, offset: 256)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_RESTORE_TPL", file: !14, line: 641, baseType: !487)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DISubroutineType(types: !489)
!489 = !{null, !484}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "AllocatePages", scope: !476, file: !14, line: 1879, baseType: !491, size: 64, offset: 320)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_ALLOCATE_PAGES", file: !14, line: 188, baseType: !492)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DISubroutineType(types: !494)
!494 = !{!167, !495, !496, !92, !497}
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_ALLOCATE_TYPE", file: !14, line: 47, baseType: !13)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MEMORY_TYPE", file: !6, line: 112, baseType: !20)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "FreePages", scope: !476, file: !14, line: 1880, baseType: !499, size: 64, offset: 384)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FREE_PAGES", file: !14, line: 209, baseType: !500)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DISubroutineType(types: !502)
!502 = !{!167, !411, !92}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "GetMemoryMap", scope: !476, file: !14, line: 1881, baseType: !504, size: 64, offset: 448)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GET_MEMORY_MAP", file: !14, line: 241, baseType: !505)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DISubroutineType(types: !507)
!507 = !{!167, !181, !405, !181, !181, !188}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "AllocatePool", scope: !476, file: !14, line: 1882, baseType: !509, size: 64, offset: 512)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_ALLOCATE_POOL", file: !14, line: 270, baseType: !510)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DISubroutineType(types: !512)
!512 = !{!167, !496, !92, !136}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "FreePool", scope: !476, file: !14, line: 1883, baseType: !514, size: 64, offset: 576)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FREE_POOL", file: !14, line: 287, baseType: !515)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = !DISubroutineType(types: !517)
!517 = !{!167, !131}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "CreateEvent", scope: !476, file: !14, line: 1888, baseType: !519, size: 64, offset: 640)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CREATE_EVENT", file: !14, line: 465, baseType: !520)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DISubroutineType(types: !522)
!522 = !{!167, !122, !484, !523, !131, !527}
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_EVENT_NOTIFY", file: !14, line: 442, baseType: !524)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DISubroutineType(types: !526)
!526 = !{null, !290, !131}
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "SetTimer", scope: !476, file: !14, line: 1889, baseType: !529, size: 64, offset: 704)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SET_TIMER", file: !14, line: 539, baseType: !530)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DISubroutineType(types: !532)
!532 = !{!167, !290, !533, !94}
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TIMER_DELAY", file: !14, line: 519, baseType: !39)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "WaitForEvent", scope: !476, file: !14, line: 1890, baseType: !535, size: 64, offset: 768)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_WAIT_FOR_EVENT", file: !14, line: 575, baseType: !536)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DISubroutineType(types: !538)
!538 = !{!167, !92, !527, !181}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "SignalEvent", scope: !476, file: !14, line: 1891, baseType: !540, size: 64, offset: 832)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIGNAL_EVENT", file: !14, line: 555, baseType: !541)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DISubroutineType(types: !543)
!543 = !{!167, !290}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "CloseEvent", scope: !476, file: !14, line: 1892, baseType: !545, size: 64, offset: 896)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CLOSE_EVENT", file: !14, line: 591, baseType: !541)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "CheckEvent", scope: !476, file: !14, line: 1893, baseType: !547, size: 64, offset: 960)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CHECK_EVENT", file: !14, line: 607, baseType: !541)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "InstallProtocolInterface", scope: !476, file: !14, line: 1898, baseType: !549, size: 64, offset: 1024)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_INSTALL_PROTOCOL_INTERFACE", file: !14, line: 1173, baseType: !550)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DISubroutineType(types: !552)
!552 = !{!167, !553, !206, !554, !131}
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_INTERFACE_TYPE", file: !14, line: 1149, baseType: !44)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "ReinstallProtocolInterface", scope: !476, file: !14, line: 1899, baseType: !556, size: 64, offset: 1088)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_REINSTALL_PROTOCOL_INTERFACE", file: !14, line: 1223, baseType: !557)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = !DISubroutineType(types: !559)
!559 = !{!167, !152, !206, !131, !131}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "UninstallProtocolInterface", scope: !476, file: !14, line: 1900, baseType: !561, size: 64, offset: 1152)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_UNINSTALL_PROTOCOL_INTERFACE", file: !14, line: 1249, baseType: !562)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DISubroutineType(types: !564)
!564 = !{!167, !152, !206, !131}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "HandleProtocol", scope: !476, file: !14, line: 1901, baseType: !566, size: 64, offset: 1216)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_HANDLE_PROTOCOL", file: !14, line: 1290, baseType: !567)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DISubroutineType(types: !569)
!569 = !{!167, !152, !206, !136}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved", scope: !476, file: !14, line: 1902, baseType: !131, size: 64, offset: 1280)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "RegisterProtocolNotify", scope: !476, file: !14, line: 1903, baseType: !572, size: 64, offset: 1344)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_REGISTER_PROTOCOL_NOTIFY", file: !14, line: 1451, baseType: !573)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = !DISubroutineType(types: !575)
!575 = !{!167, !206, !290, !136}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "LocateHandle", scope: !476, file: !14, line: 1904, baseType: !577, size: 64, offset: 1408)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_LOCATE_HANDLE", file: !14, line: 1500, baseType: !578)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DISubroutineType(types: !580)
!580 = !{!167, !581, !206, !131, !181, !553}
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_LOCATE_SEARCH_TYPE", file: !14, line: 1474, baseType: !47)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "LocateDevicePath", scope: !476, file: !14, line: 1905, baseType: !583, size: 64, offset: 1472)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_LOCATE_DEVICE_PATH", file: !14, line: 1526, baseType: !584)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = !DISubroutineType(types: !586)
!586 = !{!167, !206, !587, !553}
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "InstallConfigurationTable", scope: !476, file: !14, line: 1906, baseType: !589, size: 64, offset: 1536)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_INSTALL_CONFIGURATION_TABLE", file: !14, line: 1547, baseType: !590)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DISubroutineType(types: !592)
!592 = !{!167, !206, !131}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "LoadImage", scope: !476, file: !14, line: 1911, baseType: !594, size: 64, offset: 1600)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IMAGE_LOAD", file: !14, line: 898, baseType: !595)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DISubroutineType(types: !597)
!597 = !{!167, !96, !152, !155, !131, !92, !553}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "StartImage", scope: !476, file: !14, line: 1912, baseType: !599, size: 64, offset: 1664)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IMAGE_START", file: !14, line: 923, baseType: !600)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DISubroutineType(types: !602)
!602 = !{!167, !152, !181, !603}
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "Exit", scope: !476, file: !14, line: 1913, baseType: !605, size: 64, offset: 1728)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_EXIT", file: !14, line: 951, baseType: !606)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DISubroutineType(types: !608)
!608 = !{!167, !152, !167, !92, !263}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "UnloadImage", scope: !476, file: !14, line: 1914, baseType: !610, size: 64, offset: 1792)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IMAGE_UNLOAD", file: !14, line: 969, baseType: !611)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DISubroutineType(types: !613)
!613 = !{!167, !152}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "ExitBootServices", scope: !476, file: !14, line: 1915, baseType: !615, size: 64, offset: 1856)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_EXIT_BOOT_SERVICES", file: !14, line: 985, baseType: !616)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = !DISubroutineType(types: !618)
!618 = !{!167, !152, !92}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "GetNextMonotonicCount", scope: !476, file: !14, line: 1920, baseType: !620, size: 64, offset: 1920)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GET_NEXT_MONOTONIC_COUNT", file: !14, line: 1066, baseType: !621)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DISubroutineType(types: !623)
!623 = !{!167, !466}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "Stall", scope: !476, file: !14, line: 1921, baseType: !625, size: 64, offset: 1984)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_STALL", file: !14, line: 1001, baseType: !626)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = !DISubroutineType(types: !628)
!628 = !{!167, !92}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "SetWatchdogTimer", scope: !476, file: !14, line: 1922, baseType: !630, size: 64, offset: 2048)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SET_WATCHDOG_TIMER", file: !14, line: 1023, baseType: !631)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DISubroutineType(types: !633)
!633 = !{!167, !92, !94, !92, !263}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "ConnectController", scope: !476, file: !14, line: 1927, baseType: !635, size: 64, offset: 2112)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CONNECT_CONTROLLER", file: !14, line: 346, baseType: !636)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = !DISubroutineType(types: !638)
!638 = !{!167, !152, !553, !155, !96}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "DisconnectController", scope: !476, file: !14, line: 1928, baseType: !640, size: 64, offset: 2176)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DISCONNECT_CONTROLLER", file: !14, line: 379, baseType: !641)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DISubroutineType(types: !643)
!643 = !{!167, !152, !152, !152}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "OpenProtocol", scope: !476, file: !14, line: 1933, baseType: !645, size: 64, offset: 2240)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_OPEN_PROTOCOL", file: !14, line: 1332, baseType: !646)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DISubroutineType(types: !648)
!648 = !{!167, !152, !206, !136, !152, !152, !122}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "CloseProtocol", scope: !476, file: !14, line: 1934, baseType: !650, size: 64, offset: 2304)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CLOSE_PROTOCOL", file: !14, line: 1364, baseType: !651)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DISubroutineType(types: !653)
!653 = !{!167, !152, !206, !152, !152}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "OpenProtocolInformation", scope: !476, file: !14, line: 1935, baseType: !655, size: 64, offset: 2368)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_OPEN_PROTOCOL_INFORMATION", file: !14, line: 1398, baseType: !656)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DISubroutineType(types: !658)
!658 = !{!167, !152, !206, !659, !181}
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_OPEN_PROTOCOL_INFORMATION_ENTRY", file: !14, line: 1379, baseType: !662)
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_OPEN_PROTOCOL_INFORMATION_ENTRY", file: !14, line: 1374, size: 192, elements: !663)
!663 = !{!664, !665, !666, !667}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "AgentHandle", scope: !662, file: !14, line: 1375, baseType: !152, size: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "ControllerHandle", scope: !662, file: !14, line: 1376, baseType: !152, size: 64, offset: 64)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "Attributes", scope: !662, file: !14, line: 1377, baseType: !122, size: 32, offset: 128)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "OpenCount", scope: !662, file: !14, line: 1378, baseType: !122, size: 32, offset: 160)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "ProtocolsPerHandle", scope: !476, file: !14, line: 1940, baseType: !669, size: 64, offset: 2432)
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_PROTOCOLS_PER_HANDLE", file: !14, line: 1428, baseType: !670)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DISubroutineType(types: !672)
!672 = !{!167, !152, !673, !181}
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "LocateHandleBuffer", scope: !476, file: !14, line: 1941, baseType: !676, size: 64, offset: 2496)
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_LOCATE_HANDLE_BUFFER", file: !14, line: 1573, baseType: !677)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DISubroutineType(types: !679)
!679 = !{!167, !581, !206, !131, !181, !680}
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "LocateProtocol", scope: !476, file: !14, line: 1942, baseType: !682, size: 64, offset: 2560)
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_LOCATE_PROTOCOL", file: !14, line: 1600, baseType: !683)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DISubroutineType(types: !685)
!685 = !{!167, !206, !131, !136}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "InstallMultipleProtocolInterfaces", scope: !476, file: !14, line: 1943, baseType: !687, size: 64, offset: 2624)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_INSTALL_MULTIPLE_PROTOCOL_INTERFACES", file: !14, line: 1198, baseType: !688)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DISubroutineType(types: !690)
!690 = !{!167, !553, null}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "UninstallMultipleProtocolInterfaces", scope: !476, file: !14, line: 1944, baseType: !692, size: 64, offset: 2688)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_UNINSTALL_MULTIPLE_PROTOCOL_INTERFACES", file: !14, line: 1268, baseType: !693)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DISubroutineType(types: !695)
!695 = !{!167, !152, null}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "CalculateCrc32", scope: !476, file: !14, line: 1949, baseType: !697, size: 64, offset: 2752)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CALCULATE_CRC32", file: !14, line: 1103, baseType: !698)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DISubroutineType(types: !700)
!700 = !{!167, !131, !92, !188}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "CopyMem", scope: !476, file: !14, line: 1954, baseType: !702, size: 64, offset: 2816)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_COPY_MEM", file: !14, line: 1119, baseType: !703)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = !DISubroutineType(types: !705)
!705 = !{null, !131, !131, !92}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "SetMem", scope: !476, file: !14, line: 1955, baseType: !707, size: 64, offset: 2880)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SET_MEM", file: !14, line: 1135, baseType: !708)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DISubroutineType(types: !710)
!710 = !{null, !131, !92, !108}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "CreateEventEx", scope: !476, file: !14, line: 1956, baseType: !712, size: 64, offset: 2944)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CREATE_EVENT_EX", file: !14, line: 494, baseType: !713)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = !DISubroutineType(types: !715)
!715 = !{!167, !122, !484, !523, !228, !179, !527}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "NumberOfTableEntries", scope: !251, file: !14, line: 2032, baseType: !92, size: 64, offset: 832)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "ConfigurationTable", scope: !251, file: !14, line: 2037, baseType: !718, size: 64, offset: 896)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CONFIGURATION_TABLE", file: !14, line: 1972, baseType: !720)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_CONFIGURATION_TABLE", file: !14, line: 1963, size: 192, elements: !721)
!721 = !{!722, !723}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "VendorGuid", scope: !720, file: !14, line: 1967, baseType: !115, size: 128)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "VendorTable", scope: !720, file: !14, line: 1971, baseType: !131, size: 64, offset: 128)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "DeviceHandle", scope: !244, file: !243, line: 53, baseType: !152, size: 64, offset: 192)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "FilePath", scope: !244, file: !243, line: 54, baseType: !155, size: 64, offset: 256)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved", scope: !244, file: !243, line: 56, baseType: !131, size: 64, offset: 320)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "LoadOptionsSize", scope: !244, file: !243, line: 61, baseType: !122, size: 32, offset: 384)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "LoadOptions", scope: !244, file: !243, line: 62, baseType: !131, size: 64, offset: 448)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "ImageBase", scope: !244, file: !243, line: 67, baseType: !131, size: 64, offset: 512)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "ImageSize", scope: !244, file: !243, line: 68, baseType: !94, size: 64, offset: 576)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "ImageCodeType", scope: !244, file: !243, line: 69, baseType: !496, size: 32, offset: 640)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "ImageDataType", scope: !244, file: !243, line: 70, baseType: !496, size: 32, offset: 672)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "Unload", scope: !244, file: !243, line: 71, baseType: !610, size: 64, offset: 704)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "ImageEntryPoint", scope: !140, file: !139, line: 131, baseType: !735, size: 64, offset: 1088)
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "PHYSICAL_ADDRESS", file: !118, line: 237, baseType: !94)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "ImageBuffer", scope: !140, file: !139, line: 135, baseType: !735, size: 64, offset: 1152)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "NumberOfPage", scope: !140, file: !139, line: 139, baseType: !92, size: 64, offset: 1216)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "SmmImageHandle", scope: !140, file: !139, line: 140, baseType: !152, size: 64, offset: 1280)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "SmmLoadedImage", scope: !140, file: !139, line: 141, baseType: !242, size: 768, offset: 1344)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHAR8", file: !93, line: 200, baseType: !742)
!742 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "SMI_HANDLER_PROFILE_SW_REGISTER_CONTEXT", file: !745, line: 78, baseType: !746)
!745 = !DIFile(filename: "MdeModulePkg/Include/Guid/SmiHandlerProfile.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "9c6091c5c3c3135ac1f08c540e061d5a")
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SMI_HANDLER_PROFILE_SW_REGISTER_CONTEXT", file: !745, line: 76, size: 64, elements: !747)
!747 = !{!748}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "SwSmiInputValue", scope: !746, file: !745, line: 77, baseType: !94, size: 64)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SMM_SX_REGISTER_CONTEXT", file: !751, line: 22, baseType: !752)
!751 = !DIFile(filename: "MdePkg/Include/Protocol/SmmSxDispatch2.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "752a41549455b240c8cd70728f745641")
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MM_SX_REGISTER_CONTEXT", file: !53, line: 50, baseType: !753)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_MM_SX_REGISTER_CONTEXT", file: !53, line: 47, size: 64, elements: !754)
!754 = !{!755, !757}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !753, file: !53, line: 48, baseType: !756, size: 32)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SLEEP_TYPE", file: !53, line: 33, baseType: !52)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !753, file: !53, line: 49, baseType: !758, size: 32, offset: 32)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SLEEP_PHASE", file: !53, line: 42, baseType: !62)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SMM_POWER_BUTTON_REGISTER_CONTEXT", file: !761, line: 25, baseType: !762)
!761 = !DIFile(filename: "MdePkg/Include/Protocol/SmmPowerButtonDispatch2.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "6d4f84bfc18732b1df8bf29a806a0452")
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MM_POWER_BUTTON_REGISTER_CONTEXT", file: !68, line: 42, baseType: !763)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_MM_POWER_BUTTON_REGISTER_CONTEXT", file: !68, line: 37, size: 32, elements: !764)
!764 = !{!765}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !763, file: !68, line: 41, baseType: !766, size: 32)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_POWER_BUTTON_PHASE", file: !68, line: 32, baseType: !67)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SMM_STANDBY_BUTTON_REGISTER_CONTEXT", file: !769, line: 25, baseType: !770)
!769 = !DIFile(filename: "MdePkg/Include/Protocol/SmmStandbyButtonDispatch2.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "97ef6c731c57dcf3697aedead8d30fa9")
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MM_STANDBY_BUTTON_REGISTER_CONTEXT", file: !74, line: 43, baseType: !771)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_MM_STANDBY_BUTTON_REGISTER_CONTEXT", file: !74, line: 37, size: 32, elements: !772)
!772 = !{!773}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !771, file: !74, line: 42, baseType: !774, size: 32)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_STANDBY_BUTTON_PHASE", file: !74, line: 32, baseType: !73)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SMM_PERIODIC_TIMER_REGISTER_CONTEXT", file: !777, line: 54, baseType: !778)
!777 = !DIFile(filename: "MdePkg/Include/Protocol/SmmPeriodicTimerDispatch2.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "ac713c47c8a5d6e61b268dfc72724f78")
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_SMM_PERIODIC_TIMER_REGISTER_CONTEXT", file: !777, line: 42, size: 128, elements: !779)
!779 = !{!780, !781}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "Period", scope: !778, file: !777, line: 47, baseType: !94, size: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "SmiTickInterval", scope: !778, file: !777, line: 53, baseType: !94, size: 64, offset: 64)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SMM_GPI_REGISTER_CONTEXT", file: !784, line: 30, baseType: !785)
!784 = !DIFile(filename: "MdePkg/Include/Protocol/SmmGpiDispatch2.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "3859866d75031f01d4e889261b459fa6")
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MM_GPI_REGISTER_CONTEXT", file: !786, line: 40, baseType: !787)
!786 = !DIFile(filename: "MdePkg/Include/Protocol/MmGpiDispatch.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "8990a45592f5891d852489fdedfa122f")
!787 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_MM_GPI_REGISTER_CONTEXT", file: !786, line: 33, size: 64, elements: !788)
!788 = !{!789}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "GpiNum", scope: !787, file: !786, line: 39, baseType: !94, size: 64)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SMM_IO_TRAP_REGISTER_CONTEXT", file: !792, line: 31, baseType: !793)
!792 = !DIFile(filename: "MdePkg/Include/Protocol/SmmIoTrapDispatch2.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "41e9d6290219d6506641d2fc5eb7a8d4")
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MM_IO_TRAP_REGISTER_CONTEXT", file: !80, line: 43, baseType: !794)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_MM_IO_TRAP_REGISTER_CONTEXT", file: !80, line: 39, size: 64, elements: !795)
!795 = !{!796, !797, !798}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "Address", scope: !794, file: !80, line: 40, baseType: !124, size: 16)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !794, file: !80, line: 41, baseType: !124, size: 16, offset: 16)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !794, file: !80, line: 42, baseType: !799, size: 32, offset: 32)
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MM_IO_TRAP_DISPATCH_TYPE", file: !80, line: 33, baseType: !79)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "SMI_HANDLER_PROFILE_USB_REGISTER_CONTEXT", file: !745, line: 74, baseType: !802)
!802 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SMI_HANDLER_PROFILE_USB_REGISTER_CONTEXT", file: !745, line: 70, size: 64, elements: !803)
!803 = !{!804, !808}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !802, file: !745, line: 71, baseType: !805, size: 32)
!805 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_USB_SMI_TYPE", file: !806, line: 25, baseType: !807)
!806 = !DIFile(filename: "MdePkg/Include/Protocol/SmmUsbDispatch2.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "1eb1eebfb18c840b178839a329cc2d05")
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_USB_MMI_TYPE", file: !87, line: 31, baseType: !86)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "DevicePathSize", scope: !802, file: !745, line: 72, baseType: !122, size: 32, offset: 32)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "SMI_HANDLER", file: !139, line: 96, baseType: !811)
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SMI_HANDLER", file: !139, line: 88, size: 512, elements: !812)
!812 = !{!813, !814, !815, !823, !824, !833, !834}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", scope: !811, file: !139, line: 89, baseType: !92, size: 64)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "Link", scope: !811, file: !139, line: 90, baseType: !144, size: 128, offset: 64)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "Handler", scope: !811, file: !139, line: 91, baseType: !816, size: 64, offset: 192)
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SMM_HANDLER_ENTRY_POINT2", file: !817, line: 56, baseType: !818)
!817 = !DIFile(filename: "MdePkg/Include/Pi/PiSmmCis.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "26f8805d33aa377abd8e63bed8e50f01")
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MM_HANDLER_ENTRY_POINT", file: !819, line: 165, baseType: !820)
!819 = !DIFile(filename: "MdePkg/Include/Pi/PiMmCis.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "82364cafffe22fadeeaa767af7242f69")
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = !DISubroutineType(types: !822)
!822 = !{!167, !152, !228, !131, !181}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "CallerAddr", scope: !811, file: !139, line: 92, baseType: !92, size: 64, offset: 256)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "SmiEntry", scope: !811, file: !139, line: 93, baseType: !825, size: 64, offset: 320)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = !DIDerivedType(tag: DW_TAG_typedef, name: "SMI_ENTRY", file: !139, line: 84, baseType: !827)
!827 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SMI_ENTRY", file: !139, line: 78, size: 448, elements: !828)
!828 = !{!829, !830, !831, !832}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", scope: !827, file: !139, line: 79, baseType: !92, size: 64)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "AllEntries", scope: !827, file: !139, line: 80, baseType: !144, size: 128, offset: 64)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "HandlerType", scope: !827, file: !139, line: 82, baseType: !115, size: 128, offset: 192)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "SmiHandlers", scope: !827, file: !139, line: 83, baseType: !144, size: 128, offset: 320)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "Context", scope: !811, file: !139, line: 94, baseType: !131, size: 64, offset: 384)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "ContextSize", scope: !811, file: !139, line: 95, baseType: !92, size: 64, offset: 448)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = !DIDerivedType(tag: DW_TAG_typedef, name: "SMM_CORE_IMAGE_DATABASE_STRUCTURE", file: !745, line: 42, baseType: !837)
!837 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SMM_CORE_IMAGE_DATABASE_STRUCTURE", file: !745, line: 32, size: 512, elements: !838)
!838 = !{!839, !850, !851, !852, !853, !854, !855, !856}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "Header", scope: !837, file: !745, line: 33, baseType: !840, size: 128)
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "SMM_CORE_DATABASE_COMMON_HEADER", file: !745, line: 27, baseType: !841)
!841 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SMM_CORE_DATABASE_COMMON_HEADER", file: !745, line: 22, size: 128, elements: !842)
!842 = !{!843, !844, !845, !846}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", scope: !841, file: !745, line: 23, baseType: !122, size: 32)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !841, file: !745, line: 24, baseType: !122, size: 32, offset: 32)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "Revision", scope: !841, file: !745, line: 25, baseType: !122, size: 32, offset: 64)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved", scope: !841, file: !745, line: 26, baseType: !847, size: 32, offset: 96)
!847 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 32, elements: !848)
!848 = !{!849}
!849 = !DISubrange(count: 4)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "FileGuid", scope: !837, file: !745, line: 34, baseType: !115, size: 128, offset: 128)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "EntryPoint", scope: !837, file: !745, line: 35, baseType: !735, size: 64, offset: 256)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "ImageBase", scope: !837, file: !745, line: 36, baseType: !735, size: 64, offset: 320)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "ImageSize", scope: !837, file: !745, line: 37, baseType: !94, size: 64, offset: 384)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "ImageRef", scope: !837, file: !745, line: 38, baseType: !122, size: 32, offset: 448)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "PdbStringOffset", scope: !837, file: !745, line: 39, baseType: !124, size: 16, offset: 480)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved", scope: !837, file: !745, line: 40, baseType: !111, size: 16, offset: 496)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = !DIDerivedType(tag: DW_TAG_typedef, name: "SMM_CORE_SMI_HANDLER_STRUCTURE", file: !745, line: 89, baseType: !860)
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SMM_CORE_SMI_HANDLER_STRUCTURE", file: !745, line: 80, size: 256, elements: !861)
!861 = !{!862, !863, !864, !865, !866, !867, !868}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !860, file: !745, line: 81, baseType: !122, size: 32)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "ImageRef", scope: !860, file: !745, line: 82, baseType: !122, size: 32, offset: 32)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "CallerAddr", scope: !860, file: !745, line: 83, baseType: !735, size: 64, offset: 64)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "Handler", scope: !860, file: !745, line: 84, baseType: !735, size: 64, offset: 128)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "ContextBufferOffset", scope: !860, file: !745, line: 85, baseType: !124, size: 16, offset: 192)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved", scope: !860, file: !745, line: 86, baseType: !111, size: 16, offset: 208)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "ContextBufferSize", scope: !860, file: !745, line: 87, baseType: !122, size: 32, offset: 224)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!870 = !DIDerivedType(tag: DW_TAG_typedef, name: "SMI_HANDLER_PROFILE_PARAMETER_HEADER", file: !745, line: 118, baseType: !871)
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SMI_HANDLER_PROFILE_PARAMETER_HEADER", file: !745, line: 114, size: 128, elements: !872)
!872 = !{!873, !874, !875}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "Command", scope: !871, file: !745, line: 115, baseType: !122, size: 32)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "DataLength", scope: !871, file: !745, line: 116, baseType: !122, size: 32, offset: 32)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "ReturnStatus", scope: !871, file: !745, line: 117, baseType: !94, size: 64, offset: 64)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = !DIDerivedType(tag: DW_TAG_typedef, name: "SMI_HANDLER_PROFILE_PARAMETER_GET_INFO", file: !745, line: 123, baseType: !878)
!878 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SMI_HANDLER_PROFILE_PARAMETER_GET_INFO", file: !745, line: 120, size: 192, elements: !879)
!879 = !{!880, !881}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "Header", scope: !878, file: !745, line: 121, baseType: !870, size: 128)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "DataSize", scope: !878, file: !745, line: 122, baseType: !94, size: 64, offset: 128)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = !DIDerivedType(tag: DW_TAG_typedef, name: "SMI_HANDLER_PROFILE_PARAMETER_GET_DATA_BY_OFFSET", file: !745, line: 138, baseType: !884)
!884 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SMI_HANDLER_PROFILE_PARAMETER_GET_DATA_BY_OFFSET", file: !745, line: 125, size: 320, elements: !885)
!885 = !{!886, !887, !888, !889}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "Header", scope: !884, file: !745, line: 126, baseType: !870, size: 128)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "DataSize", scope: !884, file: !745, line: 131, baseType: !94, size: 64, offset: 128)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "DataBuffer", scope: !884, file: !745, line: 132, baseType: !735, size: 64, offset: 192)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "DataOffset", scope: !884, file: !745, line: 137, baseType: !94, size: 64, offset: 256)
!890 = !{!0, !891, !894, !896, !898, !900, !916, !918, !920, !922, !924, !926, !939, !941, !943, !945, !947, !949, !951, !953, !955}
!891 = !DIGlobalVariableExpression(var: !892, expr: !DIExpression())
!892 = distinct !DIGlobalVariable(name: "mRootSmiEntryList", scope: !2, file: !893, line: 81, type: !144, isLocal: false, isDefinition: true)
!893 = !DIFile(filename: "MdeModulePkg/Core/PiSmmCore/SmiHandlerProfile.c", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "5aee42ea430d28915df97cadc0e070a4")
!894 = !DIGlobalVariableExpression(var: !895, expr: !DIExpression())
!895 = distinct !DIGlobalVariable(name: "mSmmCoreRootSmiEntryList", scope: !2, file: !893, line: 83, type: !148, isLocal: false, isDefinition: true)
!896 = !DIGlobalVariableExpression(var: !897, expr: !DIExpression())
!897 = distinct !DIGlobalVariable(name: "mSmmCoreSmiEntryList", scope: !2, file: !893, line: 84, type: !148, isLocal: false, isDefinition: true)
!898 = !DIGlobalVariableExpression(var: !899, expr: !DIExpression())
!899 = distinct !DIGlobalVariable(name: "mSmmCoreHardwareSmiEntryList", scope: !2, file: !893, line: 85, type: !148, isLocal: false, isDefinition: true)
!900 = !DIGlobalVariableExpression(var: !901, expr: !DIExpression())
!901 = distinct !DIGlobalVariable(name: "mSmiHandlerProfile", scope: !2, file: !893, line: 101, type: !902, isLocal: false, isDefinition: true)
!902 = !DIDerivedType(tag: DW_TAG_typedef, name: "SMI_HANDLER_PROFILE_PROTOCOL", file: !745, line: 144, baseType: !903)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SMI_HANDLER_PROFILE_PROTOCOL", file: !745, line: 204, size: 128, elements: !904)
!904 = !{!905, !911}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "RegisterHandler", scope: !903, file: !745, line: 205, baseType: !906, size: 64)
!906 = !DIDerivedType(tag: DW_TAG_typedef, name: "SMI_HANDLER_PROFILE_REGISTER_HANDLER", file: !745, line: 168, baseType: !907)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = !DISubroutineType(types: !909)
!909 = !{!167, !910, !206, !816, !735, !131, !92}
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "UnregisterHandler", scope: !903, file: !745, line: 206, baseType: !912, size: 64, offset: 64)
!912 = !DIDerivedType(tag: DW_TAG_typedef, name: "SMI_HANDLER_PROFILE_UNREGISTER_HANDLER", file: !745, line: 196, baseType: !913)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!914 = !DISubroutineType(types: !915)
!915 = !{!167, !910, !206, !816, !131, !92}
!916 = !DIGlobalVariableExpression(var: !917, expr: !DIExpression(DW_OP_constu, 2, DW_OP_stack_value))
!917 = distinct !DIGlobalVariable(name: "ByProtocol", scope: !2, file: !14, line: 1473, type: !341, isLocal: true, isDefinition: true)
!918 = !DIGlobalVariableExpression(var: !919, expr: !DIExpression(DW_OP_constu, 0, DW_OP_stack_value))
!919 = distinct !DIGlobalVariable(name: "SmmCoreSmiHandlerCategoryRootHandler", scope: !2, file: !745, line: 48, type: !341, isLocal: true, isDefinition: true)
!920 = !DIGlobalVariableExpression(var: !921, expr: !DIExpression(DW_OP_constu, 1, DW_OP_stack_value))
!921 = distinct !DIGlobalVariable(name: "SmmCoreSmiHandlerCategoryGuidHandler", scope: !2, file: !745, line: 49, type: !341, isLocal: true, isDefinition: true)
!922 = !DIGlobalVariableExpression(var: !923, expr: !DIExpression(DW_OP_constu, 2, DW_OP_stack_value))
!923 = distinct !DIGlobalVariable(name: "SmmCoreSmiHandlerCategoryHardwareHandler", scope: !2, file: !745, line: 50, type: !341, isLocal: true, isDefinition: true)
!924 = !DIGlobalVariableExpression(var: !925, expr: !DIExpression(DW_OP_constu, 0, DW_OP_stack_value))
!925 = distinct !DIGlobalVariable(name: "EFI_NATIVE_INTERFACE", scope: !2, file: !14, line: 1148, type: !341, isLocal: true, isDefinition: true)
!926 = !DIGlobalVariableExpression(var: !927, expr: !DIExpression())
!927 = distinct !DIGlobalVariable(name: "mImageStruct", scope: !2, file: !893, line: 87, type: !928, isLocal: false, isDefinition: true)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!929 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE_STRUCT", file: !893, line: 40, baseType: !930)
!930 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IMAGE_STRUCT", file: !893, line: 32, size: 448, elements: !931)
!931 = !{!932, !933, !934, !935, !936, !937, !938}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "FileGuid", scope: !930, file: !893, line: 33, baseType: !115, size: 128)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "EntryPoint", scope: !930, file: !893, line: 34, baseType: !735, size: 64, offset: 128)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "ImageBase", scope: !930, file: !893, line: 35, baseType: !735, size: 64, offset: 192)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "ImageSize", scope: !930, file: !893, line: 36, baseType: !94, size: 64, offset: 256)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "ImageRef", scope: !930, file: !893, line: 37, baseType: !122, size: 32, offset: 320)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "PdbStringSize", scope: !930, file: !893, line: 38, baseType: !124, size: 16, offset: 352)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "PdbString", scope: !930, file: !893, line: 39, baseType: !740, size: 64, offset: 384)
!939 = !DIGlobalVariableExpression(var: !940, expr: !DIExpression())
!940 = distinct !DIGlobalVariable(name: "mImageStructCountMax", scope: !2, file: !893, line: 88, type: !122, isLocal: false, isDefinition: true)
!941 = !DIGlobalVariableExpression(var: !942, expr: !DIExpression())
!942 = distinct !DIGlobalVariable(name: "mImageStructCount", scope: !2, file: !893, line: 89, type: !122, isLocal: false, isDefinition: true)
!943 = !DIGlobalVariableExpression(var: !944, expr: !DIExpression())
!944 = distinct !DIGlobalVariable(name: "mSmiHandlerProfileDatabase", scope: !2, file: !893, line: 91, type: !131, isLocal: false, isDefinition: true)
!945 = !DIGlobalVariableExpression(var: !946, expr: !DIExpression())
!946 = distinct !DIGlobalVariable(name: "mSmiHandlerProfileDatabaseSize", scope: !2, file: !893, line: 92, type: !92, isLocal: false, isDefinition: true)
!947 = !DIGlobalVariableExpression(var: !948, expr: !DIExpression())
!948 = distinct !DIGlobalVariable(name: "mSmmImageDatabaseSize", scope: !2, file: !893, line: 94, type: !92, isLocal: false, isDefinition: true)
!949 = !DIGlobalVariableExpression(var: !950, expr: !DIExpression())
!950 = distinct !DIGlobalVariable(name: "mSmmRootSmiDatabaseSize", scope: !2, file: !893, line: 95, type: !92, isLocal: false, isDefinition: true)
!951 = !DIGlobalVariableExpression(var: !952, expr: !DIExpression())
!952 = distinct !DIGlobalVariable(name: "mSmmSmiDatabaseSize", scope: !2, file: !893, line: 96, type: !92, isLocal: false, isDefinition: true)
!953 = !DIGlobalVariableExpression(var: !954, expr: !DIExpression())
!954 = distinct !DIGlobalVariable(name: "mSmmHardwareSmiDatabaseSize", scope: !2, file: !893, line: 97, type: !92, isLocal: false, isDefinition: true)
!955 = !DIGlobalVariableExpression(var: !956, expr: !DIExpression())
!956 = distinct !DIGlobalVariable(name: "mSmiHandlerProfileRecordingStatus", scope: !2, file: !893, line: 99, type: !96, isLocal: false, isDefinition: true)
!957 = !{i32 2, !"CodeView", i32 1}
!958 = !{i32 2, !"Debug Info Version", i32 3}
!959 = !{i32 1, !"wchar_size", i32 2}
!960 = !{i32 7, !"PIC Level", i32 2}
!961 = !{i32 1, !"Code Model", i32 1}
!962 = !{i32 7, !"uwtable", i32 1}
!963 = !{i32 1, !"ThinLTO", i32 0}
!964 = !{i32 1, !"EnableSplitLTOUnit", i32 1}
!965 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!966 = distinct !DISubprogram(name: "SmiHandlerProfileRegisterHandler", scope: !893, file: !893, line: 1229, type: !908, scopeLine: 1237, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !967)
!967 = !{}
!968 = !DILocalVariable(name: "This", arg: 1, scope: !966, file: !893, line: 1230, type: !910)
!969 = !DILocation(line: 1230, scope: !966)
!970 = !DILocalVariable(name: "HandlerGuid", arg: 2, scope: !966, file: !893, line: 1231, type: !206)
!971 = !DILocation(line: 1231, scope: !966)
!972 = !DILocalVariable(name: "Handler", arg: 3, scope: !966, file: !893, line: 1232, type: !816)
!973 = !DILocation(line: 1232, scope: !966)
!974 = !DILocalVariable(name: "CallerAddress", arg: 4, scope: !966, file: !893, line: 1233, type: !735)
!975 = !DILocation(line: 1233, scope: !966)
!976 = !DILocalVariable(name: "Context", arg: 5, scope: !966, file: !893, line: 1234, type: !131)
!977 = !DILocation(line: 1234, scope: !966)
!978 = !DILocalVariable(name: "ContextSize", arg: 6, scope: !966, file: !893, line: 1235, type: !92)
!979 = !DILocation(line: 1235, scope: !966)
!980 = !DILocalVariable(name: "SmiHandler", scope: !966, file: !893, line: 1238, type: !809)
!981 = !DILocation(line: 1238, scope: !966)
!982 = !DILocalVariable(name: "SmiEntry", scope: !966, file: !893, line: 1239, type: !825)
!983 = !DILocation(line: 1239, scope: !966)
!984 = !DILocalVariable(name: "List", scope: !966, file: !893, line: 1240, type: !148)
!985 = !DILocation(line: 1240, scope: !966)
!986 = !DILocation(line: 1242, scope: !966)
!987 = !DILocation(line: 1245, scope: !988)
!988 = distinct !DILexicalBlock(scope: !989, file: !893, line: 1244)
!989 = distinct !DILexicalBlock(scope: !966, file: !893, line: 1242)
!990 = !DILocation(line: 1248, scope: !966)
!991 = !DILocation(line: 1249, scope: !966)
!992 = !DILocation(line: 1250, scope: !993)
!993 = distinct !DILexicalBlock(scope: !994, file: !893, line: 1249)
!994 = distinct !DILexicalBlock(scope: !966, file: !893, line: 1249)
!995 = !DILocation(line: 1253, scope: !966)
!996 = !DILocation(line: 1254, scope: !966)
!997 = !DILocation(line: 1255, scope: !966)
!998 = !DILocation(line: 1256, scope: !966)
!999 = !DILocation(line: 1257, scope: !966)
!1000 = !DILocation(line: 1259, scope: !966)
!1001 = !DILocation(line: 1260, scope: !1002)
!1002 = distinct !DILexicalBlock(scope: !1003, file: !893, line: 1259)
!1003 = distinct !DILexicalBlock(scope: !966, file: !893, line: 1259)
!1004 = !DILocation(line: 1261, scope: !1005)
!1005 = distinct !DILexicalBlock(scope: !1006, file: !893, line: 1260)
!1006 = distinct !DILexicalBlock(scope: !1002, file: !893, line: 1260)
!1007 = !DILocation(line: 1262, scope: !1005)
!1008 = !DILocation(line: 1262, scope: !1006)
!1009 = !DILocation(line: 1263, scope: !1010)
!1010 = distinct !DILexicalBlock(scope: !1011, file: !893, line: 1262)
!1011 = distinct !DILexicalBlock(scope: !1006, file: !893, line: 1262)
!1012 = !DILocation(line: 1264, scope: !1010)
!1013 = !DILocation(line: 1265, scope: !1014)
!1014 = distinct !DILexicalBlock(scope: !1011, file: !893, line: 1264)
!1015 = !DILocation(line: 1266, scope: !1014)
!1016 = !DILocation(line: 1262, scope: !1011)
!1017 = !DILocation(line: 1267, scope: !1002)
!1018 = !DILocation(line: 1269, scope: !966)
!1019 = !DILocation(line: 1270, scope: !1020)
!1020 = distinct !DILexicalBlock(scope: !1021, file: !893, line: 1269)
!1021 = distinct !DILexicalBlock(scope: !966, file: !893, line: 1269)
!1022 = !DILocation(line: 1271, scope: !1020)
!1023 = !DILocation(line: 1273, scope: !966)
!1024 = !DILocation(line: 1274, scope: !966)
!1025 = !DILocation(line: 1275, scope: !1026)
!1026 = distinct !DILexicalBlock(scope: !1027, file: !893, line: 1274)
!1027 = distinct !DILexicalBlock(scope: !966, file: !893, line: 1274)
!1028 = !DILocation(line: 1276, scope: !1029)
!1029 = distinct !DILexicalBlock(scope: !1030, file: !893, line: 1275)
!1030 = distinct !DILexicalBlock(scope: !1026, file: !893, line: 1275)
!1031 = !DILocation(line: 1277, scope: !1029)
!1032 = !DILocation(line: 1279, scope: !1026)
!1033 = !DILocation(line: 1280, scope: !1026)
!1034 = !DILocation(line: 1283, scope: !966)
!1035 = !DILocation(line: 1285, scope: !966)
!1036 = !DILocation(line: 1286, scope: !966)
!1037 = !DILocation(line: 1288, scope: !966)
!1038 = !DILocation(line: 1289, scope: !966)
!1039 = distinct !DISubprogram(name: "SmiHandlerProfileUnregisterHandler", scope: !893, file: !893, line: 1310, type: !914, scopeLine: 1317, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !967)
!1040 = !DILocalVariable(name: "This", arg: 1, scope: !1039, file: !893, line: 1311, type: !910)
!1041 = !DILocation(line: 1311, scope: !1039)
!1042 = !DILocalVariable(name: "HandlerGuid", arg: 2, scope: !1039, file: !893, line: 1312, type: !206)
!1043 = !DILocation(line: 1312, scope: !1039)
!1044 = !DILocalVariable(name: "Handler", arg: 3, scope: !1039, file: !893, line: 1313, type: !816)
!1045 = !DILocation(line: 1313, scope: !1039)
!1046 = !DILocalVariable(name: "Context", arg: 4, scope: !1039, file: !893, line: 1314, type: !131)
!1047 = !DILocation(line: 1314, scope: !1039)
!1048 = !DILocalVariable(name: "ContextSize", arg: 5, scope: !1039, file: !893, line: 1315, type: !92)
!1049 = !DILocation(line: 1315, scope: !1039)
!1050 = !DILocalVariable(name: "Link", scope: !1039, file: !893, line: 1318, type: !148)
!1051 = !DILocation(line: 1318, scope: !1039)
!1052 = !DILocalVariable(name: "Head", scope: !1039, file: !893, line: 1319, type: !148)
!1053 = !DILocation(line: 1319, scope: !1039)
!1054 = !DILocalVariable(name: "SmiHandler", scope: !1039, file: !893, line: 1320, type: !809)
!1055 = !DILocation(line: 1320, scope: !1039)
!1056 = !DILocalVariable(name: "SmiEntry", scope: !1039, file: !893, line: 1321, type: !825)
!1057 = !DILocation(line: 1321, scope: !1039)
!1058 = !DILocalVariable(name: "TargetSmiHandler", scope: !1039, file: !893, line: 1322, type: !809)
!1059 = !DILocation(line: 1322, scope: !1039)
!1060 = !DILocalVariable(name: "SearchContext", scope: !1039, file: !893, line: 1323, type: !131)
!1061 = !DILocation(line: 1323, scope: !1039)
!1062 = !DILocalVariable(name: "SearchContextSize", scope: !1039, file: !893, line: 1324, type: !92)
!1063 = !DILocation(line: 1324, scope: !1039)
!1064 = !DILocation(line: 1326, scope: !1039)
!1065 = !DILocation(line: 1329, scope: !1066)
!1066 = distinct !DILexicalBlock(scope: !1067, file: !893, line: 1328)
!1067 = distinct !DILexicalBlock(scope: !1039, file: !893, line: 1326)
!1068 = !DILocation(line: 1332, scope: !1039)
!1069 = !DILocation(line: 1333, scope: !1039)
!1070 = !DILocation(line: 1334, scope: !1071)
!1071 = distinct !DILexicalBlock(scope: !1072, file: !893, line: 1333)
!1072 = distinct !DILexicalBlock(scope: !1039, file: !893, line: 1333)
!1073 = !DILocation(line: 1337, scope: !1039)
!1074 = !DILocation(line: 1338, scope: !1039)
!1075 = !DILocation(line: 1339, scope: !1039)
!1076 = !DILocation(line: 1340, scope: !1077)
!1077 = distinct !DILexicalBlock(scope: !1078, file: !893, line: 1339)
!1078 = distinct !DILexicalBlock(scope: !1039, file: !893, line: 1339)
!1079 = !DILocation(line: 1341, scope: !1080)
!1080 = distinct !DILexicalBlock(scope: !1081, file: !893, line: 1340)
!1081 = distinct !DILexicalBlock(scope: !1077, file: !893, line: 1340)
!1082 = !DILocation(line: 1342, scope: !1080)
!1083 = !DILocation(line: 1342, scope: !1081)
!1084 = !DILocation(line: 1343, scope: !1085)
!1085 = distinct !DILexicalBlock(scope: !1086, file: !893, line: 1342)
!1086 = distinct !DILexicalBlock(scope: !1081, file: !893, line: 1342)
!1087 = !DILocation(line: 1344, scope: !1085)
!1088 = !DILocation(line: 1342, scope: !1086)
!1089 = !DILocation(line: 1345, scope: !1077)
!1090 = !DILocation(line: 1347, scope: !1039)
