; ModuleID = 'SmramProfileRecord.bc'
source_filename = "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main/MdeModulePkg/Core/PiSmmCore/SmramProfileRecord.c"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-windows-gnu"

%struct.MEMORY_PROFILE_FREE_MEMORY = type { %struct.MEMORY_PROFILE_COMMON_HEADER, i64, i32, [4 x i8] }
%struct.MEMORY_PROFILE_COMMON_HEADER = type { i32, i16, i16 }
%struct._LIST_ENTRY = type { %struct._LIST_ENTRY*, %struct._LIST_ENTRY* }
%struct.MEMORY_PROFILE_CONTEXT_DATA = type { i32, %struct.MEMORY_PROFILE_CONTEXT, %struct._LIST_ENTRY* }
%struct.MEMORY_PROFILE_CONTEXT = type { %struct.MEMORY_PROFILE_COMMON_HEADER, i64, i64, [18 x i64], [18 x i64], i64, i32, i32 }
%struct._EDKII_MEMORY_PROFILE_PROTOCOL = type { {}*, i64 (%struct._EDKII_MEMORY_PROFILE_PROTOCOL*, %struct.EFI_DEVICE_PATH_PROTOCOL*, i64, i64, i8)*, i64 (%struct._EDKII_MEMORY_PROFILE_PROTOCOL*, %struct.EFI_DEVICE_PATH_PROTOCOL*, i64, i64)*, i64 (%struct._EDKII_MEMORY_PROFILE_PROTOCOL*, i8*)*, i64 (%struct._EDKII_MEMORY_PROFILE_PROTOCOL*, i8)*, i64 (%struct._EDKII_MEMORY_PROFILE_PROTOCOL*, i64, i32, i32, i8*, i64, i8*)* }
%struct.EFI_DEVICE_PATH_PROTOCOL = type { i8, i8, [2 x i8] }

!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !59, globals: !327, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main/MdeModulePkg/Core/PiSmmCore/SmramProfileRecord.c", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main/Build/OvmfX64/NOOPT_CLANGPDB/X64/MdeModulePkg/Core/PiSmmCore/PiSmmCore", checksumkind: CSK_MD5, checksum: "f9127a4ff7d3300c3f8e2afcf535b8c3")
!4 = !{!5, !13, !33, !39, !46, !51, !54}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 62, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "MdeModulePkg/Include/Guid/MemoryProfile.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "e47cc32ae5ee8a860f3e9836424cfce9")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12}
!9 = !DIEnumerator(name: "MemoryProfileActionAllocatePages", value: 1)
!10 = !DIEnumerator(name: "MemoryProfileActionFreePages", value: 2)
!11 = !DIEnumerator(name: "MemoryProfileActionAllocatePool", value: 3)
!12 = !DIEnumerator(name: "MemoryProfileActionFreePool", value: 4)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !14, line: 38, baseType: !7, size: 32, elements: !15)
!14 = !DIFile(filename: "MdePkg/Include/Uefi/UefiMultiPhase.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "321376346bf760b12510b9ae9d8f46f8")
!15 = !{!16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32}
!16 = !DIEnumerator(name: "EfiReservedMemoryType", value: 0)
!17 = !DIEnumerator(name: "EfiLoaderCode", value: 1)
!18 = !DIEnumerator(name: "EfiLoaderData", value: 2)
!19 = !DIEnumerator(name: "EfiBootServicesCode", value: 3)
!20 = !DIEnumerator(name: "EfiBootServicesData", value: 4)
!21 = !DIEnumerator(name: "EfiRuntimeServicesCode", value: 5)
!22 = !DIEnumerator(name: "EfiRuntimeServicesData", value: 6)
!23 = !DIEnumerator(name: "EfiConventionalMemory", value: 7)
!24 = !DIEnumerator(name: "EfiUnusableMemory", value: 8)
!25 = !DIEnumerator(name: "EfiACPIReclaimMemory", value: 9)
!26 = !DIEnumerator(name: "EfiACPIMemoryNVS", value: 10)
!27 = !DIEnumerator(name: "EfiMemoryMappedIO", value: 11)
!28 = !DIEnumerator(name: "EfiMemoryMappedIOPortSpace", value: 12)
!29 = !DIEnumerator(name: "EfiPalCode", value: 13)
!30 = !DIEnumerator(name: "EfiPersistentMemory", value: 14)
!31 = !DIEnumerator(name: "EfiUnacceptedMemoryType", value: 15)
!32 = !DIEnumerator(name: "EfiMaxMemoryType", value: 16)
!33 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !14, line: 117, baseType: !7, size: 32, elements: !34)
!34 = !{!35, !36, !37, !38}
!35 = !DIEnumerator(name: "EfiResetCold", value: 0)
!36 = !DIEnumerator(name: "EfiResetWarm", value: 1)
!37 = !DIEnumerator(name: "EfiResetShutdown", value: 2)
!38 = !DIEnumerator(name: "EfiResetPlatformSpecific", value: 3)
!39 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !40, line: 29, baseType: !7, size: 32, elements: !41)
!40 = !DIFile(filename: "MdePkg/Include/Uefi/UefiSpec.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "dd07249351b00161d82576c2d3d57d19")
!41 = !{!42, !43, !44, !45}
!42 = !DIEnumerator(name: "AllocateAnyPages", value: 0)
!43 = !DIEnumerator(name: "AllocateMaxAddress", value: 1)
!44 = !DIEnumerator(name: "AllocateAddress", value: 2)
!45 = !DIEnumerator(name: "MaxAllocateType", value: 3)
!46 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !40, line: 506, baseType: !7, size: 32, elements: !47)
!47 = !{!48, !49, !50}
!48 = !DIEnumerator(name: "TimerCancel", value: 0)
!49 = !DIEnumerator(name: "TimerPeriodic", value: 1)
!50 = !DIEnumerator(name: "TimerRelative", value: 2)
!51 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !40, line: 1144, baseType: !7, size: 32, elements: !52)
!52 = !{!53}
!53 = !DIEnumerator(name: "EFI_NATIVE_INTERFACE", value: 0)
!54 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !40, line: 1460, baseType: !7, size: 32, elements: !55)
!55 = !{!56, !57, !58}
!56 = !DIEnumerator(name: "AllHandles", value: 0)
!57 = !DIEnumerator(name: "ByRegisterNotify", value: 1)
!58 = !DIEnumerator(name: "ByProtocol", value: 2)
!59 = !{!60, !61, !64, !97, !157, !160, !162, !163, !70, !166, !167, !173, !176, !204, !205, !250, !257, !279, !292, !96, !158, !164, !293, !300, !306, !313, !321}
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "BOOLEAN", file: !62, line: 192, baseType: !63)
!62 = !DIFile(filename: "MdePkg/Include/X64/ProcessorBind.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "ef2524a221fe61206fa09ec88dd4f59b")
!63 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IMAGE_DOS_HEADER", file: !66, line: 77, baseType: !67)
!66 = !DIFile(filename: "MdePkg/Include/IndustryStandard/PeImage.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "5617df6c12f0ebe2c225debd76491c44")
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_IMAGE_DOS_HEADER", file: !66, line: 57, size: 512, elements: !68)
!68 = !{!69, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !89, !90, !91, !95}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "e_magic", scope: !67, file: !66, line: 58, baseType: !70, size: 16)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT16", file: !62, line: 178, baseType: !71)
!71 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "e_cblp", scope: !67, file: !66, line: 59, baseType: !70, size: 16, offset: 16)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "e_cp", scope: !67, file: !66, line: 60, baseType: !70, size: 16, offset: 32)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "e_crlc", scope: !67, file: !66, line: 61, baseType: !70, size: 16, offset: 48)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "e_cparhdr", scope: !67, file: !66, line: 62, baseType: !70, size: 16, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "e_minalloc", scope: !67, file: !66, line: 63, baseType: !70, size: 16, offset: 80)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "e_maxalloc", scope: !67, file: !66, line: 64, baseType: !70, size: 16, offset: 96)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "e_ss", scope: !67, file: !66, line: 65, baseType: !70, size: 16, offset: 112)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "e_sp", scope: !67, file: !66, line: 66, baseType: !70, size: 16, offset: 128)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "e_csum", scope: !67, file: !66, line: 67, baseType: !70, size: 16, offset: 144)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "e_ip", scope: !67, file: !66, line: 68, baseType: !70, size: 16, offset: 160)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "e_cs", scope: !67, file: !66, line: 69, baseType: !70, size: 16, offset: 176)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "e_lfarlc", scope: !67, file: !66, line: 70, baseType: !70, size: 16, offset: 192)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "e_ovno", scope: !67, file: !66, line: 71, baseType: !70, size: 16, offset: 208)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "e_res", scope: !67, file: !66, line: 72, baseType: !86, size: 64, offset: 224)
!86 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 64, elements: !87)
!87 = !{!88}
!88 = !DISubrange(count: 4)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "e_oemid", scope: !67, file: !66, line: 73, baseType: !70, size: 16, offset: 288)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "e_oeminfo", scope: !67, file: !66, line: 74, baseType: !70, size: 16, offset: 304)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "e_res2", scope: !67, file: !66, line: 75, baseType: !92, size: 160, offset: 320)
!92 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 160, elements: !93)
!93 = !{!94}
!94 = !DISubrange(count: 10)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "e_lfanew", scope: !67, file: !66, line: 76, baseType: !96, size: 32, offset: 480)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT32", file: !62, line: 170, baseType: !7)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IMAGE_NT_HEADERS32", file: !66, line: 246, baseType: !99)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_IMAGE_NT_HEADERS32", file: !66, line: 242, size: 1984, elements: !100)
!100 = !{!101, !102, !113}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", scope: !99, file: !66, line: 243, baseType: !96, size: 32)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "FileHeader", scope: !99, file: !66, line: 244, baseType: !103, size: 160, offset: 32)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IMAGE_FILE_HEADER", file: !66, line: 90, baseType: !104)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_IMAGE_FILE_HEADER", file: !66, line: 82, size: 160, elements: !105)
!105 = !{!106, !107, !108, !109, !110, !111, !112}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "Machine", scope: !104, file: !66, line: 83, baseType: !70, size: 16)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "NumberOfSections", scope: !104, file: !66, line: 84, baseType: !70, size: 16, offset: 16)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "TimeDateStamp", scope: !104, file: !66, line: 85, baseType: !96, size: 32, offset: 32)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "PointerToSymbolTable", scope: !104, file: !66, line: 86, baseType: !96, size: 32, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "NumberOfSymbols", scope: !104, file: !66, line: 87, baseType: !96, size: 32, offset: 96)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "SizeOfOptionalHeader", scope: !104, file: !66, line: 88, baseType: !70, size: 16, offset: 128)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "Characteristics", scope: !104, file: !66, line: 89, baseType: !70, size: 16, offset: 144)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "OptionalHeader", scope: !99, file: !66, line: 245, baseType: !114, size: 1792, offset: 192)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IMAGE_OPTIONAL_HEADER32", file: !66, line: 186, baseType: !115)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_IMAGE_OPTIONAL_HEADER32", file: !66, line: 148, size: 1792, elements: !116)
!116 = !{!117, !118, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "Magic", scope: !115, file: !66, line: 152, baseType: !70, size: 16)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "MajorLinkerVersion", scope: !115, file: !66, line: 153, baseType: !119, size: 8, offset: 16)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT8", file: !62, line: 196, baseType: !63)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "MinorLinkerVersion", scope: !115, file: !66, line: 154, baseType: !119, size: 8, offset: 24)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "SizeOfCode", scope: !115, file: !66, line: 155, baseType: !96, size: 32, offset: 32)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "SizeOfInitializedData", scope: !115, file: !66, line: 156, baseType: !96, size: 32, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "SizeOfUninitializedData", scope: !115, file: !66, line: 157, baseType: !96, size: 32, offset: 96)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "AddressOfEntryPoint", scope: !115, file: !66, line: 158, baseType: !96, size: 32, offset: 128)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "BaseOfCode", scope: !115, file: !66, line: 159, baseType: !96, size: 32, offset: 160)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "BaseOfData", scope: !115, file: !66, line: 160, baseType: !96, size: 32, offset: 192)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "ImageBase", scope: !115, file: !66, line: 164, baseType: !96, size: 32, offset: 224)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "SectionAlignment", scope: !115, file: !66, line: 165, baseType: !96, size: 32, offset: 256)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "FileAlignment", scope: !115, file: !66, line: 166, baseType: !96, size: 32, offset: 288)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "MajorOperatingSystemVersion", scope: !115, file: !66, line: 167, baseType: !70, size: 16, offset: 320)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "MinorOperatingSystemVersion", scope: !115, file: !66, line: 168, baseType: !70, size: 16, offset: 336)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "MajorImageVersion", scope: !115, file: !66, line: 169, baseType: !70, size: 16, offset: 352)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "MinorImageVersion", scope: !115, file: !66, line: 170, baseType: !70, size: 16, offset: 368)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "MajorSubsystemVersion", scope: !115, file: !66, line: 171, baseType: !70, size: 16, offset: 384)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "MinorSubsystemVersion", scope: !115, file: !66, line: 172, baseType: !70, size: 16, offset: 400)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "Win32VersionValue", scope: !115, file: !66, line: 173, baseType: !96, size: 32, offset: 416)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "SizeOfImage", scope: !115, file: !66, line: 174, baseType: !96, size: 32, offset: 448)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "SizeOfHeaders", scope: !115, file: !66, line: 175, baseType: !96, size: 32, offset: 480)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "CheckSum", scope: !115, file: !66, line: 176, baseType: !96, size: 32, offset: 512)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "Subsystem", scope: !115, file: !66, line: 177, baseType: !70, size: 16, offset: 544)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "DllCharacteristics", scope: !115, file: !66, line: 178, baseType: !70, size: 16, offset: 560)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "SizeOfStackReserve", scope: !115, file: !66, line: 179, baseType: !96, size: 32, offset: 576)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "SizeOfStackCommit", scope: !115, file: !66, line: 180, baseType: !96, size: 32, offset: 608)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "SizeOfHeapReserve", scope: !115, file: !66, line: 181, baseType: !96, size: 32, offset: 640)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "SizeOfHeapCommit", scope: !115, file: !66, line: 182, baseType: !96, size: 32, offset: 672)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "LoaderFlags", scope: !115, file: !66, line: 183, baseType: !96, size: 32, offset: 704)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "NumberOfRvaAndSizes", scope: !115, file: !66, line: 184, baseType: !96, size: 32, offset: 736)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "DataDirectory", scope: !115, file: !66, line: 185, baseType: !149, size: 1024, offset: 768)
!149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 1024, elements: !155)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IMAGE_DATA_DIRECTORY", file: !66, line: 118, baseType: !151)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_IMAGE_DATA_DIRECTORY", file: !66, line: 115, size: 64, elements: !152)
!152 = !{!153, !154}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "VirtualAddress", scope: !151, file: !66, line: 116, baseType: !96, size: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !151, file: !66, line: 117, baseType: !96, size: 32, offset: 32)
!155 = !{!156}
!156 = !DISubrange(count: 16)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINTN", file: !62, line: 211, baseType: !158)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT64", file: !62, line: 162, baseType: !159)
!159 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "RETURN_STATUS", file: !161, line: 1026, baseType: !157)
!161 = !DIFile(filename: "MdePkg/Include/Base.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "0c11ea3d1992443d8a8f590a064e50ff")
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTN", file: !62, line: 216, baseType: !164)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT64", file: !62, line: 166, baseType: !165)
!165 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "PHYSICAL_ADDRESS", file: !161, line: 237, baseType: !158)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "LIST_ENTRY", file: !161, line: 242, baseType: !169)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_LIST_ENTRY", file: !161, line: 247, size: 128, elements: !170)
!170 = !{!171, !172}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "ForwardLink", scope: !169, file: !161, line: 248, baseType: !167, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "BackLink", scope: !169, file: !161, line: 249, baseType: !167, size: 64, offset: 64)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHAR8", file: !62, line: 200, baseType: !175)
!175 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "MEDIA_FW_VOL_FILEPATH_DEVICE_PATH", file: !178, line: 1121, baseType: !179)
!178 = !DIFile(filename: "MdePkg/Include/Protocol/DevicePath.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "6b6d593d171f69b933a87911e52d4607")
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MEDIA_FW_VOL_FILEPATH_DEVICE_PATH", file: !178, line: 1115, size: 160, elements: !180)
!180 = !{!181, !191}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "Header", scope: !179, file: !178, line: 1116, baseType: !182, size: 32)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DEVICE_PATH_PROTOCOL", file: !178, line: 58, baseType: !183)
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_DEVICE_PATH_PROTOCOL", file: !178, line: 43, size: 32, elements: !184)
!184 = !{!185, !186, !187}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !183, file: !178, line: 44, baseType: !119, size: 8)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "SubType", scope: !183, file: !178, line: 51, baseType: !119, size: 8, offset: 8)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !183, file: !178, line: 56, baseType: !188, size: 16, offset: 16)
!188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 16, elements: !189)
!189 = !{!190}
!190 = !DISubrange(count: 2)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "FvFileName", scope: !179, file: !178, line: 1120, baseType: !192, size: 128, offset: 32)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GUID", file: !193, line: 25, baseType: !194)
!193 = !DIFile(filename: "MdePkg/Include/Uefi/UefiBaseType.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "dbec48e65949dff122bc920c9d9d9c6a")
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "GUID", file: !161, line: 218, baseType: !195)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GUID", file: !161, line: 213, size: 128, elements: !196)
!196 = !{!197, !198, !199, !200}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "Data1", scope: !195, file: !161, line: 214, baseType: !96, size: 32)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "Data2", scope: !195, file: !161, line: 215, baseType: !70, size: 16, offset: 32)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "Data3", scope: !195, file: !161, line: 216, baseType: !70, size: 16, offset: 48)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "Data4", scope: !195, file: !161, line: 217, baseType: !201, size: 64, offset: 64)
!201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 64, elements: !202)
!202 = !{!203}
!203 = !DISubrange(count: 8)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "MEMORY_PROFILE_DRIVER_INFO_DATA", file: !207, line: 29, baseType: !208)
!207 = !DIFile(filename: "MdeModulePkg/Core/PiSmmCore/SmramProfileRecord.c", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "f9127a4ff7d3300c3f8e2afcf535b8c3")
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MEMORY_PROFILE_DRIVER_INFO_DATA", file: !207, line: 23, size: 3264, elements: !209)
!209 = !{!210, !211, !247, !248, !249}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", scope: !208, file: !207, line: 24, baseType: !96, size: 32)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "DriverInfo", scope: !208, file: !207, line: 25, baseType: !212, size: 2944, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "MEMORY_PROFILE_DRIVER_INFO", file: !6, line: 60, baseType: !213)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MEMORY_PROFILE_DRIVER_INFO", file: !6, line: 43, size: 2944, elements: !214)
!214 = !{!215, !222, !223, !224, !225, !226, !227, !230, !234, !235, !236, !237, !241, !242, !243}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "Header", scope: !213, file: !6, line: 44, baseType: !216, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "MEMORY_PROFILE_COMMON_HEADER", file: !6, line: 24, baseType: !217)
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MEMORY_PROFILE_COMMON_HEADER", file: !6, line: 20, size: 64, elements: !218)
!218 = !{!219, !220, !221}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", scope: !217, file: !6, line: 21, baseType: !96, size: 32)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !217, file: !6, line: 22, baseType: !70, size: 16, offset: 32)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "Revision", scope: !217, file: !6, line: 23, baseType: !70, size: 16, offset: 48)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "FileName", scope: !213, file: !6, line: 45, baseType: !192, size: 128, offset: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "ImageBase", scope: !213, file: !6, line: 46, baseType: !166, size: 64, offset: 192)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "ImageSize", scope: !213, file: !6, line: 47, baseType: !158, size: 64, offset: 256)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "EntryPoint", scope: !213, file: !6, line: 48, baseType: !166, size: 64, offset: 320)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "ImageSubsystem", scope: !213, file: !6, line: 49, baseType: !70, size: 16, offset: 384)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "FileType", scope: !213, file: !6, line: 50, baseType: !228, size: 8, offset: 400)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FV_FILETYPE", file: !229, line: 50, baseType: !119)
!229 = !DIFile(filename: "MdePkg/Include/Pi/PiFirmwareFile.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "942fe99f769f631cab0d641a8d548f4d")
!230 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved", scope: !213, file: !6, line: 51, baseType: !231, size: 8, offset: 408)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 8, elements: !232)
!232 = !{!233}
!233 = !DISubrange(count: 1)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "AllocRecordCount", scope: !213, file: !6, line: 52, baseType: !96, size: 32, offset: 416)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "CurrentUsage", scope: !213, file: !6, line: 53, baseType: !158, size: 64, offset: 448)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "PeakUsage", scope: !213, file: !6, line: 54, baseType: !158, size: 64, offset: 512)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "CurrentUsageByType", scope: !213, file: !6, line: 55, baseType: !238, size: 1152, offset: 576)
!238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 1152, elements: !239)
!239 = !{!240}
!240 = !DISubrange(count: 18)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "PeakUsageByType", scope: !213, file: !6, line: 56, baseType: !238, size: 1152, offset: 1728)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "PdbStringOffset", scope: !213, file: !6, line: 57, baseType: !70, size: 16, offset: 2880)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !213, file: !6, line: 58, baseType: !244, size: 48, offset: 2896)
!244 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 48, elements: !245)
!245 = !{!246}
!246 = !DISubrange(count: 6)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "AllocInfoList", scope: !208, file: !207, line: 26, baseType: !167, size: 64, offset: 3008)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "PdbString", scope: !208, file: !207, line: 27, baseType: !173, size: 64, offset: 3072)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "Link", scope: !208, file: !207, line: 28, baseType: !168, size: 128, offset: 3136)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "FREE_PAGE_LIST", file: !252, line: 1224, baseType: !253)
!252 = !DIFile(filename: "MdeModulePkg/Core/PiSmmCore/PiSmmCore.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "e4edf3842107ce4b1893f0150320562f")
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FREE_PAGE_LIST", file: !252, line: 1221, size: 192, elements: !254)
!254 = !{!255, !256}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "Link", scope: !253, file: !252, line: 1222, baseType: !168, size: 128)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "NumberOfPages", scope: !253, file: !252, line: 1223, baseType: !157, size: 64, offset: 128)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "MEMORY_PROFILE_ALLOC_INFO_DATA", file: !207, line: 36, baseType: !259)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MEMORY_PROFILE_ALLOC_INFO_DATA", file: !207, line: 31, size: 640, elements: !260)
!260 = !{!261, !262, !277, !278}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", scope: !259, file: !207, line: 32, baseType: !96, size: 32)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "AllocInfo", scope: !259, file: !207, line: 33, baseType: !263, size: 384, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "MEMORY_PROFILE_ALLOC_INFO", file: !6, line: 150, baseType: !264)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MEMORY_PROFILE_ALLOC_INFO", file: !6, line: 139, size: 384, elements: !265)
!265 = !{!266, !267, !268, !269, !270, !271, !273, !275, !276}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "Header", scope: !264, file: !6, line: 140, baseType: !216, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "CallerAddress", scope: !264, file: !6, line: 141, baseType: !166, size: 64, offset: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "SequenceId", scope: !264, file: !6, line: 142, baseType: !96, size: 32, offset: 128)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved", scope: !264, file: !6, line: 143, baseType: !188, size: 16, offset: 160)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "ActionStringOffset", scope: !264, file: !6, line: 144, baseType: !70, size: 16, offset: 176)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "Action", scope: !264, file: !6, line: 145, baseType: !272, size: 32, offset: 192)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "MEMORY_PROFILE_ACTION", file: !6, line: 67, baseType: !5)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "MemoryType", scope: !264, file: !6, line: 146, baseType: !274, size: 32, offset: 224)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MEMORY_TYPE", file: !14, line: 112, baseType: !13)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "Buffer", scope: !264, file: !6, line: 147, baseType: !166, size: 64, offset: 256)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !264, file: !6, line: 148, baseType: !158, size: 64, offset: 320)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "ActionString", scope: !259, file: !207, line: 34, baseType: !173, size: 64, offset: 448)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "Link", scope: !259, file: !207, line: 35, baseType: !168, size: 128, offset: 512)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "FREE_POOL_HEADER", file: !252, line: 1274, baseType: !281)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FREE_POOL_HEADER", file: !252, line: 1271, size: 320, elements: !282)
!282 = !{!283, !291}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "Header", scope: !281, file: !252, line: 1272, baseType: !284, size: 192)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "POOL_HEADER", file: !252, line: 1256, baseType: !285)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "POOL_HEADER", file: !252, line: 1251, size: 192, elements: !286)
!286 = !{!287, !288, !289, !290}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", scope: !285, file: !252, line: 1252, baseType: !96, size: 32)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "Available", scope: !285, file: !252, line: 1253, baseType: !61, size: 8, offset: 32)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !285, file: !252, line: 1254, baseType: !274, size: 32, offset: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !285, file: !252, line: 1255, baseType: !157, size: 64, offset: 128)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "Link", scope: !281, file: !252, line: 1273, baseType: !168, size: 128, offset: 192)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "SMRAM_PROFILE_PARAMETER_HEADER", file: !6, line: 405, baseType: !295)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SMRAM_PROFILE_PARAMETER_HEADER", file: !6, line: 401, size: 128, elements: !296)
!296 = !{!297, !298, !299}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "Command", scope: !295, file: !6, line: 402, baseType: !96, size: 32)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "DataLength", scope: !295, file: !6, line: 403, baseType: !96, size: 32, offset: 32)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "ReturnStatus", scope: !295, file: !6, line: 404, baseType: !158, size: 64, offset: 64)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "SMRAM_PROFILE_PARAMETER_GET_PROFILE_INFO", file: !6, line: 410, baseType: !302)
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SMRAM_PROFILE_PARAMETER_GET_PROFILE_INFO", file: !6, line: 407, size: 192, elements: !303)
!303 = !{!304, !305}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "Header", scope: !302, file: !6, line: 408, baseType: !294, size: 128)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "ProfileSize", scope: !302, file: !6, line: 409, baseType: !158, size: 64, offset: 128)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "SMRAM_PROFILE_PARAMETER_GET_PROFILE_DATA", file: !6, line: 416, baseType: !308)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SMRAM_PROFILE_PARAMETER_GET_PROFILE_DATA", file: !6, line: 412, size: 256, elements: !309)
!309 = !{!310, !311, !312}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "Header", scope: !308, file: !6, line: 413, baseType: !294, size: 128)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "ProfileSize", scope: !308, file: !6, line: 414, baseType: !158, size: 64, offset: 128)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "ProfileBuffer", scope: !308, file: !6, line: 415, baseType: !166, size: 64, offset: 192)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "SMRAM_PROFILE_PARAMETER_GET_PROFILE_DATA_BY_OFFSET", file: !6, line: 431, baseType: !315)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SMRAM_PROFILE_PARAMETER_GET_PROFILE_DATA_BY_OFFSET", file: !6, line: 418, size: 320, elements: !316)
!316 = !{!317, !318, !319, !320}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "Header", scope: !315, file: !6, line: 419, baseType: !294, size: 128)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "ProfileSize", scope: !315, file: !6, line: 424, baseType: !158, size: 64, offset: 128)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "ProfileBuffer", scope: !315, file: !6, line: 425, baseType: !166, size: 64, offset: 192)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "ProfileOffset", scope: !315, file: !6, line: 430, baseType: !158, size: 64, offset: 256)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "SMRAM_PROFILE_PARAMETER_RECORDING_STATE", file: !6, line: 436, baseType: !323)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SMRAM_PROFILE_PARAMETER_RECORDING_STATE", file: !6, line: 433, size: 192, elements: !324)
!324 = !{!325, !326}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "Header", scope: !323, file: !6, line: 434, baseType: !294, size: 128)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "RecordingState", scope: !323, file: !6, line: 435, baseType: !61, size: 8, offset: 128)
!327 = !{!0, !328, !330, !349, !352, !354, !356, !396, !399, !401, !403, !405, !407, !409, !411, !416, !426, !434, !436, !438}
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(name: "mImageQueue", scope: !2, file: !207, line: 53, type: !168, isLocal: false, isDefinition: true)
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(name: "mSmramProfileContext", scope: !2, file: !207, line: 54, type: !332, isLocal: false, isDefinition: true)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "MEMORY_PROFILE_CONTEXT_DATA", file: !207, line: 21, baseType: !333)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MEMORY_PROFILE_CONTEXT_DATA", file: !207, line: 17, size: 2752, elements: !334)
!334 = !{!335, !336, !348}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", scope: !333, file: !207, line: 18, baseType: !96, size: 32)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "Context", scope: !333, file: !207, line: 19, baseType: !337, size: 2624, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "MEMORY_PROFILE_CONTEXT", file: !6, line: 38, baseType: !338)
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MEMORY_PROFILE_CONTEXT", file: !6, line: 29, size: 2624, elements: !339)
!339 = !{!340, !341, !342, !343, !344, !345, !346, !347}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "Header", scope: !338, file: !6, line: 30, baseType: !216, size: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "CurrentTotalUsage", scope: !338, file: !6, line: 31, baseType: !158, size: 64, offset: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "PeakTotalUsage", scope: !338, file: !6, line: 32, baseType: !158, size: 64, offset: 128)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "CurrentTotalUsageByType", scope: !338, file: !6, line: 33, baseType: !238, size: 1152, offset: 192)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "PeakTotalUsageByType", scope: !338, file: !6, line: 34, baseType: !238, size: 1152, offset: 1344)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "TotalImageSize", scope: !338, file: !6, line: 35, baseType: !158, size: 64, offset: 2496)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "ImageCount", scope: !338, file: !6, line: 36, baseType: !96, size: 32, offset: 2560)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "SequenceCount", scope: !338, file: !6, line: 37, baseType: !96, size: 32, offset: 2592)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "DriverInfoList", scope: !333, file: !207, line: 20, baseType: !167, size: 64, offset: 2688)
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(name: "mSmramProfileContextPtr", scope: !2, file: !207, line: 72, type: !351, isLocal: false, isDefinition: true)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(name: "mSmramProfileGettingStatus", scope: !2, file: !207, line: 75, type: !61, isLocal: false, isDefinition: true)
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(name: "mSmramProfileRecordingEnable", scope: !2, file: !207, line: 76, type: !61, isLocal: false, isDefinition: true)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(name: "mSmmProfileProtocol", scope: !2, file: !207, line: 229, type: !358, isLocal: false, isDefinition: true)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "EDKII_SMM_MEMORY_PROFILE_PROTOCOL", file: !6, line: 458, baseType: !359)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "EDKII_MEMORY_PROFILE_PROTOCOL", file: !6, line: 201, baseType: !360)
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EDKII_MEMORY_PROFILE_PROTOCOL", file: !6, line: 346, size: 384, elements: !361)
!361 = !{!362, !370, !375, !380, !386, !391}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "GetData", scope: !360, file: !6, line: 347, baseType: !363, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "EDKII_MEMORY_PROFILE_GET_DATA", file: !6, line: 219, baseType: !364)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DISubroutineType(types: !366)
!366 = !{!367, !368, !369, !60}
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_STATUS", file: !193, line: 29, baseType: !160)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "RegisterImage", scope: !360, file: !6, line: 348, baseType: !371, size: 64, offset: 64)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "EDKII_MEMORY_PROFILE_REGISTER_IMAGE", file: !6, line: 242, baseType: !372)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DISubroutineType(types: !374)
!374 = !{!367, !368, !204, !166, !158, !228}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "UnregisterImage", scope: !360, file: !6, line: 349, baseType: !376, size: 64, offset: 128)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "EDKII_MEMORY_PROFILE_UNREGISTER_IMAGE", file: !6, line: 266, baseType: !377)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DISubroutineType(types: !379)
!379 = !{!367, !368, !204, !166, !158}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "GetRecordingState", scope: !360, file: !6, line: 350, baseType: !381, size: 64, offset: 192)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "EDKII_MEMORY_PROFILE_GET_RECORDING_STATE", file: !6, line: 289, baseType: !382)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DISubroutineType(types: !384)
!384 = !{!367, !368, !385}
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "SetRecordingState", scope: !360, file: !6, line: 351, baseType: !387, size: 64, offset: 256)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "EDKII_MEMORY_PROFILE_SET_RECORDING_STATE", file: !6, line: 306, baseType: !388)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DISubroutineType(types: !390)
!390 = !{!367, !368, !61}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "Record", scope: !360, file: !6, line: 352, baseType: !392, size: 64, offset: 320)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "EDKII_MEMORY_PROFILE_RECORD", file: !6, line: 336, baseType: !393)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DISubroutineType(types: !395)
!395 = !{!367, !368, !166, !272, !274, !60, !157, !173}
!396 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression(DW_OP_constu, 6, DW_OP_stack_value))
!397 = distinct !DIGlobalVariable(name: "EfiRuntimeServicesData", scope: !2, file: !14, line: 70, type: !398, isLocal: true, isDefinition: true)
!398 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!399 = !DIGlobalVariableExpression(var: !400, expr: !DIExpression(DW_OP_constu, 0, DW_OP_stack_value))
!400 = distinct !DIGlobalVariable(name: "EFI_NATIVE_INTERFACE", scope: !2, file: !40, line: 1148, type: !398, isLocal: true, isDefinition: true)
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression(DW_OP_constu, 5, DW_OP_stack_value))
!402 = distinct !DIGlobalVariable(name: "EfiRuntimeServicesCode", scope: !2, file: !14, line: 65, type: !398, isLocal: true, isDefinition: true)
!403 = !DIGlobalVariableExpression(var: !404, expr: !DIExpression(DW_OP_constu, 1, DW_OP_stack_value))
!404 = distinct !DIGlobalVariable(name: "MemoryProfileActionAllocatePages", scope: !2, file: !6, line: 63, type: !398, isLocal: true, isDefinition: true)
!405 = !DIGlobalVariableExpression(var: !406, expr: !DIExpression(DW_OP_constu, 3, DW_OP_stack_value))
!406 = distinct !DIGlobalVariable(name: "MemoryProfileActionAllocatePool", scope: !2, file: !6, line: 65, type: !398, isLocal: true, isDefinition: true)
!407 = !DIGlobalVariableExpression(var: !408, expr: !DIExpression(DW_OP_constu, 2, DW_OP_stack_value))
!408 = distinct !DIGlobalVariable(name: "MemoryProfileActionFreePages", scope: !2, file: !6, line: 64, type: !398, isLocal: true, isDefinition: true)
!409 = !DIGlobalVariableExpression(var: !410, expr: !DIExpression(DW_OP_constu, 2, DW_OP_stack_value))
!410 = distinct !DIGlobalVariable(name: "SmmPoolTypeMax", scope: !2, file: !252, line: 1279, type: !398, isLocal: true, isDefinition: true)
!411 = !DIGlobalVariableExpression(var: !412, expr: !DIExpression())
!412 = distinct !DIGlobalVariable(name: "mSmmActionString", scope: !2, file: !207, line: 2569, type: !413, isLocal: false, isDefinition: true)
!413 = !DICompositeType(tag: DW_TAG_array_type, baseType: !173, size: 320, elements: !414)
!414 = !{!415}
!415 = !DISubrange(count: 5)
!416 = !DIGlobalVariableExpression(var: !417, expr: !DIExpression())
!417 = distinct !DIGlobalVariable(name: "mExtActionString", scope: !2, file: !207, line: 2582, type: !418, isLocal: false, isDefinition: true)
!418 = !DICompositeType(tag: DW_TAG_array_type, baseType: !419, size: 2688, elements: !424)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "ACTION_STRING", file: !207, line: 2580, baseType: !420)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ACTION_STRING", file: !207, line: 2577, size: 128, elements: !421)
!421 = !{!422, !423}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "Action", scope: !420, file: !207, line: 2578, baseType: !272, size: 32)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "String", scope: !420, file: !207, line: 2579, baseType: !173, size: 64, offset: 64)
!424 = !{!425}
!425 = !DISubrange(count: 21)
!426 = !DIGlobalVariableExpression(var: !427, expr: !DIExpression())
!427 = distinct !DIGlobalVariable(name: "mMemoryTypeString", scope: !2, file: !207, line: 2611, type: !428, isLocal: false, isDefinition: true)
!428 = !DICompositeType(tag: DW_TAG_array_type, baseType: !429, size: 256, elements: !189)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "PROFILE_MEMORY_TYPE_STRING", file: !207, line: 2609, baseType: !430)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PROFILE_MEMORY_TYPE_STRING", file: !207, line: 2606, size: 128, elements: !431)
!431 = !{!432, !433}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "MemoryType", scope: !430, file: !207, line: 2607, baseType: !274, size: 32)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "MemoryTypeStr", scope: !430, file: !207, line: 2608, baseType: !173, size: 64, offset: 64)
!434 = !DIGlobalVariableExpression(var: !435, expr: !DIExpression())
!435 = distinct !DIGlobalVariable(name: "mSmramReadyToLock", scope: !2, file: !207, line: 74, type: !61, isLocal: false, isDefinition: true)
!436 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression())
!437 = distinct !DIGlobalVariable(name: "mSmramProfileDriverPath", scope: !2, file: !207, line: 77, type: !204, isLocal: false, isDefinition: true)
!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(name: "mSmramProfileDriverPathSize", scope: !2, file: !207, line: 78, type: !157, isLocal: false, isDefinition: true)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "MEMORY_PROFILE_FREE_MEMORY", file: !6, line: 170, baseType: !441)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MEMORY_PROFILE_FREE_MEMORY", file: !6, line: 164, size: 192, elements: !442)
!442 = !{!443, !444, !445, !446}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "Header", scope: !441, file: !6, line: 165, baseType: !216, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "TotalFreeMemoryPages", scope: !441, file: !6, line: 166, baseType: !158, size: 64, offset: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "FreeMemoryEntryCount", scope: !441, file: !6, line: 167, baseType: !96, size: 32, offset: 128)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved", scope: !441, file: !6, line: 168, baseType: !447, size: 32, offset: 160)
!447 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 32, elements: !87)
!448 = !{i32 2, !"CodeView", i32 1}
!449 = !{i32 2, !"Debug Info Version", i32 3}
!450 = !{i32 1, !"wchar_size", i32 2}
!451 = !{i32 7, !"PIC Level", i32 2}
!452 = !{i32 1, !"Code Model", i32 1}
!453 = !{i32 7, !"uwtable", i32 1}
!454 = !{i32 1, !"ThinLTO", i32 0}
!455 = !{i32 1, !"EnableSplitLTOUnit", i32 1}
!456 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!457 = distinct !DISubprogram(name: "SmramProfileProtocolGetData", scope: !207, file: !207, line: 1937, type: !458, scopeLine: 1942, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !461)
!458 = !DISubroutineType(types: !459)
!459 = !{!367, !460, !369, !60}
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!461 = !{}
!462 = !DILocalVariable(name: "This", arg: 1, scope: !457, file: !207, line: 1938, type: !460)
!463 = !DILocation(line: 1938, scope: !457)
!464 = !DILocalVariable(name: "ProfileSize", arg: 2, scope: !457, file: !207, line: 1939, type: !369)
!465 = !DILocation(line: 1939, scope: !457)
!466 = !DILocalVariable(name: "ProfileBuffer", arg: 3, scope: !457, file: !207, line: 1940, type: !60)
!467 = !DILocation(line: 1940, scope: !457)
!468 = !DILocalVariable(name: "Size", scope: !457, file: !207, line: 1943, type: !158)
!469 = !DILocation(line: 1943, scope: !457)
!470 = !DILocalVariable(name: "Offset", scope: !457, file: !207, line: 1944, type: !158)
!471 = !DILocation(line: 1944, scope: !457)
!472 = !DILocalVariable(name: "ContextData", scope: !457, file: !207, line: 1945, type: !351)
!473 = !DILocation(line: 1945, scope: !457)
!474 = !DILocalVariable(name: "SmramProfileGettingStatus", scope: !457, file: !207, line: 1946, type: !61)
!475 = !DILocation(line: 1946, scope: !457)
!476 = !DILocation(line: 1948, scope: !457)
!477 = !DILocation(line: 1949, scope: !457)
!478 = !DILocation(line: 1950, scope: !479)
!479 = distinct !DILexicalBlock(scope: !480, file: !207, line: 1949)
!480 = distinct !DILexicalBlock(scope: !457, file: !207, line: 1949)
!481 = !DILocation(line: 1953, scope: !457)
!482 = !DILocation(line: 1954, scope: !457)
!483 = !DILocation(line: 1956, scope: !457)
!484 = !DILocation(line: 1958, scope: !457)
!485 = !DILocation(line: 1959, scope: !486)
!486 = distinct !DILexicalBlock(scope: !487, file: !207, line: 1958)
!487 = distinct !DILexicalBlock(scope: !457, file: !207, line: 1958)
!488 = !DILocation(line: 1960, scope: !486)
!489 = !DILocation(line: 1961, scope: !486)
!490 = !DILocation(line: 1964, scope: !457)
!491 = !DILocation(line: 1965, scope: !457)
!492 = !DILocation(line: 1966, scope: !457)
!493 = !DILocation(line: 1968, scope: !457)
!494 = !DILocation(line: 1969, scope: !457)
!495 = !DILocation(line: 1970, scope: !457)
!496 = distinct !DISubprogram(name: "SmramProfileProtocolRegisterImage", scope: !207, file: !207, line: 1989, type: !497, scopeLine: 1996, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !461)
!497 = !DISubroutineType(types: !498)
!498 = !{!367, !460, !204, !166, !158, !228}
!499 = !DILocalVariable(name: "This", arg: 1, scope: !496, file: !207, line: 1990, type: !460)
!500 = !DILocation(line: 1990, scope: !496)
!501 = !DILocalVariable(name: "FilePath", arg: 2, scope: !496, file: !207, line: 1991, type: !204)
!502 = !DILocation(line: 1991, scope: !496)
!503 = !DILocalVariable(name: "ImageBase", arg: 3, scope: !496, file: !207, line: 1992, type: !166)
!504 = !DILocation(line: 1992, scope: !496)
!505 = !DILocalVariable(name: "ImageSize", arg: 4, scope: !496, file: !207, line: 1993, type: !158)
!506 = !DILocation(line: 1993, scope: !496)
!507 = !DILocalVariable(name: "FileType", arg: 5, scope: !496, file: !207, line: 1994, type: !228)
!508 = !DILocation(line: 1994, scope: !496)
!509 = !DILocalVariable(name: "Status", scope: !496, file: !207, line: 1997, type: !367)
!510 = !DILocation(line: 1997, scope: !496)
!511 = !DILocalVariable(name: "DriverEntry", scope: !496, file: !207, line: 1998, type: !512)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SMM_DRIVER_ENTRY", file: !252, line: 142, baseType: !513)
!513 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_SMM_DRIVER_ENTRY", file: !252, line: 103, size: 2112, elements: !514)
!514 = !{!515, !516, !517, !518, !520, !521, !522, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !1093, !1094, !1095, !1096, !1097}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", scope: !513, file: !252, line: 104, baseType: !157, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "Link", scope: !513, file: !252, line: 105, baseType: !168, size: 128, offset: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "ScheduledLink", scope: !513, file: !252, line: 107, baseType: !168, size: 128, offset: 192)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "FvHandle", scope: !513, file: !252, line: 109, baseType: !519, size: 64, offset: 320)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_HANDLE", file: !193, line: 33, baseType: !60)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "FileName", scope: !513, file: !252, line: 110, baseType: !192, size: 128, offset: 384)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "FvFileDevicePath", scope: !513, file: !252, line: 111, baseType: !204, size: 64, offset: 512)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "Fv", scope: !513, file: !252, line: 112, baseType: !523, size: 64, offset: 576)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FIRMWARE_VOLUME2_PROTOCOL", file: !525, line: 22, baseType: !526)
!525 = !DIFile(filename: "MdePkg/Include/Protocol/FirmwareVolume2.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "e17565cad68c5de540c8e91ee2a96221")
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_FIRMWARE_VOLUME2_PROTOCOL", file: !525, line: 722, size: 640, elements: !527)
!527 = !{!528, !537, !539, !552, !558, !574, !579, !580, !581, !586}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "GetVolumeAttributes", scope: !526, file: !525, line: 723, baseType: !529, size: 64)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FV_GET_ATTRIBUTES", file: !525, line: 106, baseType: !530)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DISubroutineType(types: !532)
!532 = !{!367, !533, !535}
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !524)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FV_ATTRIBUTES", file: !525, line: 27, baseType: !158)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "SetVolumeAttributes", scope: !526, file: !525, line: 724, baseType: !538, size: 64, offset: 64)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FV_SET_ATTRIBUTES", file: !525, line: 200, baseType: !530)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "ReadFile", scope: !526, file: !525, line: 725, baseType: !540, size: 64, offset: 128)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FV_READ_FILE", file: !525, line: 294, baseType: !541)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DISubroutineType(types: !543)
!543 = !{!367, !533, !544, !162, !546, !547, !548, !551}
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !192)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FV_FILE_ATTRIBUTES", file: !550, line: 18, baseType: !96)
!550 = !DIFile(filename: "MdePkg/Include/Pi/PiFirmwareVolume.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "9a02bea8b9edc1b887ae684c8d405b44")
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "ReadSection", scope: !526, file: !525, line: 726, baseType: !553, size: 64, offset: 192)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FV_READ_SECTION", file: !525, line: 400, baseType: !554)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = !DISubroutineType(types: !556)
!556 = !{!367, !533, !544, !557, !157, !162, !546, !551}
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SECTION_TYPE", file: !229, line: 193, baseType: !119)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "WriteFile", scope: !526, file: !525, line: 727, baseType: !559, size: 64, offset: 256)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FV_WRITE_FILE", file: !525, line: 511, baseType: !560)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DISubroutineType(types: !562)
!562 = !{!367, !533, !96, !563, !564}
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FV_WRITE_POLICY", file: !525, line: 413, baseType: !96)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FV_WRITE_FILE_DATA", file: !525, line: 441, baseType: !566)
!566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_FV_WRITE_FILE_DATA", file: !525, line: 420, size: 256, elements: !567)
!567 = !{!568, !570, !571, !572, !573}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "NameGuid", scope: !566, file: !525, line: 424, baseType: !569, size: 64)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !566, file: !525, line: 428, baseType: !228, size: 8, offset: 64)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "FileAttributes", scope: !566, file: !525, line: 432, baseType: !549, size: 32, offset: 96)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "Buffer", scope: !566, file: !525, line: 436, baseType: !60, size: 64, offset: 128)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "BufferSize", scope: !566, file: !525, line: 440, baseType: !96, size: 32, offset: 192)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "GetNextFile", scope: !526, file: !525, line: 728, baseType: !575, size: 64, offset: 320)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FV_GET_NEXT_FILE", file: !525, line: 595, baseType: !576)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DISubroutineType(types: !578)
!578 = !{!367, !533, !60, !547, !569, !548, !546}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "KeySize", scope: !526, file: !525, line: 735, baseType: !96, size: 32, offset: 384)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "ParentHandle", scope: !526, file: !525, line: 740, baseType: !519, size: 64, offset: 448)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "GetInfo", scope: !526, file: !525, line: 741, baseType: !582, size: 64, offset: 512)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FV_GET_INFO", file: !525, line: 653, baseType: !583)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DISubroutineType(types: !585)
!585 = !{!367, !533, !544, !546, !60}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "SetInfo", scope: !526, file: !525, line: 742, baseType: !587, size: 64, offset: 576)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FV_SET_INFO", file: !525, line: 702, baseType: !588)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DISubroutineType(types: !590)
!590 = !{!367, !533, !544, !157, !591}
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "Depex", scope: !513, file: !252, line: 114, baseType: !60, size: 64, offset: 640)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "DepexSize", scope: !513, file: !252, line: 115, baseType: !157, size: 64, offset: 704)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "Before", scope: !513, file: !252, line: 117, baseType: !61, size: 8, offset: 768)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "After", scope: !513, file: !252, line: 118, baseType: !61, size: 8, offset: 776)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "BeforeAfterGuid", scope: !513, file: !252, line: 119, baseType: !192, size: 128, offset: 800)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "Dependent", scope: !513, file: !252, line: 121, baseType: !61, size: 8, offset: 928)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "Scheduled", scope: !513, file: !252, line: 122, baseType: !61, size: 8, offset: 936)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "Initialized", scope: !513, file: !252, line: 123, baseType: !61, size: 8, offset: 944)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "DepexProtocolError", scope: !513, file: !252, line: 124, baseType: !61, size: 8, offset: 952)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "ImageHandle", scope: !513, file: !252, line: 126, baseType: !519, size: 64, offset: 960)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "LoadedImage", scope: !513, file: !252, line: 127, baseType: !604, size: 64, offset: 1024)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_LOADED_IMAGE_PROTOCOL", file: !606, line: 72, baseType: !607)
!606 = !DIFile(filename: "MdePkg/Include/Protocol/LoadedImage.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "0bfc90f5c05009801c3af3d54bff9caa")
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_LOADED_IMAGE_PROTOCOL", file: !606, line: 43, size: 768, elements: !608)
!608 = !{!609, !610, !611, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "Revision", scope: !607, file: !606, line: 44, baseType: !96, size: 32)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "ParentHandle", scope: !607, file: !606, line: 46, baseType: !519, size: 64, offset: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "SystemTable", scope: !607, file: !606, line: 48, baseType: !612, size: 64, offset: 128)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SYSTEM_TABLE", file: !40, line: 2038, baseType: !614)
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_SYSTEM_TABLE", file: !40, line: 1977, size: 960, elements: !615)
!615 = !{!616, !625, !628, !629, !630, !654, !655, !709, !710, !711, !833, !1075, !1076}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "Hdr", scope: !614, file: !40, line: 1981, baseType: !617, size: 192)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TABLE_HEADER", file: !14, line: 177, baseType: !618)
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_TABLE_HEADER", file: !14, line: 150, size: 192, elements: !619)
!619 = !{!620, !621, !622, !623, !624}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", scope: !618, file: !14, line: 156, baseType: !158, size: 64)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "Revision", scope: !618, file: !14, line: 163, baseType: !96, size: 32, offset: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "HeaderSize", scope: !618, file: !14, line: 167, baseType: !96, size: 32, offset: 96)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "CRC32", scope: !618, file: !14, line: 172, baseType: !96, size: 32, offset: 128)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved", scope: !618, file: !14, line: 176, baseType: !96, size: 32, offset: 160)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "FirmwareVendor", scope: !614, file: !40, line: 1986, baseType: !626, size: 64, offset: 192)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHAR16", file: !62, line: 183, baseType: !71)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "FirmwareRevision", scope: !614, file: !40, line: 1991, baseType: !96, size: 32, offset: 256)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "ConsoleInHandle", scope: !614, file: !40, line: 1996, baseType: !519, size: 64, offset: 320)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "ConIn", scope: !614, file: !40, line: 2001, baseType: !631, size: 64, offset: 384)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_TEXT_INPUT_PROTOCOL", file: !633, line: 20, baseType: !634)
!633 = !DIFile(filename: "MdePkg/Include/Protocol/SimpleTextIn.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "239cf4f3dddb25a8596c70fa738413fd")
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_SIMPLE_TEXT_INPUT_PROTOCOL", file: !633, line: 116, size: 192, elements: !635)
!635 = !{!636, !641, !652}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "Reset", scope: !634, file: !633, line: 117, baseType: !637, size: 64)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_INPUT_RESET", file: !633, line: 86, baseType: !638)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DISubroutineType(types: !640)
!640 = !{!367, !631, !61}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "ReadKeyStroke", scope: !634, file: !633, line: 118, baseType: !642, size: 64, offset: 64)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_INPUT_READ_KEY", file: !633, line: 107, baseType: !643)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DISubroutineType(types: !645)
!645 = !{!367, !631, !646}
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_INPUT_KEY", file: !633, line: 38, baseType: !648)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_INPUT_KEY", file: !633, line: 35, size: 32, elements: !649)
!649 = !{!650, !651}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "ScanCode", scope: !648, file: !633, line: 36, baseType: !70, size: 16)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "UnicodeChar", scope: !648, file: !633, line: 37, baseType: !627, size: 16, offset: 16)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "WaitForKey", scope: !634, file: !633, line: 122, baseType: !653, size: 64, offset: 128)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_EVENT", file: !193, line: 37, baseType: !60)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "ConsoleOutHandle", scope: !614, file: !40, line: 2005, baseType: !519, size: 64, offset: 448)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "ConOut", scope: !614, file: !40, line: 2010, baseType: !656, size: 64, offset: 512)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_TEXT_OUTPUT_PROTOCOL", file: !658, line: 27, baseType: !659)
!658 = !DIFile(filename: "MdePkg/Include/Protocol/SimpleTextOut.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "685bec042927ad46d31bf42ae7f6ddcd")
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_SIMPLE_TEXT_OUTPUT_PROTOCOL", file: !658, line: 387, size: 640, elements: !660)
!660 = !{!661, !666, !671, !673, !678, !683, !685, !690, !695, !697}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "Reset", scope: !659, file: !658, line: 388, baseType: !662, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TEXT_RESET", file: !658, line: 167, baseType: !663)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DISubroutineType(types: !665)
!665 = !{!367, !656, !61}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "OutputString", scope: !659, file: !658, line: 390, baseType: !667, size: 64, offset: 64)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TEXT_STRING", file: !658, line: 192, baseType: !668)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = !DISubroutineType(types: !670)
!670 = !{!367, !656, !626}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "TestString", scope: !659, file: !658, line: 391, baseType: !672, size: 64, offset: 128)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TEXT_TEST_STRING", file: !658, line: 213, baseType: !668)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "QueryMode", scope: !659, file: !658, line: 393, baseType: !674, size: 64, offset: 192)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TEXT_QUERY_MODE", file: !658, line: 236, baseType: !675)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = !DISubroutineType(types: !677)
!677 = !{!367, !656, !157, !546, !546}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "SetMode", scope: !659, file: !658, line: 394, baseType: !679, size: 64, offset: 256)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TEXT_SET_MODE", file: !658, line: 256, baseType: !680)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = !DISubroutineType(types: !682)
!682 = !{!367, !656, !157}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "SetAttribute", scope: !659, file: !658, line: 395, baseType: !684, size: 64, offset: 320)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TEXT_SET_ATTRIBUTE", file: !658, line: 277, baseType: !680)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "ClearScreen", scope: !659, file: !658, line: 397, baseType: !686, size: 64, offset: 384)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TEXT_CLEAR_SCREEN", file: !658, line: 295, baseType: !687)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DISubroutineType(types: !689)
!689 = !{!367, !656}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "SetCursorPosition", scope: !659, file: !658, line: 398, baseType: !691, size: 64, offset: 448)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TEXT_SET_CURSOR_POSITION", file: !658, line: 318, baseType: !692)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DISubroutineType(types: !694)
!694 = !{!367, !656, !157, !157}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "EnableCursor", scope: !659, file: !658, line: 399, baseType: !696, size: 64, offset: 512)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TEXT_ENABLE_CURSOR", file: !658, line: 340, baseType: !663)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "Mode", scope: !659, file: !658, line: 404, baseType: !698, size: 64, offset: 576)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_TEXT_OUTPUT_MODE", file: !658, line: 379, baseType: !700)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_SIMPLE_TEXT_OUTPUT_MODE", file: !658, line: 349, size: 192, elements: !701)
!701 = !{!702, !704, !705, !706, !707, !708}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "MaxMode", scope: !700, file: !658, line: 353, baseType: !703, size: 32)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT32", file: !62, line: 174, baseType: !398)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "Mode", scope: !700, file: !658, line: 362, baseType: !703, size: 32, offset: 32)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "Attribute", scope: !700, file: !658, line: 366, baseType: !703, size: 32, offset: 64)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "CursorColumn", scope: !700, file: !658, line: 370, baseType: !703, size: 32, offset: 96)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "CursorRow", scope: !700, file: !658, line: 374, baseType: !703, size: 32, offset: 128)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "CursorVisible", scope: !700, file: !658, line: 378, baseType: !61, size: 8, offset: 160)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "StandardErrorHandle", scope: !614, file: !40, line: 2015, baseType: !519, size: 64, offset: 576)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "StdErr", scope: !614, file: !40, line: 2020, baseType: !656, size: 64, offset: 640)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "RuntimeServices", scope: !614, file: !40, line: 2024, baseType: !712, size: 64, offset: 704)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_RUNTIME_SERVICES", file: !40, line: 1856, baseType: !714)
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_RUNTIME_SERVICES", file: !40, line: 1813, size: 1088, elements: !715)
!715 = !{!716, !717, !746, !751, !756, !761, !777, !782, !787, !792, !797, !802, !808, !822, !828}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "Hdr", scope: !714, file: !40, line: 1817, baseType: !617, size: 192)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "GetTime", scope: !714, file: !40, line: 1822, baseType: !718, size: 64, offset: 192)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GET_TIME", file: !40, line: 801, baseType: !719)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = !DISubroutineType(types: !721)
!721 = !{!367, !722, !739}
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TIME", file: !193, line: 80, baseType: !724)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_TIME", file: !193, line: 68, size: 128, elements: !725)
!725 = !{!726, !727, !728, !729, !730, !731, !732, !733, !734, !737, !738}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "Year", scope: !724, file: !193, line: 69, baseType: !70, size: 16)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "Month", scope: !724, file: !193, line: 70, baseType: !119, size: 8, offset: 16)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "Day", scope: !724, file: !193, line: 71, baseType: !119, size: 8, offset: 24)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "Hour", scope: !724, file: !193, line: 72, baseType: !119, size: 8, offset: 32)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "Minute", scope: !724, file: !193, line: 73, baseType: !119, size: 8, offset: 40)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "Second", scope: !724, file: !193, line: 74, baseType: !119, size: 8, offset: 48)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "Pad1", scope: !724, file: !193, line: 75, baseType: !119, size: 8, offset: 56)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "Nanosecond", scope: !724, file: !193, line: 76, baseType: !96, size: 32, offset: 64)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "TimeZone", scope: !724, file: !193, line: 77, baseType: !735, size: 16, offset: 96)
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT16", file: !62, line: 187, baseType: !736)
!736 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "Daylight", scope: !724, file: !193, line: 78, baseType: !119, size: 8, offset: 112)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "Pad2", scope: !724, file: !193, line: 79, baseType: !119, size: 8, offset: 120)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TIME_CAPABILITIES", file: !40, line: 784, baseType: !741)
!741 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_TIME_CAPABILITIES", file: !40, line: 761, size: 96, elements: !742)
!742 = !{!743, !744, !745}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "Resolution", scope: !741, file: !40, line: 768, baseType: !96, size: 32)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "Accuracy", scope: !741, file: !40, line: 775, baseType: !96, size: 32, offset: 32)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "SetsToZero", scope: !741, file: !40, line: 783, baseType: !61, size: 8, offset: 64)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "SetTime", scope: !714, file: !40, line: 1823, baseType: !747, size: 64, offset: 256)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SET_TIME", file: !40, line: 818, baseType: !748)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DISubroutineType(types: !750)
!750 = !{!367, !722}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "GetWakeupTime", scope: !714, file: !40, line: 1824, baseType: !752, size: 64, offset: 320)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GET_WAKEUP_TIME", file: !40, line: 839, baseType: !753)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DISubroutineType(types: !755)
!755 = !{!367, !385, !385, !722}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "SetWakeupTime", scope: !714, file: !40, line: 1825, baseType: !757, size: 64, offset: 384)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SET_WAKEUP_TIME", file: !40, line: 861, baseType: !758)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = !DISubroutineType(types: !760)
!760 = !{!367, !61, !722}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "SetVirtualAddressMap", scope: !714, file: !40, line: 1830, baseType: !762, size: 64, offset: 448)
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SET_VIRTUAL_ADDRESS_MAP", file: !40, line: 312, baseType: !763)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DISubroutineType(types: !765)
!765 = !{!367, !157, !157, !96, !766}
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MEMORY_DESCRIPTOR", file: !40, line: 160, baseType: !768)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_MEMORY_DESCRIPTOR", file: !40, line: 128, size: 320, elements: !769)
!769 = !{!770, !771, !773, !775, !776}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !768, file: !40, line: 134, baseType: !96, size: 32)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "PhysicalStart", scope: !768, file: !40, line: 140, baseType: !772, size: 64, offset: 64)
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_PHYSICAL_ADDRESS", file: !193, line: 50, baseType: !158)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "VirtualStart", scope: !768, file: !40, line: 146, baseType: !774, size: 64, offset: 128)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_VIRTUAL_ADDRESS", file: !193, line: 55, baseType: !158)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "NumberOfPages", scope: !768, file: !40, line: 153, baseType: !158, size: 64, offset: 192)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "Attribute", scope: !768, file: !40, line: 159, baseType: !158, size: 64, offset: 256)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "ConvertPointer", scope: !714, file: !40, line: 1831, baseType: !778, size: 64, offset: 512)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CONVERT_POINTER", file: !40, line: 407, baseType: !779)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = !DISubroutineType(types: !781)
!781 = !{!367, !157, !162}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "GetVariable", scope: !714, file: !40, line: 1836, baseType: !783, size: 64, offset: 576)
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GET_VARIABLE", file: !40, line: 671, baseType: !784)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DISubroutineType(types: !786)
!786 = !{!367, !626, !569, !551, !546, !60}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "GetNextVariableName", scope: !714, file: !40, line: 1837, baseType: !788, size: 64, offset: 640)
!788 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GET_NEXT_VARIABLE_NAME", file: !40, line: 707, baseType: !789)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = !DISubroutineType(types: !791)
!791 = !{!367, !546, !626, !569}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "SetVariable", scope: !714, file: !40, line: 1838, baseType: !793, size: 64, offset: 704)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SET_VARIABLE", file: !40, line: 749, baseType: !794)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = !DISubroutineType(types: !796)
!796 = !{!367, !626, !569, !96, !157, !60}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "GetNextHighMonotonicCount", scope: !714, file: !40, line: 1843, baseType: !798, size: 64, offset: 768)
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GET_NEXT_HIGH_MONO_COUNT", file: !40, line: 1082, baseType: !799)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DISubroutineType(types: !801)
!801 = !{!367, !551}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "ResetSystem", scope: !714, file: !40, line: 1844, baseType: !803, size: 64, offset: 832)
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_RESET_SYSTEM", file: !40, line: 1047, baseType: !804)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DISubroutineType(types: !806)
!806 = !{null, !807, !367, !157, !60}
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_RESET_TYPE", file: !14, line: 145, baseType: !33)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "UpdateCapsule", scope: !714, file: !40, line: 1849, baseType: !809, size: 64, offset: 896)
!809 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_UPDATE_CAPSULE", file: !40, line: 1708, baseType: !810)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!811 = !DISubroutineType(types: !812)
!812 = !{!367, !813, !157, !772}
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CAPSULE_HEADER", file: !40, line: 1654, baseType: !816)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_CAPSULE_HEADER", file: !40, line: 1633, size: 224, elements: !817)
!817 = !{!818, !819, !820, !821}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "CapsuleGuid", scope: !816, file: !40, line: 1637, baseType: !192, size: 128)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "HeaderSize", scope: !816, file: !40, line: 1643, baseType: !96, size: 32, offset: 128)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !816, file: !40, line: 1649, baseType: !96, size: 32, offset: 160)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "CapsuleImageSize", scope: !816, file: !40, line: 1653, baseType: !96, size: 32, offset: 192)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "QueryCapsuleCapabilities", scope: !714, file: !40, line: 1850, baseType: !823, size: 64, offset: 960)
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_QUERY_CAPSULE_CAPABILITIES", file: !40, line: 1739, baseType: !824)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = !DISubroutineType(types: !826)
!826 = !{!367, !813, !157, !369, !827}
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "QueryVariableInfo", scope: !714, file: !40, line: 1855, baseType: !829, size: 64, offset: 1024)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_QUERY_VARIABLE_INFO", file: !40, line: 1770, baseType: !830)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = !DISubroutineType(types: !832)
!832 = !{!367, !96, !369, !369, !369}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "BootServices", scope: !614, file: !40, line: 2028, baseType: !834, size: 64, offset: 768)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_BOOT_SERVICES", file: !40, line: 1957, baseType: !836)
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_BOOT_SERVICES", file: !40, line: 1864, size: 3008, elements: !837)
!837 = !{!838, !839, !845, !850, !857, !862, !867, !872, !877, !887, !893, !898, !903, !905, !907, !914, !919, !924, !929, !930, !935, !941, !947, !952, !957, !963, !968, !973, !978, !983, !988, !993, !998, !1003, !1008, !1013, !1027, !1034, !1040, !1045, !1050, !1055, !1060, !1065, !1070}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "Hdr", scope: !836, file: !40, line: 1868, baseType: !617, size: 192)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "RaiseTPL", scope: !836, file: !40, line: 1873, baseType: !840, size: 64, offset: 192)
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_RAISE_TPL", file: !40, line: 629, baseType: !841)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!842 = !DISubroutineType(types: !843)
!843 = !{!844, !844}
!844 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TPL", file: !193, line: 41, baseType: !157)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "RestoreTPL", scope: !836, file: !40, line: 1874, baseType: !846, size: 64, offset: 256)
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_RESTORE_TPL", file: !40, line: 641, baseType: !847)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = !DISubroutineType(types: !849)
!849 = !{null, !844}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "AllocatePages", scope: !836, file: !40, line: 1879, baseType: !851, size: 64, offset: 320)
!851 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_ALLOCATE_PAGES", file: !40, line: 188, baseType: !852)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = !DISubroutineType(types: !854)
!854 = !{!367, !855, !274, !157, !856}
!855 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_ALLOCATE_TYPE", file: !40, line: 47, baseType: !39)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "FreePages", scope: !836, file: !40, line: 1880, baseType: !858, size: 64, offset: 384)
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FREE_PAGES", file: !40, line: 209, baseType: !859)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = !DISubroutineType(types: !861)
!861 = !{!367, !772, !157}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "GetMemoryMap", scope: !836, file: !40, line: 1881, baseType: !863, size: 64, offset: 448)
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GET_MEMORY_MAP", file: !40, line: 241, baseType: !864)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = !DISubroutineType(types: !866)
!866 = !{!367, !546, !766, !546, !546, !551}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "AllocatePool", scope: !836, file: !40, line: 1882, baseType: !868, size: 64, offset: 512)
!868 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_ALLOCATE_POOL", file: !40, line: 270, baseType: !869)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!870 = !DISubroutineType(types: !871)
!871 = !{!367, !274, !157, !162}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "FreePool", scope: !836, file: !40, line: 1883, baseType: !873, size: 64, offset: 576)
!873 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FREE_POOL", file: !40, line: 287, baseType: !874)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!875 = !DISubroutineType(types: !876)
!876 = !{!367, !60}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "CreateEvent", scope: !836, file: !40, line: 1888, baseType: !878, size: 64, offset: 640)
!878 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CREATE_EVENT", file: !40, line: 465, baseType: !879)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!880 = !DISubroutineType(types: !881)
!881 = !{!367, !96, !844, !882, !60, !886}
!882 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_EVENT_NOTIFY", file: !40, line: 442, baseType: !883)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!884 = !DISubroutineType(types: !885)
!885 = !{null, !653, !60}
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "SetTimer", scope: !836, file: !40, line: 1889, baseType: !888, size: 64, offset: 704)
!888 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SET_TIMER", file: !40, line: 539, baseType: !889)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64)
!890 = !DISubroutineType(types: !891)
!891 = !{!367, !653, !892, !158}
!892 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TIMER_DELAY", file: !40, line: 519, baseType: !46)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "WaitForEvent", scope: !836, file: !40, line: 1890, baseType: !894, size: 64, offset: 768)
!894 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_WAIT_FOR_EVENT", file: !40, line: 575, baseType: !895)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = !DISubroutineType(types: !897)
!897 = !{!367, !157, !886, !546}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "SignalEvent", scope: !836, file: !40, line: 1891, baseType: !899, size: 64, offset: 832)
!899 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIGNAL_EVENT", file: !40, line: 555, baseType: !900)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64)
!901 = !DISubroutineType(types: !902)
!902 = !{!367, !653}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "CloseEvent", scope: !836, file: !40, line: 1892, baseType: !904, size: 64, offset: 896)
!904 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CLOSE_EVENT", file: !40, line: 591, baseType: !900)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "CheckEvent", scope: !836, file: !40, line: 1893, baseType: !906, size: 64, offset: 960)
!906 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CHECK_EVENT", file: !40, line: 607, baseType: !900)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "InstallProtocolInterface", scope: !836, file: !40, line: 1898, baseType: !908, size: 64, offset: 1024)
!908 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_INSTALL_PROTOCOL_INTERFACE", file: !40, line: 1173, baseType: !909)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DISubroutineType(types: !911)
!911 = !{!367, !912, !569, !913, !60}
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!913 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_INTERFACE_TYPE", file: !40, line: 1149, baseType: !51)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "ReinstallProtocolInterface", scope: !836, file: !40, line: 1899, baseType: !915, size: 64, offset: 1088)
!915 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_REINSTALL_PROTOCOL_INTERFACE", file: !40, line: 1223, baseType: !916)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DISubroutineType(types: !918)
!918 = !{!367, !519, !569, !60, !60}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "UninstallProtocolInterface", scope: !836, file: !40, line: 1900, baseType: !920, size: 64, offset: 1152)
!920 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_UNINSTALL_PROTOCOL_INTERFACE", file: !40, line: 1249, baseType: !921)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = !DISubroutineType(types: !923)
!923 = !{!367, !519, !569, !60}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "HandleProtocol", scope: !836, file: !40, line: 1901, baseType: !925, size: 64, offset: 1216)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_HANDLE_PROTOCOL", file: !40, line: 1290, baseType: !926)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!927 = !DISubroutineType(types: !928)
!928 = !{!367, !519, !569, !162}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved", scope: !836, file: !40, line: 1902, baseType: !60, size: 64, offset: 1280)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "RegisterProtocolNotify", scope: !836, file: !40, line: 1903, baseType: !931, size: 64, offset: 1344)
!931 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_REGISTER_PROTOCOL_NOTIFY", file: !40, line: 1451, baseType: !932)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = !DISubroutineType(types: !934)
!934 = !{!367, !569, !653, !162}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "LocateHandle", scope: !836, file: !40, line: 1904, baseType: !936, size: 64, offset: 1408)
!936 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_LOCATE_HANDLE", file: !40, line: 1500, baseType: !937)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64)
!938 = !DISubroutineType(types: !939)
!939 = !{!367, !940, !569, !60, !546, !912}
!940 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_LOCATE_SEARCH_TYPE", file: !40, line: 1474, baseType: !54)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "LocateDevicePath", scope: !836, file: !40, line: 1905, baseType: !942, size: 64, offset: 1472)
!942 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_LOCATE_DEVICE_PATH", file: !40, line: 1526, baseType: !943)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64)
!944 = !DISubroutineType(types: !945)
!945 = !{!367, !569, !946, !912}
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "InstallConfigurationTable", scope: !836, file: !40, line: 1906, baseType: !948, size: 64, offset: 1536)
!948 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_INSTALL_CONFIGURATION_TABLE", file: !40, line: 1547, baseType: !949)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = !DISubroutineType(types: !951)
!951 = !{!367, !569, !60}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "LoadImage", scope: !836, file: !40, line: 1911, baseType: !953, size: 64, offset: 1600)
!953 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IMAGE_LOAD", file: !40, line: 898, baseType: !954)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!955 = !DISubroutineType(types: !956)
!956 = !{!367, !61, !519, !204, !60, !157, !912}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "StartImage", scope: !836, file: !40, line: 1912, baseType: !958, size: 64, offset: 1664)
!958 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IMAGE_START", file: !40, line: 923, baseType: !959)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64)
!960 = !DISubroutineType(types: !961)
!961 = !{!367, !519, !546, !962}
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "Exit", scope: !836, file: !40, line: 1913, baseType: !964, size: 64, offset: 1728)
!964 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_EXIT", file: !40, line: 951, baseType: !965)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = !DISubroutineType(types: !967)
!967 = !{!367, !519, !367, !157, !626}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "UnloadImage", scope: !836, file: !40, line: 1914, baseType: !969, size: 64, offset: 1792)
!969 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IMAGE_UNLOAD", file: !40, line: 969, baseType: !970)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64)
!971 = !DISubroutineType(types: !972)
!972 = !{!367, !519}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "ExitBootServices", scope: !836, file: !40, line: 1915, baseType: !974, size: 64, offset: 1856)
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_EXIT_BOOT_SERVICES", file: !40, line: 985, baseType: !975)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64)
!976 = !DISubroutineType(types: !977)
!977 = !{!367, !519, !157}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "GetNextMonotonicCount", scope: !836, file: !40, line: 1920, baseType: !979, size: 64, offset: 1920)
!979 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GET_NEXT_MONOTONIC_COUNT", file: !40, line: 1066, baseType: !980)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64)
!981 = !DISubroutineType(types: !982)
!982 = !{!367, !369}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "Stall", scope: !836, file: !40, line: 1921, baseType: !984, size: 64, offset: 1984)
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_STALL", file: !40, line: 1001, baseType: !985)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64)
!986 = !DISubroutineType(types: !987)
!987 = !{!367, !157}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "SetWatchdogTimer", scope: !836, file: !40, line: 1922, baseType: !989, size: 64, offset: 2048)
!989 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SET_WATCHDOG_TIMER", file: !40, line: 1023, baseType: !990)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64)
!991 = !DISubroutineType(types: !992)
!992 = !{!367, !157, !158, !157, !626}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "ConnectController", scope: !836, file: !40, line: 1927, baseType: !994, size: 64, offset: 2112)
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CONNECT_CONTROLLER", file: !40, line: 346, baseType: !995)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64)
!996 = !DISubroutineType(types: !997)
!997 = !{!367, !519, !912, !204, !61}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "DisconnectController", scope: !836, file: !40, line: 1928, baseType: !999, size: 64, offset: 2176)
!999 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DISCONNECT_CONTROLLER", file: !40, line: 379, baseType: !1000)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{!367, !519, !519, !519}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "OpenProtocol", scope: !836, file: !40, line: 1933, baseType: !1004, size: 64, offset: 2240)
!1004 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_OPEN_PROTOCOL", file: !40, line: 1332, baseType: !1005)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64)
!1006 = !DISubroutineType(types: !1007)
!1007 = !{!367, !519, !569, !162, !519, !519, !96}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "CloseProtocol", scope: !836, file: !40, line: 1934, baseType: !1009, size: 64, offset: 2304)
!1009 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CLOSE_PROTOCOL", file: !40, line: 1364, baseType: !1010)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64)
!1011 = !DISubroutineType(types: !1012)
!1012 = !{!367, !519, !569, !519, !519}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "OpenProtocolInformation", scope: !836, file: !40, line: 1935, baseType: !1014, size: 64, offset: 2368)
!1014 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_OPEN_PROTOCOL_INFORMATION", file: !40, line: 1398, baseType: !1015)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64)
!1016 = !DISubroutineType(types: !1017)
!1017 = !{!367, !519, !569, !1018, !546}
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64)
!1020 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_OPEN_PROTOCOL_INFORMATION_ENTRY", file: !40, line: 1379, baseType: !1021)
