; ModuleID = 'Tcg2Smm.bc'
source_filename = "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main/SecurityPkg/Tcg/Tcg2Smm/Tcg2Smm.c"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-windows-gnu"

%struct._EFI_SMM_VARIABLE_PROTOCOL = type { i64 (i16*, %struct.GUID*, i32*, i64*, i8*)*, i64 (i64*, i16*, %struct.GUID*)*, i64 (i16*, %struct.GUID*, i32, i64, i8*)*, i64 (i32, i64*, i64*, i64*)* }
%struct.GUID = type { i32, i16, i16, [8 x i8] }
%struct.TCG_NVS = type <{ %struct.PHYSICAL_PRESENCE_NVS, %struct.MEMORY_CLEAR_NVS, i32, i32, i8 }>
%struct.PHYSICAL_PRESENCE_NVS = type <{ i8, i32, i32, i32, i32, i32, i32 }>
%struct.MEMORY_CLEAR_NVS = type <{ i8, i32, i32, i32 }>
%struct._EFI_MM_SYSTEM_TABLE = type { %struct.EFI_TABLE_HEADER, i16*, i32, i64 (%struct._EFI_MM_SYSTEM_TABLE*, %struct.GUID*, i8*, i64)*, %struct._EFI_MM_CPU_IO_PROTOCOL, i64 (i32, i64, i8**)*, i64 (i8*)*, i64 (i32, i32, i64, i64*)*, i64 (i64, i64)*, i64 (void (i8*)*, i64, i8*)*, i64, i64, i64*, i8**, i64, %struct.EFI_CONFIGURATION_TABLE*, i64 (i8**, %struct.GUID*, i32, i8*)*, i64 (i8*, %struct.GUID*, i8*)*, i64 (i8*, %struct.GUID*, i8**)*, i64 (%struct.GUID*, i64 (%struct.GUID*, i8*, i8*)*, i8**)*, i64 (i32, %struct.GUID*, i8*, i64*, i8**)*, i64 (%struct.GUID*, i8*, i8**)*, i64 (%struct.GUID*, i8*, i8*, i64*)*, i64 (i64 (i8*, i8*, i8*, i64*)*, %struct.GUID*, i8**)*, i64 (i8*)* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "mSmmVariable", scope: !2, file: !62, line: 20, type: !70, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !4, globals: !59, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main/SecurityPkg/Tcg/Tcg2Smm/Tcg2Smm.c", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main/Build/SecurityPkg/NOOPT_CLANGPDB/X64/SecurityPkg/Tcg/Tcg2Smm/Tcg2Smm", checksumkind: CSK_MD5, checksum: "1a276b4e71bc78264df8aced65cda53c")
!4 = !{!5, !8, !9, !11, !14, !26, !12, !35, !55, !58}
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "BOOLEAN", file: !6, line: 192, baseType: !7)
!6 = !DIFile(filename: "MdePkg/Include/X64/ProcessorBind.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "ef2524a221fe61206fa09ec88dd4f59b")
!7 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "RETURN_STATUS", file: !10, line: 1026, baseType: !11)
!10 = !DIFile(filename: "MdePkg/Include/Base.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "0c11ea3d1992443d8a8f590a064e50ff")
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINTN", file: !6, line: 211, baseType: !12)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT64", file: !6, line: 162, baseType: !13)
!13 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "TPM_NVS_MM_COMM_BUFFER", file: !16, line: 61, baseType: !17)
!16 = !DIFile(filename: "SecurityPkg/Include/Guid/TpmNvsMm.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "cf84fb851736e8ea1240af81320d78ef")
!17 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TPM_NVS_MM_COMM_BUFFER", file: !16, line: 55, size: 320, elements: !18)
!18 = !{!19, !20, !21, !24, !25}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !17, file: !16, line: 56, baseType: !12, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "ReturnStatus", scope: !17, file: !16, line: 57, baseType: !12, size: 64, offset: 64)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "TargetAddress", scope: !17, file: !16, line: 58, baseType: !22, size: 64, offset: 128)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_PHYSICAL_ADDRESS", file: !23, line: 50, baseType: !12)
!23 = !DIFile(filename: "MdePkg/Include/Uefi/UefiBaseType.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "dbec48e65949dff122bc920c9d9d9c6a")
!24 = !DIDerivedType(tag: DW_TAG_member, name: "RegisteredPpSwiValue", scope: !17, file: !16, line: 59, baseType: !12, size: 64, offset: 192)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "RegisteredMcSwiValue", scope: !17, file: !16, line: 60, baseType: !12, size: 64, offset: 256)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "TCG_NVS", file: !16, line: 43, baseType: !28)
!28 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TCG_NVS", file: !16, line: 37, size: 376, elements: !29)
!29 = !{!30, !44, !52, !53, !54}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "PhysicalPresence", scope: !28, file: !16, line: 38, baseType: !31, size: 200)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "PHYSICAL_PRESENCE_NVS", file: !16, line: 28, baseType: !32)
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PHYSICAL_PRESENCE_NVS", file: !16, line: 20, size: 200, elements: !33)
!33 = !{!34, !36, !39, !40, !41, !42, !43}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "SoftwareSmi", scope: !32, file: !16, line: 21, baseType: !35, size: 8)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT8", file: !6, line: 196, baseType: !7)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "Parameter", scope: !32, file: !16, line: 22, baseType: !37, size: 32, offset: 8)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT32", file: !6, line: 170, baseType: !38)
!38 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "Response", scope: !32, file: !16, line: 23, baseType: !37, size: 32, offset: 40)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "Request", scope: !32, file: !16, line: 24, baseType: !37, size: 32, offset: 72)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "RequestParameter", scope: !32, file: !16, line: 25, baseType: !37, size: 32, offset: 104)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "LastRequest", scope: !32, file: !16, line: 26, baseType: !37, size: 32, offset: 136)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "ReturnCode", scope: !32, file: !16, line: 27, baseType: !37, size: 32, offset: 168)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "MemoryClear", scope: !28, file: !16, line: 39, baseType: !45, size: 104, offset: 200)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "MEMORY_CLEAR_NVS", file: !16, line: 35, baseType: !46)
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MEMORY_CLEAR_NVS", file: !16, line: 30, size: 104, elements: !47)
!47 = !{!48, !49, !50, !51}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "SoftwareSmi", scope: !46, file: !16, line: 31, baseType: !35, size: 8)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "Parameter", scope: !46, file: !16, line: 32, baseType: !37, size: 32, offset: 8)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "Request", scope: !46, file: !16, line: 33, baseType: !37, size: 32, offset: 40)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "ReturnCode", scope: !46, file: !16, line: 34, baseType: !37, size: 32, offset: 72)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "PPRequestUserConfirm", scope: !28, file: !16, line: 40, baseType: !37, size: 32, offset: 304)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "TpmIrqNum", scope: !28, file: !16, line: 41, baseType: !37, size: 32, offset: 336)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "IsShortFormPkgLength", scope: !28, file: !16, line: 42, baseType: !5, size: 8, offset: 368)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTN", file: !6, line: 216, baseType: !56)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT64", file: !6, line: 166, baseType: !57)
!57 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!59 = !{!0, !60, !63, !65, !67}
!60 = !DIGlobalVariableExpression(var: !61, expr: !DIExpression())
!61 = distinct !DIGlobalVariable(name: "mTcgNvs", scope: !2, file: !62, line: 21, type: !26, isLocal: false, isDefinition: true)
!62 = !DIFile(filename: "SecurityPkg/Tcg/Tcg2Smm/Tcg2Smm.c", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "1a276b4e71bc78264df8aced65cda53c")
!63 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression())
!64 = distinct !DIGlobalVariable(name: "mPpSoftwareSmi", scope: !2, file: !62, line: 22, type: !11, isLocal: false, isDefinition: true)
!65 = !DIGlobalVariableExpression(var: !66, expr: !DIExpression())
!66 = distinct !DIGlobalVariable(name: "mMcSoftwareSmi", scope: !2, file: !62, line: 23, type: !11, isLocal: false, isDefinition: true)
!67 = !DIGlobalVariableExpression(var: !68, expr: !DIExpression())
!68 = distinct !DIGlobalVariable(name: "mReadyToLockHandle", scope: !2, file: !62, line: 24, type: !69, isLocal: false, isDefinition: true)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_HANDLE", file: !23, line: 33, baseType: !8)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SMM_VARIABLE_PROTOCOL", file: !72, line: 18, baseType: !73)
!72 = !DIFile(filename: "MdeModulePkg/Include/Protocol/SmmVariable.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "74d0de0506c559d93a0eec54e5e2a843")
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_SMM_VARIABLE_PROTOCOL", file: !72, line: 24, size: 256, elements: !74)
!74 = !{!75, !100, !105, !110}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "SmmGetVariable", scope: !73, file: !72, line: 25, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GET_VARIABLE", file: !77, line: 671, baseType: !78)
!77 = !DIFile(filename: "MdePkg/Include/Uefi/UefiSpec.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "dd07249351b00161d82576c2d3d57d19")
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DISubroutineType(types: !80)
!80 = !{!81, !82, !85, !98, !99, !8}
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_STATUS", file: !23, line: 29, baseType: !9)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHAR16", file: !6, line: 183, baseType: !84)
!84 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GUID", file: !23, line: 25, baseType: !87)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "GUID", file: !10, line: 218, baseType: !88)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GUID", file: !10, line: 213, size: 128, elements: !89)
!89 = !{!90, !91, !93, !94}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "Data1", scope: !88, file: !10, line: 214, baseType: !37, size: 32)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "Data2", scope: !88, file: !10, line: 215, baseType: !92, size: 16, offset: 32)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT16", file: !6, line: 178, baseType: !84)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "Data3", scope: !88, file: !10, line: 216, baseType: !92, size: 16, offset: 48)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "Data4", scope: !88, file: !10, line: 217, baseType: !95, size: 64, offset: 64)
!95 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 64, elements: !96)
!96 = !{!97}
!97 = !DISubrange(count: 8)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "SmmGetNextVariableName", scope: !73, file: !72, line: 26, baseType: !101, size: 64, offset: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GET_NEXT_VARIABLE_NAME", file: !77, line: 707, baseType: !102)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DISubroutineType(types: !104)
!104 = !{!81, !99, !82, !85}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "SmmSetVariable", scope: !73, file: !72, line: 27, baseType: !106, size: 64, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SET_VARIABLE", file: !77, line: 749, baseType: !107)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DISubroutineType(types: !109)
!109 = !{!81, !82, !85, !37, !11, !8}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "SmmQueryVariableInfo", scope: !73, file: !72, line: 28, baseType: !111, size: 64, offset: 192)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_QUERY_VARIABLE_INFO", file: !77, line: 1770, baseType: !112)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DISubroutineType(types: !114)
!114 = !{!81, !37, !115, !115, !115}
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!116 = !{i32 2, !"CodeView", i32 1}
!117 = !{i32 2, !"Debug Info Version", i32 3}
!118 = !{i32 1, !"wchar_size", i32 2}
!119 = !{i32 7, !"PIC Level", i32 2}
!120 = !{i32 1, !"Code Model", i32 1}
!121 = !{i32 7, !"uwtable", i32 1}
!122 = !{i32 1, !"ThinLTO", i32 0}
!123 = !{i32 1, !"EnableSplitLTOUnit", i32 1}
!124 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!125 = distinct !DISubprogram(name: "TpmNvsCommunciate", scope: !62, file: !62, line: 49, type: !126, scopeLine: 55, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !130)
!126 = !DISubroutineType(types: !127)
!127 = !{!81, !69, !128, !8, !99}
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!130 = !{}
!131 = !DILocalVariable(name: "DispatchHandle", arg: 1, scope: !125, file: !62, line: 50, type: !69)
!132 = !DILocation(line: 50, scope: !125)
!133 = !DILocalVariable(name: "RegisterContext", arg: 2, scope: !125, file: !62, line: 51, type: !128)
!134 = !DILocation(line: 51, scope: !125)
!135 = !DILocalVariable(name: "CommBuffer", arg: 3, scope: !125, file: !62, line: 52, type: !8)
!136 = !DILocation(line: 52, scope: !125)
!137 = !DILocalVariable(name: "CommBufferSize", arg: 4, scope: !125, file: !62, line: 53, type: !99)
!138 = !DILocation(line: 53, scope: !125)
!139 = !DILocalVariable(name: "Status", scope: !125, file: !62, line: 56, type: !81)
!140 = !DILocation(line: 56, scope: !125)
!141 = !DILocalVariable(name: "TempCommBufferSize", scope: !125, file: !62, line: 57, type: !11)
!142 = !DILocation(line: 57, scope: !125)
!143 = !DILocalVariable(name: "CommParams", scope: !125, file: !62, line: 58, type: !14)
!144 = !DILocation(line: 58, scope: !125)
!145 = !DILocation(line: 60, scope: !125)
!146 = !DILocation(line: 60, scope: !147)
!147 = distinct !DILexicalBlock(scope: !125, file: !62, line: 60)
!148 = !DILocation(line: 60, scope: !149)
!149 = distinct !DILexicalBlock(scope: !150, file: !62, line: 60)
!150 = distinct !DILexicalBlock(scope: !147, file: !62, line: 60)
!151 = !DILocation(line: 60, scope: !152)
!152 = distinct !DILexicalBlock(scope: !149, file: !62, line: 60)
!153 = !DILocation(line: 60, scope: !154)
!154 = distinct !DILexicalBlock(scope: !155, file: !62, line: 60)
!155 = distinct !DILexicalBlock(scope: !152, file: !62, line: 60)
!156 = !DILocation(line: 65, scope: !125)
!157 = !DILocation(line: 66, scope: !158)
!158 = distinct !DILexicalBlock(scope: !159, file: !62, line: 65)
!159 = distinct !DILexicalBlock(scope: !125, file: !62, line: 65)
!160 = !DILocation(line: 69, scope: !125)
!161 = !DILocation(line: 71, scope: !125)
!162 = !DILocation(line: 72, scope: !163)
!163 = distinct !DILexicalBlock(scope: !164, file: !62, line: 71)
!164 = distinct !DILexicalBlock(scope: !125, file: !62, line: 71)
!165 = !DILocation(line: 72, scope: !166)
!166 = distinct !DILexicalBlock(scope: !163, file: !62, line: 72)
!167 = !DILocation(line: 72, scope: !168)
!168 = distinct !DILexicalBlock(scope: !169, file: !62, line: 72)
!169 = distinct !DILexicalBlock(scope: !166, file: !62, line: 72)
!170 = !DILocation(line: 72, scope: !171)
!171 = distinct !DILexicalBlock(scope: !168, file: !62, line: 72)
!172 = !DILocation(line: 72, scope: !173)
!173 = distinct !DILexicalBlock(scope: !174, file: !62, line: 72)
!174 = distinct !DILexicalBlock(scope: !171, file: !62, line: 72)
!175 = !DILocation(line: 73, scope: !163)
!176 = !DILocation(line: 76, scope: !125)
!177 = !DILocation(line: 77, scope: !178)
!178 = distinct !DILexicalBlock(scope: !179, file: !62, line: 76)
!179 = distinct !DILexicalBlock(scope: !125, file: !62, line: 76)
!180 = !DILocation(line: 77, scope: !181)
!181 = distinct !DILexicalBlock(scope: !178, file: !62, line: 77)
!182 = !DILocation(line: 77, scope: !183)
!183 = distinct !DILexicalBlock(scope: !184, file: !62, line: 77)
!184 = distinct !DILexicalBlock(scope: !181, file: !62, line: 77)
!185 = !DILocation(line: 77, scope: !186)
!186 = distinct !DILexicalBlock(scope: !183, file: !62, line: 77)
!187 = !DILocation(line: 77, scope: !188)
!188 = distinct !DILexicalBlock(scope: !189, file: !62, line: 77)
!189 = distinct !DILexicalBlock(scope: !186, file: !62, line: 77)
!190 = !DILocation(line: 78, scope: !178)
!191 = !DILocation(line: 84, scope: !125)
!192 = !DILocation(line: 85, scope: !125)
!193 = !DILocation(line: 86, scope: !125)
!194 = !DILocation(line: 88, scope: !195)
!195 = distinct !DILexicalBlock(scope: !125, file: !62, line: 86)
!196 = !DILocation(line: 88, scope: !197)
!197 = distinct !DILexicalBlock(scope: !195, file: !62, line: 88)
!198 = !DILocation(line: 88, scope: !199)
!199 = distinct !DILexicalBlock(scope: !200, file: !62, line: 88)
!200 = distinct !DILexicalBlock(scope: !197, file: !62, line: 88)
!201 = !DILocation(line: 88, scope: !202)
!202 = distinct !DILexicalBlock(scope: !199, file: !62, line: 88)
!203 = !DILocation(line: 88, scope: !204)
!204 = distinct !DILexicalBlock(scope: !205, file: !62, line: 88)
!205 = distinct !DILexicalBlock(scope: !202, file: !62, line: 88)
!206 = !DILocation(line: 89, scope: !195)
!207 = !DILocation(line: 90, scope: !195)
!208 = !DILocation(line: 91, scope: !195)
!209 = !DILocation(line: 92, scope: !195)
!210 = !DILocation(line: 95, scope: !195)
!211 = !DILocation(line: 95, scope: !212)
!212 = distinct !DILexicalBlock(scope: !195, file: !62, line: 95)
!213 = !DILocation(line: 95, scope: !214)
!214 = distinct !DILexicalBlock(scope: !215, file: !62, line: 95)
!215 = distinct !DILexicalBlock(scope: !212, file: !62, line: 95)
!216 = !DILocation(line: 95, scope: !217)
!217 = distinct !DILexicalBlock(scope: !214, file: !62, line: 95)
!218 = !DILocation(line: 95, scope: !219)
!219 = distinct !DILexicalBlock(scope: !220, file: !62, line: 95)
!220 = distinct !DILexicalBlock(scope: !217, file: !62, line: 95)
!221 = !DILocation(line: 96, scope: !195)
!222 = !DILocation(line: 97, scope: !195)
!223 = !DILocation(line: 100, scope: !125)
!224 = !DILocation(line: 101, scope: !125)
!225 = !DILocation(line: 102, scope: !125)
!226 = distinct !DISubprogram(name: "PhysicalPresenceCallback", scope: !62, file: !62, line: 123, type: !126, scopeLine: 129, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !130)
!227 = !DILocalVariable(name: "DispatchHandle", arg: 1, scope: !226, file: !62, line: 124, type: !69)
!228 = !DILocation(line: 124, scope: !226)
!229 = !DILocalVariable(name: "Context", arg: 2, scope: !226, file: !62, line: 125, type: !128)
!230 = !DILocation(line: 125, scope: !226)
!231 = !DILocalVariable(name: "CommBuffer", arg: 3, scope: !226, file: !62, line: 126, type: !8)
!232 = !DILocation(line: 126, scope: !226)
!233 = !DILocalVariable(name: "CommBufferSize", arg: 4, scope: !226, file: !62, line: 127, type: !99)
!234 = !DILocation(line: 127, scope: !226)
!235 = !DILocalVariable(name: "MostRecentRequest", scope: !226, file: !62, line: 130, type: !37)
!236 = !DILocation(line: 130, scope: !226)
!237 = !DILocalVariable(name: "Response", scope: !226, file: !62, line: 131, type: !37)
!238 = !DILocation(line: 131, scope: !226)
!239 = !DILocalVariable(name: "OperationRequest", scope: !226, file: !62, line: 132, type: !37)
!240 = !DILocation(line: 132, scope: !226)
!241 = !DILocalVariable(name: "RequestParameter", scope: !226, file: !62, line: 133, type: !37)
!242 = !DILocation(line: 133, scope: !226)
!243 = !DILocation(line: 135, scope: !226)
!244 = !DILocation(line: 136, scope: !245)
!245 = distinct !DILexicalBlock(scope: !246, file: !62, line: 135)
!246 = distinct !DILexicalBlock(scope: !226, file: !62, line: 135)
!247 = !DILocation(line: 140, scope: !245)
!248 = !DILocation(line: 141, scope: !245)
!249 = !DILocation(line: 142, scope: !245)
!250 = !DILocation(line: 143, scope: !246)
!251 = !DILocation(line: 146, scope: !252)
!252 = distinct !DILexicalBlock(scope: !253, file: !62, line: 145)
!253 = distinct !DILexicalBlock(scope: !246, file: !62, line: 143)
!254 = !DILocation(line: 147, scope: !252)
!255 = !DILocation(line: 148, scope: !252)
!256 = !DILocation(line: 152, scope: !252)
!257 = !DILocation(line: 153, scope: !252)
!258 = !DILocation(line: 154, scope: !252)
!259 = !DILocation(line: 154, scope: !253)
!260 = !DILocation(line: 155, scope: !261)
!261 = distinct !DILexicalBlock(scope: !262, file: !62, line: 154)
!262 = distinct !DILexicalBlock(scope: !253, file: !62, line: 154)
!263 = !DILocation(line: 156, scope: !261)
!264 = !DILocation(line: 154, scope: !262)
!265 = !DILocation(line: 144, scope: !253)
!266 = !DILocation(line: 158, scope: !226)
!267 = !DILocation(line: 159, scope: !226)
!268 = distinct !DISubprogram(name: "MemoryClearCallback", scope: !62, file: !62, line: 180, type: !126, scopeLine: 186, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !130)
!269 = !DILocalVariable(name: "DispatchHandle", arg: 1, scope: !268, file: !62, line: 181, type: !69)
!270 = !DILocation(line: 181, scope: !268)
!271 = !DILocalVariable(name: "Context", arg: 2, scope: !268, file: !62, line: 182, type: !128)
!272 = !DILocation(line: 182, scope: !268)
!273 = !DILocalVariable(name: "CommBuffer", arg: 3, scope: !268, file: !62, line: 183, type: !8)
!274 = !DILocation(line: 183, scope: !268)
!275 = !DILocalVariable(name: "CommBufferSize", arg: 4, scope: !268, file: !62, line: 184, type: !99)
!276 = !DILocation(line: 184, scope: !268)
!277 = !DILocalVariable(name: "Status", scope: !268, file: !62, line: 187, type: !81)
!278 = !DILocation(line: 187, scope: !268)
!279 = !DILocalVariable(name: "DataSize", scope: !268, file: !62, line: 188, type: !11)
!280 = !DILocation(line: 188, scope: !268)
!281 = !DILocalVariable(name: "MorControl", scope: !268, file: !62, line: 189, type: !35)
!282 = !DILocation(line: 189, scope: !268)
!283 = !DILocation(line: 191, scope: !268)
!284 = !DILocation(line: 192, scope: !268)
!285 = !DILocation(line: 193, scope: !286)
!286 = distinct !DILexicalBlock(scope: !287, file: !62, line: 192)
!287 = distinct !DILexicalBlock(scope: !268, file: !62, line: 192)
!288 = !DILocation(line: 194, scope: !286)
!289 = !DILocation(line: 194, scope: !287)
!290 = !DILocation(line: 195, scope: !291)
!291 = distinct !DILexicalBlock(scope: !292, file: !62, line: 194)
!292 = distinct !DILexicalBlock(scope: !287, file: !62, line: 194)
!293 = !DILocation(line: 196, scope: !291)
!294 = !DILocation(line: 203, scope: !291)
!295 = !DILocation(line: 204, scope: !296)
!296 = distinct !DILexicalBlock(scope: !297, file: !62, line: 203)
!297 = distinct !DILexicalBlock(scope: !291, file: !62, line: 203)
!298 = !DILocation(line: 205, scope: !296)
!299 = !DILocation(line: 205, scope: !300)
!300 = distinct !DILexicalBlock(scope: !296, file: !62, line: 205)
!301 = !DILocation(line: 205, scope: !302)
!302 = distinct !DILexicalBlock(scope: !303, file: !62, line: 205)
!303 = distinct !DILexicalBlock(scope: !300, file: !62, line: 205)
!304 = !DILocation(line: 205, scope: !305)
!305 = distinct !DILexicalBlock(scope: !302, file: !62, line: 205)
!306 = !DILocation(line: 205, scope: !307)
!307 = distinct !DILexicalBlock(scope: !308, file: !62, line: 205)
!308 = distinct !DILexicalBlock(scope: !305, file: !62, line: 205)
!309 = !DILocation(line: 206, scope: !296)
!310 = !DILocation(line: 209, scope: !291)
!311 = !DILocation(line: 210, scope: !312)
!312 = distinct !DILexicalBlock(scope: !313, file: !62, line: 209)
!313 = distinct !DILexicalBlock(scope: !291, file: !62, line: 209)
!314 = !DILocation(line: 213, scope: !291)
!315 = !DILocation(line: 214, scope: !291)
!316 = !DILocation(line: 215, scope: !317)
!317 = distinct !DILexicalBlock(scope: !292, file: !62, line: 214)
!318 = !DILocation(line: 216, scope: !317)
!319 = !DILocation(line: 216, scope: !320)
!320 = distinct !DILexicalBlock(scope: !317, file: !62, line: 216)
!321 = !DILocation(line: 216, scope: !322)
!322 = distinct !DILexicalBlock(scope: !323, file: !62, line: 216)
!323 = distinct !DILexicalBlock(scope: !320, file: !62, line: 216)
!324 = !DILocation(line: 216, scope: !325)
!325 = distinct !DILexicalBlock(scope: !322, file: !62, line: 216)
!326 = !DILocation(line: 216, scope: !327)
!327 = distinct !DILexicalBlock(scope: !328, file: !62, line: 216)
!328 = distinct !DILexicalBlock(scope: !325, file: !62, line: 216)
!329 = !DILocation(line: 217, scope: !317)
!330 = !DILocation(line: 194, scope: !292)
!331 = !DILocation(line: 220, scope: !268)
!332 = !DILocation(line: 221, scope: !268)
!333 = !DILocation(line: 228, scope: !268)
!334 = !DILocation(line: 229, scope: !335)
!335 = distinct !DILexicalBlock(scope: !336, file: !62, line: 228)
!336 = distinct !DILexicalBlock(scope: !268, file: !62, line: 228)
!337 = !DILocation(line: 230, scope: !335)
!338 = !DILocation(line: 230, scope: !339)
!339 = distinct !DILexicalBlock(scope: !335, file: !62, line: 230)
!340 = !DILocation(line: 230, scope: !341)
!341 = distinct !DILexicalBlock(scope: !342, file: !62, line: 230)
!342 = distinct !DILexicalBlock(scope: !339, file: !62, line: 230)
!343 = !DILocation(line: 230, scope: !344)
!344 = distinct !DILexicalBlock(scope: !341, file: !62, line: 230)
!345 = !DILocation(line: 230, scope: !346)
!346 = distinct !DILexicalBlock(scope: !347, file: !62, line: 230)
!347 = distinct !DILexicalBlock(scope: !344, file: !62, line: 230)
!348 = !DILocation(line: 231, scope: !335)
!349 = !DILocation(line: 233, scope: !268)
!350 = !DILocation(line: 234, scope: !268)
!351 = distinct !DISubprogram(name: "TcgMmReadyToLock", scope: !62, file: !62, line: 248, type: !352, scopeLine: 253, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !130)
!352 = !DISubroutineType(types: !353)
!353 = !{!81, !354, !8, !69}
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !86)
!356 = !DILocalVariable(name: "Protocol", arg: 1, scope: !351, file: !62, line: 249, type: !354)
!357 = !DILocation(line: 249, scope: !351)
!358 = !DILocalVariable(name: "Interface", arg: 2, scope: !351, file: !62, line: 250, type: !8)
!359 = !DILocation(line: 250, scope: !351)
!360 = !DILocalVariable(name: "Handle", arg: 3, scope: !351, file: !62, line: 251, type: !69)
!361 = !DILocation(line: 251, scope: !351)
!362 = !DILocalVariable(name: "Status", scope: !351, file: !62, line: 254, type: !81)
!363 = !DILocation(line: 254, scope: !351)
!364 = !DILocation(line: 256, scope: !351)
!365 = !DILocation(line: 258, scope: !351)
!366 = !DILocation(line: 259, scope: !367)
!367 = distinct !DILexicalBlock(scope: !368, file: !62, line: 258)
!368 = distinct !DILexicalBlock(scope: !351, file: !62, line: 258)
!369 = !DILocation(line: 260, scope: !367)
!370 = !DILocation(line: 261, scope: !367)
!371 = !DILocation(line: 263, scope: !351)
!372 = distinct !DISubprogram(name: "InitializeTcgCommon", scope: !62, file: !62, line: 277, type: !373, scopeLine: 280, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !130)
!373 = !DISubroutineType(types: !374)
!374 = !{!81}
!375 = !DILocalVariable(name: "Status", scope: !372, file: !62, line: 281, type: !81)
!376 = !DILocation(line: 281, scope: !372)
!377 = !DILocalVariable(name: "SwDispatch", scope: !372, file: !62, line: 282, type: !378)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SMM_SW_DISPATCH2_PROTOCOL", file: !380, line: 50, baseType: !381)
!380 = !DIFile(filename: "MdePkg/Include/Protocol/SmmSwDispatch2.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "df18c872930f374d72d1ef431301feb1")
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_SMM_SW_DISPATCH2_PROTOCOL", file: !380, line: 116, size: 192, elements: !382)
!382 = !{!383, !401, !406}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "Register", scope: !381, file: !380, line: 117, baseType: !384, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SMM_SW_REGISTER2", file: !380, line: 83, baseType: !385)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DISubroutineType(types: !387)
!387 = !{!81, !388, !390, !395, !400}
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !379)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SMM_HANDLER_ENTRY_POINT2", file: !391, line: 56, baseType: !392)
!391 = !DIFile(filename: "MdePkg/Include/Pi/PiSmmCis.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "26f8805d33aa377abd8e63bed8e50f01")
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MM_HANDLER_ENTRY_POINT", file: !393, line: 165, baseType: !394)
!393 = !DIFile(filename: "MdePkg/Include/Pi/PiMmCis.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "82364cafffe22fadeeaa767af7242f69")
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SMM_SW_REGISTER_CONTEXT", file: !380, line: 27, baseType: !397)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_SMM_SW_REGISTER_CONTEXT", file: !380, line: 25, size: 64, elements: !398)
!398 = !{!399}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "SwSmiInputValue", scope: !397, file: !380, line: 26, baseType: !11, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "UnRegister", scope: !381, file: !380, line: 118, baseType: !402, size: 64, offset: 64)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SMM_SW_UNREGISTER2", file: !380, line: 104, baseType: !403)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DISubroutineType(types: !405)
!405 = !{!81, !388, !69}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "MaximumSwiValue", scope: !381, file: !380, line: 123, baseType: !11, size: 64, offset: 128)
!407 = !DILocation(line: 282, scope: !372)
!408 = !DILocalVariable(name: "SwContext", scope: !372, file: !62, line: 283, type: !396)
!409 = !DILocation(line: 283, scope: !372)
!410 = !DILocalVariable(name: "PpSwHandle", scope: !372, file: !62, line: 284, type: !69)
!411 = !DILocation(line: 284, scope: !372)
!412 = !DILocalVariable(name: "McSwHandle", scope: !372, file: !62, line: 285, type: !69)
!413 = !DILocation(line: 285, scope: !372)
!414 = !DILocalVariable(name: "NotifyHandle", scope: !372, file: !62, line: 286, type: !69)
!415 = !DILocation(line: 286, scope: !372)
!416 = !DILocation(line: 288, scope: !372)
!417 = !DILocation(line: 289, scope: !418)
!418 = distinct !DILexicalBlock(scope: !419, file: !62, line: 288)
!419 = distinct !DILexicalBlock(scope: !372, file: !62, line: 288)
!420 = !DILocation(line: 289, scope: !421)
!421 = distinct !DILexicalBlock(scope: !418, file: !62, line: 289)
!422 = !DILocation(line: 289, scope: !423)
!423 = distinct !DILexicalBlock(scope: !424, file: !62, line: 289)
!424 = distinct !DILexicalBlock(scope: !421, file: !62, line: 289)
!425 = !DILocation(line: 289, scope: !426)
!426 = distinct !DILexicalBlock(scope: !423, file: !62, line: 289)
!427 = !DILocation(line: 289, scope: !428)
!428 = distinct !DILexicalBlock(scope: !429, file: !62, line: 289)
!429 = distinct !DILexicalBlock(scope: !426, file: !62, line: 289)
!430 = !DILocation(line: 290, scope: !418)
!431 = !DILocation(line: 294, scope: !372)
!432 = !DILocation(line: 295, scope: !372)
!433 = !DILocation(line: 296, scope: !372)
!434 = !DILocation(line: 297, scope: !372)
!435 = !DILocation(line: 298, scope: !372)
!436 = !DILocation(line: 301, scope: !372)
!437 = !DILocation(line: 302, scope: !372)
!438 = !DILocation(line: 302, scope: !439)
!439 = distinct !DILexicalBlock(scope: !372, file: !62, line: 302)
!440 = !DILocation(line: 302, scope: !441)
!441 = distinct !DILexicalBlock(scope: !442, file: !62, line: 302)
!442 = distinct !DILexicalBlock(scope: !439, file: !62, line: 302)
!443 = !DILocation(line: 302, scope: !444)
!444 = distinct !DILexicalBlock(scope: !445, file: !62, line: 302)
!445 = distinct !DILexicalBlock(scope: !441, file: !62, line: 302)
!446 = !DILocation(line: 302, scope: !447)
!447 = distinct !DILexicalBlock(scope: !444, file: !62, line: 302)
!448 = !DILocation(line: 302, scope: !449)
!449 = distinct !DILexicalBlock(scope: !450, file: !62, line: 302)
!450 = distinct !DILexicalBlock(scope: !447, file: !62, line: 302)
!451 = !DILocation(line: 302, scope: !452)
!452 = distinct !DILexicalBlock(scope: !449, file: !62, line: 302)
!453 = !DILocation(line: 302, scope: !454)
!454 = distinct !DILexicalBlock(scope: !455, file: !62, line: 302)
!455 = distinct !DILexicalBlock(scope: !452, file: !62, line: 302)
!456 = !DILocation(line: 303, scope: !372)
!457 = !DILocation(line: 304, scope: !458)
!458 = distinct !DILexicalBlock(scope: !459, file: !62, line: 303)
!459 = distinct !DILexicalBlock(scope: !372, file: !62, line: 303)
!460 = !DILocation(line: 304, scope: !461)
!461 = distinct !DILexicalBlock(scope: !458, file: !62, line: 304)
!462 = !DILocation(line: 304, scope: !463)
!463 = distinct !DILexicalBlock(scope: !464, file: !62, line: 304)
!464 = distinct !DILexicalBlock(scope: !461, file: !62, line: 304)
!465 = !DILocation(line: 304, scope: !466)
!466 = distinct !DILexicalBlock(scope: !463, file: !62, line: 304)
!467 = !DILocation(line: 304, scope: !468)
!468 = distinct !DILexicalBlock(scope: !469, file: !62, line: 304)
!469 = distinct !DILexicalBlock(scope: !466, file: !62, line: 304)
!470 = !DILocation(line: 305, scope: !458)
!471 = !DILocation(line: 311, scope: !372)
!472 = !DILocation(line: 312, scope: !372)
!473 = !DILocation(line: 312, scope: !474)
!474 = distinct !DILexicalBlock(scope: !372, file: !62, line: 312)
!475 = !DILocation(line: 312, scope: !476)
