; ModuleID = 'VariableSmm.bc'
source_filename = "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main/MdeModulePkg/Universal/Variable/RuntimeDxe/VariableSmm.c"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-windows-gnu"

%struct._EFI_SMM_VARIABLE_PROTOCOL = type { i64 (i16*, %struct.GUID*, i32*, i64*, i8*)*, i64 (i64*, i16*, %struct.GUID*)*, i64 (i16*, %struct.GUID*, i32, i64, i8*)*, i64 (i32, i64*, i64*, i64*)* }
%struct.GUID = type { i32, i16, i16, [8 x i8] }
%struct._EDKII_SMM_VAR_CHECK_PROTOCOL = type { i64 (i64 (i16*, %struct.GUID*, i32, i64, i8*)*)*, i64 (i16*, %struct.GUID*, %struct.VAR_CHECK_VARIABLE_PROPERTY*)*, i64 (i16*, %struct.GUID*, %struct.VAR_CHECK_VARIABLE_PROPERTY*)* }
%struct.VAR_CHECK_VARIABLE_PROPERTY = type { i16, i16, i32, i64, i64 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "mAtRuntime", scope: !2, file: !152, line: 39, type: !27, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !12, globals: !149, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main/MdeModulePkg/Universal/Variable/RuntimeDxe/VariableSmm.c", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main/Build/OvmfX64/NOOPT_CLANGPDB/X64/MdeModulePkg/Universal/Variable/RuntimeDxe/VariableSmm", checksumkind: CSK_MD5, checksum: "45c94566154d9007c20d4b4e35e03e40")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 49, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "MdePkg/Include/Library/UefiLib.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "70b2597622630d198af9ef8e9731274a")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11}
!9 = !DIEnumerator(name: "EfiLockUninitialized", value: 0)
!10 = !DIEnumerator(name: "EfiLockReleased", value: 1)
!11 = !DIEnumerator(name: "EfiLockAcquired", value: 2)
!12 = !{!13, !14, !15, !21, !24, !17, !27, !29, !43, !66, !67, !74, !82, !87, !101, !103, !120, !129, !53, !141}
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "RETURN_STATUS", file: !16, line: 1026, baseType: !17)
!16 = !DIFile(filename: "MdePkg/Include/Base.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "0c11ea3d1992443d8a8f590a064e50ff")
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINTN", file: !18, line: 211, baseType: !19)
!18 = !DIFile(filename: "MdePkg/Include/X64/ProcessorBind.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "ef2524a221fe61206fa09ec88dd4f59b")
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT64", file: !18, line: 162, baseType: !20)
!20 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTN", file: !18, line: 216, baseType: !22)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT64", file: !18, line: 166, baseType: !23)
!23 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHAR16", file: !18, line: 183, baseType: !26)
!26 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "BOOLEAN", file: !18, line: 192, baseType: !28)
!28 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "SMM_VARIABLE_COMMUNICATE_HEADER", file: !31, line: 29, baseType: !32)
!31 = !DIFile(filename: "MdeModulePkg/Include/Guid/SmmVariableCommon.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "abbf4f98772279392af4ef62585d3eb0")
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SMM_VARIABLE_COMMUNICATE_HEADER", file: !31, line: 25, size: 192, elements: !33)
!33 = !{!34, !35, !38}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !32, file: !31, line: 26, baseType: !17, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "ReturnStatus", scope: !32, file: !31, line: 27, baseType: !36, size: 64, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_STATUS", file: !37, line: 29, baseType: !15)
!37 = !DIFile(filename: "MdePkg/Include/Uefi/UefiBaseType.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "dbec48e65949dff122bc920c9d9d9c6a")
!38 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !32, file: !31, line: 28, baseType: !39, size: 8, offset: 128)
!39 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 8, elements: !41)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT8", file: !18, line: 196, baseType: !28)
!41 = !{!42}
!42 = !DISubrange(count: 1)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "SMM_VARIABLE_COMMUNICATE_ACCESS_VARIABLE", file: !31, line: 100, baseType: !45)
!45 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SMM_VARIABLE_COMMUNICATE_ACCESS_VARIABLE", file: !31, line: 94, size: 320, elements: !46)
!46 = !{!47, !61, !62, !63, !64}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "Guid", scope: !45, file: !31, line: 95, baseType: !48, size: 128)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GUID", file: !37, line: 25, baseType: !49)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "GUID", file: !16, line: 218, baseType: !50)
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GUID", file: !16, line: 213, size: 128, elements: !51)
!51 = !{!52, !54, !56, !57}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "Data1", scope: !50, file: !16, line: 214, baseType: !53, size: 32)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT32", file: !18, line: 170, baseType: !7)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "Data2", scope: !50, file: !16, line: 215, baseType: !55, size: 16, offset: 32)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT16", file: !18, line: 178, baseType: !26)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "Data3", scope: !50, file: !16, line: 216, baseType: !55, size: 16, offset: 48)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "Data4", scope: !50, file: !16, line: 217, baseType: !58, size: 64, offset: 64)
!58 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 64, elements: !59)
!59 = !{!60}
!60 = !DISubrange(count: 8)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "DataSize", scope: !45, file: !31, line: 96, baseType: !17, size: 64, offset: 128)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "NameSize", scope: !45, file: !31, line: 97, baseType: !17, size: 64, offset: 192)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "Attributes", scope: !45, file: !31, line: 98, baseType: !53, size: 32, offset: 256)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "Name", scope: !45, file: !31, line: 99, baseType: !65, size: 16, offset: 288)
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 16, elements: !41)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "SMM_VARIABLE_COMMUNICATE_GET_NEXT_VARIABLE_NAME", file: !31, line: 109, baseType: !69)
!69 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SMM_VARIABLE_COMMUNICATE_GET_NEXT_VARIABLE_NAME", file: !31, line: 105, size: 256, elements: !70)
!70 = !{!71, !72, !73}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "Guid", scope: !69, file: !31, line: 106, baseType: !48, size: 128)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "NameSize", scope: !69, file: !31, line: 107, baseType: !17, size: 64, offset: 128)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "Name", scope: !69, file: !31, line: 108, baseType: !65, size: 16, offset: 192)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "SMM_VARIABLE_COMMUNICATE_QUERY_VARIABLE_INFO", file: !31, line: 119, baseType: !76)
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SMM_VARIABLE_COMMUNICATE_QUERY_VARIABLE_INFO", file: !31, line: 114, size: 256, elements: !77)
!77 = !{!78, !79, !80, !81}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "MaximumVariableStorageSize", scope: !76, file: !31, line: 115, baseType: !19, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "RemainingVariableStorageSize", scope: !76, file: !31, line: 116, baseType: !19, size: 64, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "MaximumVariableSize", scope: !76, file: !31, line: 117, baseType: !19, size: 64, offset: 128)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "Attributes", scope: !76, file: !31, line: 118, baseType: !53, size: 32, offset: 192)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "SMM_VARIABLE_COMMUNICATE_GET_PAYLOAD_SIZE", file: !31, line: 132, baseType: !84)
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SMM_VARIABLE_COMMUNICATE_GET_PAYLOAD_SIZE", file: !31, line: 130, size: 64, elements: !85)
!85 = !{!86}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "VariablePayloadSize", scope: !84, file: !31, line: 131, baseType: !17, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "VARIABLE_INFO_ENTRY", file: !89, line: 202, baseType: !90)
!89 = !DIFile(filename: "MdeModulePkg/Include/Guid/VariableFormat.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "f68ff7eb3c7d98da86748ac504db06c5")
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_VARIABLE_INFO_ENTRY", file: !89, line: 209, size: 448, elements: !91)
!91 = !{!92, !93, !94, !95, !96, !97, !98, !99, !100}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !90, file: !89, line: 210, baseType: !87, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "VendorGuid", scope: !90, file: !89, line: 211, baseType: !48, size: 128, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "Name", scope: !90, file: !89, line: 212, baseType: !24, size: 64, offset: 192)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "Attributes", scope: !90, file: !89, line: 213, baseType: !53, size: 32, offset: 256)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "ReadCount", scope: !90, file: !89, line: 214, baseType: !53, size: 32, offset: 288)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "WriteCount", scope: !90, file: !89, line: 215, baseType: !53, size: 32, offset: 320)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "DeleteCount", scope: !90, file: !89, line: 216, baseType: !53, size: 32, offset: 352)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "CacheCount", scope: !90, file: !89, line: 217, baseType: !53, size: 32, offset: 384)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "Volatile", scope: !90, file: !89, line: 218, baseType: !27, size: 8, offset: 416)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "SMM_VARIABLE_COMMUNICATE_LOCK_VARIABLE", file: !31, line: 121, baseType: !68)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "SMM_VARIABLE_COMMUNICATE_VAR_CHECK_VARIABLE_PROPERTY", file: !31, line: 128, baseType: !105)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SMM_VARIABLE_COMMUNICATE_VAR_CHECK_VARIABLE_PROPERTY", file: !31, line: 123, size: 448, elements: !106)
!106 = !{!107, !108, !109, !119}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "Guid", scope: !105, file: !31, line: 124, baseType: !48, size: 128)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "NameSize", scope: !105, file: !31, line: 125, baseType: !17, size: 64, offset: 128)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "VariableProperty", scope: !105, file: !31, line: 126, baseType: !110, size: 192, offset: 192)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "VAR_CHECK_VARIABLE_PROPERTY", file: !111, line: 58, baseType: !112)
!111 = !DIFile(filename: "MdeModulePkg/Include/Protocol/VarCheck.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "ff9ef2a08de2f311dbb761b72f0e24f0")
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VAR_CHECK_VARIABLE_PROPERTY", file: !111, line: 52, size: 192, elements: !113)
!113 = !{!114, !115, !116, !117, !118}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "Revision", scope: !112, file: !111, line: 53, baseType: !55, size: 16)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "Property", scope: !112, file: !111, line: 54, baseType: !55, size: 16, offset: 16)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "Attributes", scope: !112, file: !111, line: 55, baseType: !53, size: 32, offset: 32)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "MinSize", scope: !112, file: !111, line: 56, baseType: !17, size: 64, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "MaxSize", scope: !112, file: !111, line: 57, baseType: !17, size: 64, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "Name", scope: !105, file: !31, line: 127, baseType: !65, size: 16, offset: 384)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "SMM_VARIABLE_COMMUNICATE_RUNTIME_VARIABLE_CACHE_CONTEXT", file: !31, line: 141, baseType: !122)
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SMM_VARIABLE_COMMUNICATE_RUNTIME_VARIABLE_CACHE_CONTEXT", file: !31, line: 134, size: 384, elements: !123)
!123 = !{!124, !126, !127, !128, !139, !140}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "ReadLock", scope: !122, file: !31, line: 135, baseType: !125, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "PendingUpdate", scope: !122, file: !31, line: 136, baseType: !125, size: 64, offset: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "HobFlushComplete", scope: !122, file: !31, line: 137, baseType: !125, size: 64, offset: 128)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "RuntimeHobCache", scope: !122, file: !31, line: 138, baseType: !129, size: 64, offset: 192)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "VARIABLE_STORE_HEADER", file: !89, line: 87, baseType: !131)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VARIABLE_STORE_HEADER", file: !89, line: 67, size: 224, elements: !132)
!132 = !{!133, !134, !135, !136, !137, !138}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", scope: !131, file: !89, line: 71, baseType: !48, size: 128)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !131, file: !89, line: 76, baseType: !53, size: 32, offset: 128)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "Format", scope: !131, file: !89, line: 80, baseType: !40, size: 8, offset: 160)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "State", scope: !131, file: !89, line: 84, baseType: !40, size: 8, offset: 168)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved", scope: !131, file: !89, line: 85, baseType: !55, size: 16, offset: 176)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !131, file: !89, line: 86, baseType: !53, size: 32, offset: 192)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "RuntimeNvCache", scope: !122, file: !31, line: 139, baseType: !129, size: 64, offset: 256)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "RuntimeVolatileCache", scope: !122, file: !31, line: 140, baseType: !129, size: 64, offset: 320)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "SMM_VARIABLE_COMMUNICATE_GET_RUNTIME_CACHE_INFO", file: !31, line: 148, baseType: !143)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SMM_VARIABLE_COMMUNICATE_GET_RUNTIME_CACHE_INFO", file: !31, line: 143, size: 256, elements: !144)
!144 = !{!145, !146, !147, !148}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "TotalHobStorageSize", scope: !143, file: !31, line: 144, baseType: !17, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "TotalNvStorageSize", scope: !143, file: !31, line: 145, baseType: !17, size: 64, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "TotalVolatileStorageSize", scope: !143, file: !31, line: 146, baseType: !17, size: 64, offset: 128)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "AuthenticatedVariableUsage", scope: !143, file: !31, line: 147, baseType: !27, size: 8, offset: 192)
!149 = !{!0, !150, !153, !157, !159, !190, !210, !212, !214, !217}
!150 = !DIGlobalVariableExpression(var: !151, expr: !DIExpression())
!151 = distinct !DIGlobalVariable(name: "mVariableBufferPayload", scope: !2, file: !152, line: 40, type: !66, isLocal: false, isDefinition: true)
!152 = !DIFile(filename: "MdeModulePkg/Universal/Variable/RuntimeDxe/VariableSmm.c", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "45c94566154d9007c20d4b4e35e03e40")
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression(DW_OP_constu, 2, DW_OP_stack_value))
!154 = distinct !DIGlobalVariable(name: "VarCheckFromTrusted", scope: !2, file: !155, line: 17, type: !156, isLocal: true, isDefinition: true)
!155 = !DIFile(filename: "MdeModulePkg/Include/Library/VarCheckLib.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "606ed26404f3eaffed5b0e48fc5cae05")
!156 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!157 = !DIGlobalVariableExpression(var: !158, expr: !DIExpression(DW_OP_constu, 3, DW_OP_stack_value))
!158 = distinct !DIGlobalVariable(name: "VarCheckFromUntrusted", scope: !2, file: !155, line: 18, type: !156, isLocal: true, isDefinition: true)
!159 = !DIGlobalVariableExpression(var: !160, expr: !DIExpression())
!160 = distinct !DIGlobalVariable(name: "gSmmVariable", scope: !2, file: !152, line: 105, type: !161, isLocal: false, isDefinition: true)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SMM_VARIABLE_PROTOCOL", file: !162, line: 18, baseType: !163)
!162 = !DIFile(filename: "MdeModulePkg/Include/Protocol/SmmVariable.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "74d0de0506c559d93a0eec54e5e2a843")
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_SMM_VARIABLE_PROTOCOL", file: !162, line: 24, size: 256, elements: !164)
!164 = !{!165, !174, !179, !184}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "SmmGetVariable", scope: !163, file: !162, line: 25, baseType: !166, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GET_VARIABLE", file: !167, line: 671, baseType: !168)
!167 = !DIFile(filename: "MdePkg/Include/Uefi/UefiSpec.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "dd07249351b00161d82576c2d3d57d19")
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DISubroutineType(types: !170)
!170 = !{!36, !24, !171, !172, !173, !13}
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "SmmGetNextVariableName", scope: !163, file: !162, line: 26, baseType: !175, size: 64, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GET_NEXT_VARIABLE_NAME", file: !167, line: 707, baseType: !176)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DISubroutineType(types: !178)
!178 = !{!36, !173, !24, !171}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "SmmSetVariable", scope: !163, file: !162, line: 27, baseType: !180, size: 64, offset: 128)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SET_VARIABLE", file: !167, line: 749, baseType: !181)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DISubroutineType(types: !183)
!183 = !{!36, !24, !171, !53, !17, !13}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "SmmQueryVariableInfo", scope: !163, file: !162, line: 28, baseType: !185, size: 64, offset: 192)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_QUERY_VARIABLE_INFO", file: !167, line: 1770, baseType: !186)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DISubroutineType(types: !188)
!188 = !{!36, !53, !189, !189, !189}
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!190 = !DIGlobalVariableExpression(var: !191, expr: !DIExpression())
!191 = distinct !DIGlobalVariable(name: "mSmmVarCheck", scope: !2, file: !152, line: 112, type: !192, isLocal: false, isDefinition: true)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "EDKII_SMM_VAR_CHECK_PROTOCOL", file: !193, line: 19, baseType: !194)
!193 = !DIFile(filename: "MdeModulePkg/Include/Protocol/SmmVarCheck.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "4640528a41a8c4fcdf466c35b0f011f8")
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EDKII_SMM_VAR_CHECK_PROTOCOL", file: !193, line: 21, size: 192, elements: !195)
!195 = !{!196, !202, !208}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "SmmRegisterSetVariableCheckHandler", scope: !194, file: !193, line: 22, baseType: !197, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "EDKII_VAR_CHECK_REGISTER_SET_VARIABLE_CHECK_HANDLER", file: !111, line: 39, baseType: !198)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DISubroutineType(types: !200)
!200 = !{!36, !201}
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "VAR_CHECK_SET_VARIABLE_CHECK_HANDLER", file: !111, line: 20, baseType: !180)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "SmmVariablePropertySet", scope: !194, file: !193, line: 23, baseType: !203, size: 64, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "EDKII_VAR_CHECK_VARIABLE_PROPERTY_SET", file: !111, line: 85, baseType: !204)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DISubroutineType(types: !206)
!206 = !{!36, !24, !171, !207}
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "SmmVariablePropertyGet", scope: !194, file: !193, line: 24, baseType: !209, size: 64, offset: 128)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "EDKII_VAR_CHECK_VARIABLE_PROPERTY_GET", file: !111, line: 105, baseType: !204)
!210 = !DIGlobalVariableExpression(var: !211, expr: !DIExpression(DW_OP_constu, 2, DW_OP_stack_value))
!211 = distinct !DIGlobalVariable(name: "ByProtocol", scope: !2, file: !167, line: 1473, type: !156, isLocal: true, isDefinition: true)
!212 = !DIGlobalVariableExpression(var: !213, expr: !DIExpression(DW_OP_constu, 0, DW_OP_stack_value))
!213 = distinct !DIGlobalVariable(name: "EFI_NATIVE_INTERFACE", scope: !2, file: !167, line: 1148, type: !156, isLocal: true, isDefinition: true)
!214 = !DIGlobalVariableExpression(var: !215, expr: !DIExpression(DW_OP_constu, 6, DW_OP_stack_value))
!215 = distinct !DIGlobalVariable(name: "EfiRuntimeServicesData", scope: !2, file: !216, line: 70, type: !156, isLocal: true, isDefinition: true)
!216 = !DIFile(filename: "MdePkg/Include/Uefi/UefiMultiPhase.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "321376346bf760b12510b9ae9d8f46f8")
!217 = !DIGlobalVariableExpression(var: !218, expr: !DIExpression())
!218 = distinct !DIGlobalVariable(name: "mVariableBufferPayloadSize", scope: !2, file: !152, line: 41, type: !17, isLocal: false, isDefinition: true)
!219 = !{i32 2, !"CodeView", i32 1}
!220 = !{i32 2, !"Debug Info Version", i32 3}
!221 = !{i32 1, !"wchar_size", i32 2}
!222 = !{i32 7, !"PIC Level", i32 2}
!223 = !{i32 1, !"Code Model", i32 1}
!224 = !{i32 7, !"uwtable", i32 1}
!225 = !{i32 1, !"ThinLTO", i32 0}
!226 = !{i32 1, !"EnableSplitLTOUnit", i32 1}
!227 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!228 = distinct !DISubprogram(name: "SecureBootHook", scope: !152, file: !152, line: 52, type: !229, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !231)
!229 = !DISubroutineType(types: !230)
!230 = !{null, !24, !171}
!231 = !{}
!232 = !DILocalVariable(name: "VariableName", arg: 1, scope: !228, file: !152, line: 53, type: !24)
!233 = !DILocation(line: 53, scope: !228)
!234 = !DILocalVariable(name: "VendorGuid", arg: 2, scope: !228, file: !152, line: 54, type: !171)
!235 = !DILocation(line: 54, scope: !228)
!236 = !DILocation(line: 57, scope: !228)
!237 = distinct !DISubprogram(name: "SmmVariableSetVariable", scope: !152, file: !152, line: 80, type: !182, scopeLine: 87, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !231)
!238 = !DILocalVariable(name: "VariableName", arg: 1, scope: !237, file: !152, line: 81, type: !24)
!239 = !DILocation(line: 81, scope: !237)
!240 = !DILocalVariable(name: "VendorGuid", arg: 2, scope: !237, file: !152, line: 82, type: !171)
!241 = !DILocation(line: 82, scope: !237)
!242 = !DILocalVariable(name: "Attributes", arg: 3, scope: !237, file: !152, line: 83, type: !53)
!243 = !DILocation(line: 83, scope: !237)
!244 = !DILocalVariable(name: "DataSize", arg: 4, scope: !237, file: !152, line: 84, type: !17)
!245 = !DILocation(line: 84, scope: !237)
!246 = !DILocalVariable(name: "Data", arg: 5, scope: !237, file: !152, line: 85, type: !13)
!247 = !DILocation(line: 85, scope: !237)
!248 = !DILocalVariable(name: "Status", scope: !237, file: !152, line: 88, type: !36)
!249 = !DILocation(line: 88, scope: !237)
!250 = !DILocation(line: 93, scope: !237)
!251 = !DILocation(line: 94, scope: !237)
!252 = !DILocation(line: 101, scope: !237)
!253 = !DILocation(line: 102, scope: !237)
!254 = distinct !DISubprogram(name: "AtRuntime", scope: !152, file: !152, line: 124, type: !255, scopeLine: 127, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !231)
!255 = !DISubroutineType(types: !256)
!256 = !{!27}
!257 = !DILocation(line: 128, scope: !254)
!258 = distinct !DISubprogram(name: "InitializeLock", scope: !152, file: !152, line: 148, type: !259, scopeLine: 152, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !231)
!259 = !DISubroutineType(types: !260)
!260 = !{!261, !261, !266}
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_LOCK", file: !6, line: 62, baseType: !263)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_LOCK", file: !6, line: 58, size: 192, elements: !264)
!264 = !{!265, !267, !268}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "Tpl", scope: !263, file: !6, line: 59, baseType: !266, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TPL", file: !37, line: 41, baseType: !17)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "OwnerTpl", scope: !263, file: !6, line: 60, baseType: !266, size: 64, offset: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "Lock", scope: !263, file: !6, line: 61, baseType: !269, size: 32, offset: 128)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_LOCK_STATE", file: !6, line: 53, baseType: !5)
!270 = !DILocalVariable(name: "Lock", arg: 1, scope: !258, file: !152, line: 149, type: !261)
!271 = !DILocation(line: 149, scope: !258)
!272 = !DILocalVariable(name: "Priority", arg: 2, scope: !258, file: !152, line: 150, type: !266)
!273 = !DILocation(line: 150, scope: !258)
!274 = !DILocation(line: 153, scope: !258)
!275 = distinct !DISubprogram(name: "AcquireLockOnlyAtBootTime", scope: !152, file: !152, line: 169, type: !276, scopeLine: 172, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !231)
!276 = !DISubroutineType(types: !277)
!277 = !{null, !261}
!278 = !DILocalVariable(name: "Lock", arg: 1, scope: !275, file: !152, line: 170, type: !261)
!279 = !DILocation(line: 170, scope: !275)
!280 = !DILocation(line: 173, scope: !275)
!281 = distinct !DISubprogram(name: "ReleaseLockOnlyAtBootTime", scope: !152, file: !152, line: 188, type: !276, scopeLine: 191, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !231)
!282 = !DILocalVariable(name: "Lock", arg: 1, scope: !281, file: !152, line: 189, type: !261)
!283 = !DILocation(line: 189, scope: !281)
!284 = !DILocation(line: 192, scope: !281)
!285 = distinct !DISubprogram(name: "GetFtwProtocol", scope: !152, file: !152, line: 205, type: !286, scopeLine: 208, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !231)
!286 = !DISubroutineType(types: !287)
!287 = !{!36, !14}
!288 = !DILocalVariable(name: "FtwProtocol", arg: 1, scope: !285, file: !152, line: 206, type: !14)
!289 = !DILocation(line: 206, scope: !285)
!290 = !DILocalVariable(name: "Status", scope: !285, file: !152, line: 209, type: !36)
!291 = !DILocation(line: 209, scope: !285)
!292 = !DILocation(line: 214, scope: !285)
!293 = !DILocation(line: 219, scope: !285)
!294 = distinct !DISubprogram(name: "GetFvbByHandle", scope: !152, file: !152, line: 235, type: !295, scopeLine: 239, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !231)
!295 = !DISubroutineType(types: !296)
!296 = !{!36, !297, !298}
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_HANDLE", file: !37, line: 33, baseType: !13)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FIRMWARE_VOLUME_BLOCK_PROTOCOL", file: !301, line: 26, baseType: !302)
!301 = !DIFile(filename: "MdePkg/Include/Protocol/FirmwareVolumeBlock.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "a4ca798c296dfa7ab68d1d2b85c3dd17")
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_FIRMWARE_VOLUME_BLOCK_PROTOCOL", file: !301, line: 335, size: 512, elements: !303)
!303 = !{!304, !315, !317, !324, !330, !335, !337, !342}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "GetAttributes", scope: !302, file: !301, line: 336, baseType: !305, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FVB_GET_ATTRIBUTES", file: !301, line: 47, baseType: !306)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = !DISubroutineType(types: !308)
!308 = !{!36, !309, !312}
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !311)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FIRMWARE_VOLUME_BLOCK2_PROTOCOL", file: !301, line: 28, baseType: !300)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FVB_ATTRIBUTES_2", file: !314, line: 30, baseType: !53)
!314 = !DIFile(filename: "MdePkg/Include/Pi/PiFirmwareVolume.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "9a02bea8b9edc1b887ae684c8d405b44")
!315 = !DIDerivedType(tag: DW_TAG_member, name: "SetAttributes", scope: !302, file: !301, line: 337, baseType: !316, size: 64, offset: 64)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FVB_SET_ATTRIBUTES", file: !301, line: 76, baseType: !306)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "GetPhysicalAddress", scope: !302, file: !301, line: 338, baseType: !318, size: 64, offset: 128)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FVB_GET_PHYSICAL_ADDRESS", file: !301, line: 100, baseType: !319)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DISubroutineType(types: !321)
!321 = !{!36, !309, !322}
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_PHYSICAL_ADDRESS", file: !37, line: 50, baseType: !19)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "GetBlockSize", scope: !302, file: !301, line: 339, baseType: !325, size: 64, offset: 192)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FVB_GET_BLOCK_SIZE", file: !301, line: 133, baseType: !326)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DISubroutineType(types: !328)
!328 = !{!36, !309, !329, !173, !173}
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_LBA", file: !37, line: 45, baseType: !19)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "Read", scope: !302, file: !301, line: 340, baseType: !331, size: 64, offset: 256)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FVB_READ", file: !301, line: 189, baseType: !332)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DISubroutineType(types: !334)
!334 = !{!36, !309, !329, !17, !173, !66}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "Write", scope: !302, file: !301, line: 341, baseType: !336, size: 64, offset: 320)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FVB_WRITE", file: !301, line: 258, baseType: !332)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "EraseBlocks", scope: !302, file: !301, line: 342, baseType: !338, size: 64, offset: 384)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FVB_ERASE_BLOCKS", file: !301, line: 321, baseType: !339)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DISubroutineType(types: !341)
!341 = !{!36, !309, null}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "ParentHandle", scope: !302, file: !301, line: 346, baseType: !297, size: 64, offset: 448)
!343 = !DILocalVariable(name: "FvBlockHandle", arg: 1, scope: !294, file: !152, line: 236, type: !297)
!344 = !DILocation(line: 236, scope: !294)
!345 = !DILocalVariable(name: "FvBlock", arg: 2, scope: !294, file: !152, line: 237, type: !298)
!346 = !DILocation(line: 237, scope: !294)
!347 = !DILocation(line: 243, scope: !294)
!348 = distinct !DISubprogram(name: "GetFvbCountAndBuffer", scope: !152, file: !152, line: 266, type: !349, scopeLine: 270, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !231)
!349 = !DISubroutineType(types: !350)
!350 = !{!36, !173, !351}
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!353 = !DILocalVariable(name: "NumberHandles", arg: 1, scope: !348, file: !152, line: 267, type: !173)
!354 = !DILocation(line: 267, scope: !348)
!355 = !DILocalVariable(name: "Buffer", arg: 2, scope: !348, file: !152, line: 268, type: !351)
!356 = !DILocation(line: 268, scope: !348)
!357 = !DILocalVariable(name: "Status", scope: !348, file: !152, line: 271, type: !36)
!358 = !DILocation(line: 271, scope: !348)
!359 = !DILocalVariable(name: "BufferSize", scope: !348, file: !152, line: 272, type: !17)
!360 = !DILocation(line: 272, scope: !348)
!361 = !DILocation(line: 274, scope: !348)
!362 = !DILocation(line: 275, scope: !363)
!363 = distinct !DILexicalBlock(scope: !364, file: !152, line: 274)
!364 = distinct !DILexicalBlock(scope: !348, file: !152, line: 274)
!365 = !DILocation(line: 278, scope: !348)
!366 = !DILocation(line: 279, scope: !348)
!367 = !DILocation(line: 280, scope: !348)
!368 = !DILocation(line: 281, scope: !348)
!369 = !DILocation(line: 288, scope: !348)
!370 = !DILocation(line: 289, scope: !371)
!371 = distinct !DILexicalBlock(scope: !372, file: !152, line: 288)
!372 = distinct !DILexicalBlock(scope: !348, file: !152, line: 288)
!373 = !DILocation(line: 292, scope: !348)
!374 = !DILocation(line: 293, scope: !348)
!375 = !DILocation(line: 294, scope: !376)
!376 = distinct !DILexicalBlock(scope: !377, file: !152, line: 293)
!377 = distinct !DILexicalBlock(scope: !348, file: !152, line: 293)
!378 = !DILocation(line: 297, scope: !348)
!379 = !DILocation(line: 305, scope: !348)
!380 = !DILocation(line: 306, scope: !348)
!381 = !DILocation(line: 307, scope: !382)
!382 = distinct !DILexicalBlock(scope: !383, file: !152, line: 306)
!383 = distinct !DILexicalBlock(scope: !348, file: !152, line: 306)
!384 = !DILocation(line: 308, scope: !382)
!385 = !DILocation(line: 309, scope: !382)
!386 = !DILocation(line: 310, scope: !382)
!387 = !DILocation(line: 312, scope: !348)
!388 = !DILocation(line: 313, scope: !348)
!389 = distinct !DISubprogram(name: "SmmVariableGetStatistics", scope: !152, file: !152, line: 336, type: !390, scopeLine: 340, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !231)
!390 = !DISubroutineType(types: !391)
!391 = !{!36, !87, !173}
!392 = !DILocalVariable(name: "InfoEntry", arg: 1, scope: !389, file: !152, line: 337, type: !87)
!393 = !DILocation(line: 337, scope: !389)
!394 = !DILocalVariable(name: "InfoSize", arg: 2, scope: !389, file: !152, line: 338, type: !173)
!395 = !DILocation(line: 338, scope: !389)
!396 = !DILocalVariable(name: "VariableInfo", scope: !389, file: !152, line: 341, type: !87)
!397 = !DILocation(line: 341, scope: !389)
!398 = !DILocalVariable(name: "NameSize", scope: !389, file: !152, line: 342, type: !17)
!399 = !DILocation(line: 342, scope: !389)
!400 = !DILocalVariable(name: "StatisticsInfoSize", scope: !389, file: !152, line: 343, type: !17)
!401 = !DILocation(line: 343, scope: !389)
!402 = !DILocalVariable(name: "InfoName", scope: !389, file: !152, line: 344, type: !24)
!403 = !DILocation(line: 344, scope: !389)
!404 = !DILocalVariable(name: "InfoNameMaxSize", scope: !389, file: !152, line: 345, type: !17)
!405 = !DILocation(line: 345, scope: !389)
!406 = !DILocalVariable(name: "VendorGuid", scope: !389, file: !152, line: 346, type: !48)
!407 = !DILocation(line: 346, scope: !389)
!408 = !DILocation(line: 348, scope: !389)
!409 = !DILocation(line: 349, scope: !410)
!410 = distinct !DILexicalBlock(scope: !411, file: !152, line: 348)
!411 = distinct !DILexicalBlock(scope: !389, file: !152, line: 348)
!412 = !DILocation(line: 352, scope: !389)
!413 = !DILocation(line: 353, scope: !389)
!414 = !DILocation(line: 354, scope: !415)
!415 = distinct !DILexicalBlock(scope: !416, file: !152, line: 353)
!416 = distinct !DILexicalBlock(scope: !389, file: !152, line: 353)
!417 = !DILocation(line: 357, scope: !389)
!418 = !DILocation(line: 358, scope: !389)
!419 = !DILocation(line: 359, scope: !420)
!420 = distinct !DILexicalBlock(scope: !421, file: !152, line: 358)
!421 = distinct !DILexicalBlock(scope: !389, file: !152, line: 358)
!422 = !DILocation(line: 360, scope: !420)
!423 = !DILocation(line: 363, scope: !389)
!424 = !DILocation(line: 364, scope: !389)
!425 = !DILocation(line: 366, scope: !389)
!426 = !DILocation(line: 368, scope: !389)
!427 = !DILocation(line: 372, scope: !428)
!428 = distinct !DILexicalBlock(scope: !429, file: !152, line: 368)
!429 = distinct !DILexicalBlock(scope: !389, file: !152, line: 368)
!430 = !DILocation(line: 373, scope: !428)
!431 = !DILocation(line: 374, scope: !428)
!432 = !DILocation(line: 375, scope: !433)
!433 = distinct !DILexicalBlock(scope: !434, file: !152, line: 374)
!434 = distinct !DILexicalBlock(scope: !428, file: !152, line: 374)
!435 = !DILocation(line: 376, scope: !433)
!436 = !DILocation(line: 379, scope: !428)
!437 = !DILocation(line: 380, scope: !428)
!438 = !DILocation(line: 381, scope: !428)
!439 = !DILocation(line: 382, scope: !428)
!440 = !DILocation(line: 388, scope: !389)
!441 = !DILocation(line: 389, scope: !442)
!442 = distinct !DILexicalBlock(scope: !389, file: !152, line: 388)
!443 = !DILocation(line: 390, scope: !444)
!444 = distinct !DILexicalBlock(scope: !445, file: !152, line: 389)
!445 = distinct !DILexicalBlock(scope: !442, file: !152, line: 389)
!446 = !DILocation(line: 391, scope: !444)
!447 = !DILocation(line: 392, scope: !448)
!448 = distinct !DILexicalBlock(scope: !449, file: !152, line: 391)
!449 = distinct !DILexicalBlock(scope: !444, file: !152, line: 391)
!450 = !DILocation(line: 396, scope: !451)
!451 = distinct !DILexicalBlock(scope: !452, file: !152, line: 392)
!452 = distinct !DILexicalBlock(scope: !448, file: !152, line: 392)
!453 = !DILocation(line: 397, scope: !451)
!454 = !DILocation(line: 399, scope: !448)
!455 = !DILocation(line: 400, scope: !444)
!456 = !DILocation(line: 402, scope: !442)
!457 = distinct !{!457, !440, !458, !459}
!458 = !DILocation(line: 403, scope: !389)
!459 = !{!"llvm.loop.mustprogress"}
!460 = !DILocation(line: 405, scope: !389)
!461 = !DILocation(line: 406, scope: !462)
!462 = distinct !DILexicalBlock(scope: !463, file: !152, line: 405)
!463 = distinct !DILexicalBlock(scope: !389, file: !152, line: 405)
!464 = !DILocation(line: 407, scope: !462)
!465 = !DILocation(line: 413, scope: !389)
!466 = !DILocation(line: 414, scope: !389)
!467 = !DILocation(line: 415, scope: !389)
!468 = !DILocation(line: 416, scope: !469)
!469 = distinct !DILexicalBlock(scope: !470, file: !152, line: 415)
!470 = distinct !DILexicalBlock(scope: !389, file: !152, line: 415)
!471 = !DILocation(line: 417, scope: !469)
!472 = !DILocation(line: 420, scope: !389)
!473 = !DILocation(line: 421, scope: !389)
!474 = !DILocation(line: 422, scope: !389)
!475 = !DILocation(line: 424, scope: !389)
!476 = !DILocation(line: 425, scope: !389)
!477 = distinct !DISubprogram(name: "SmmVariableHandler", scope: !152, file: !152, line: 455, type: !478, scopeLine: 461, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !231)
!478 = !DISubroutineType(types: !479)
!479 = !{!36, !297, !480, !13, !173}
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!482 = !DILocalVariable(name: "DispatchHandle", arg: 1, scope: !477, file: !152, line: 456, type: !297)
!483 = !DILocation(line: 456, scope: !477)
!484 = !DILocalVariable(name: "RegisterContext", arg: 2, scope: !477, file: !152, line: 457, type: !480)
!485 = !DILocation(line: 457, scope: !477)
!486 = !DILocalVariable(name: "CommBuffer", arg: 3, scope: !477, file: !152, line: 458, type: !13)
!487 = !DILocation(line: 458, scope: !477)
!488 = !DILocalVariable(name: "CommBufferSize", arg: 4, scope: !477, file: !152, line: 459, type: !173)
!489 = !DILocation(line: 459, scope: !477)
!490 = !DILocalVariable(name: "Status", scope: !477, file: !152, line: 462, type: !36)
!491 = !DILocation(line: 462, scope: !477)
!492 = !DILocalVariable(name: "SmmVariableFunctionHeader", scope: !477, file: !152, line: 463, type: !29)
!493 = !DILocation(line: 463, scope: !477)
!494 = !DILocalVariable(name: "SmmVariableHeader", scope: !477, file: !152, line: 464, type: !43)
!495 = !DILocation(line: 464, scope: !477)
!496 = !DILocalVariable(name: "GetNextVariableName", scope: !477, file: !152, line: 465, type: !67)
!497 = !DILocation(line: 465, scope: !477)
!498 = !DILocalVariable(name: "QueryVariableInfo", scope: !477, file: !152, line: 466, type: !74)
!499 = !DILocation(line: 466, scope: !477)
!500 = !DILocalVariable(name: "GetPayloadSize", scope: !477, file: !152, line: 467, type: !82)
!501 = !DILocation(line: 467, scope: !477)
!502 = !DILocalVariable(name: "RuntimeVariableCacheContext", scope: !477, file: !152, line: 468, type: !120)
!503 = !DILocation(line: 468, scope: !477)
!504 = !DILocalVariable(name: "GetRuntimeCacheInfo", scope: !477, file: !152, line: 469, type: !141)
!505 = !DILocation(line: 469, scope: !477)
!506 = !DILocalVariable(name: "VariableToLock", scope: !477, file: !152, line: 470, type: !101)
!507 = !DILocation(line: 470, scope: !477)
!508 = !DILocalVariable(name: "CommVariableProperty", scope: !477, file: !152, line: 471, type: !103)
!509 = !DILocation(line: 471, scope: !477)
!510 = !DILocalVariable(name: "VariableInfo", scope: !477, file: !152, line: 472, type: !87)
!511 = !DILocation(line: 472, scope: !477)
!512 = !DILocalVariable(name: "VariableCacheContext", scope: !477, file: !152, line: 473, type: !513)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "VARIABLE_RUNTIME_CACHE_CONTEXT", file: !515, line: 77, baseType: !516)
!515 = !DIFile(filename: "MdeModulePkg/Universal/Variable/RuntimeDxe/Variable.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "ca7fb335bb8959c42e84830938018d59")
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VARIABLE_RUNTIME_CACHE_CONTEXT", file: !515, line: 70, size: 576, elements: !517)
!517 = !{!518, !519, !520, !521, !528, !529}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "ReadLock", scope: !516, file: !515, line: 71, baseType: !125, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "PendingUpdate", scope: !516, file: !515, line: 72, baseType: !125, size: 64, offset: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "HobFlushComplete", scope: !516, file: !515, line: 73, baseType: !125, size: 64, offset: 128)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "VariableRuntimeHobCache", scope: !516, file: !515, line: 74, baseType: !522, size: 128, offset: 192)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "VARIABLE_RUNTIME_CACHE", file: !515, line: 68, baseType: !523)
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VARIABLE_RUNTIME_CACHE", file: !515, line: 64, size: 128, elements: !524)
!524 = !{!525, !526, !527}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "PendingUpdateOffset", scope: !523, file: !515, line: 65, baseType: !53, size: 32)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "PendingUpdateLength", scope: !523, file: !515, line: 66, baseType: !53, size: 32, offset: 32)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "Store", scope: !523, file: !515, line: 67, baseType: !129, size: 64, offset: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "VariableRuntimeNvCache", scope: !516, file: !515, line: 75, baseType: !522, size: 128, offset: 320)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "VariableRuntimeVolatileCache", scope: !516, file: !515, line: 76, baseType: !522, size: 128, offset: 448)
!530 = !DILocation(line: 473, scope: !477)
!531 = !DILocalVariable(name: "VariableCache", scope: !477, file: !152, line: 474, type: !129)
!532 = !DILocation(line: 474, scope: !477)
!533 = !DILocalVariable(name: "InfoSize", scope: !477, file: !152, line: 475, type: !17)
!534 = !DILocation(line: 475, scope: !477)
!535 = !DILocalVariable(name: "NameBufferSize", scope: !477, file: !152, line: 476, type: !17)
!536 = !DILocation(line: 476, scope: !477)
!537 = !DILocalVariable(name: "CommBufferPayloadSize", scope: !477, file: !152, line: 477, type: !17)
!538 = !DILocation(line: 477, scope: !477)
!539 = !DILocalVariable(name: "TempCommBufferSize", scope: !477, file: !152, line: 478, type: !17)
!540 = !DILocation(line: 478, scope: !477)
!541 = !DILocation(line: 483, scope: !477)
!542 = !DILocation(line: 484, scope: !543)
!543 = distinct !DILexicalBlock(scope: !544, file: !152, line: 483)
!544 = distinct !DILexicalBlock(scope: !477, file: !152, line: 483)
!545 = !DILocation(line: 487, scope: !477)
!546 = !DILocation(line: 489, scope: !477)
!547 = !DILocation(line: 490, scope: !548)
!548 = distinct !DILexicalBlock(scope: !549, file: !152, line: 489)
!549 = distinct !DILexicalBlock(scope: !477, file: !152, line: 489)
!550 = !DILocation(line: 490, scope: !551)
!551 = distinct !DILexicalBlock(scope: !548, file: !152, line: 490)
!552 = !DILocation(line: 490, scope: !553)
!553 = distinct !DILexicalBlock(scope: !554, file: !152, line: 490)
!554 = distinct !DILexicalBlock(scope: !551, file: !152, line: 490)
!555 = !DILocation(line: 490, scope: !556)
!556 = distinct !DILexicalBlock(scope: !553, file: !152, line: 490)
!557 = !DILocation(line: 490, scope: !558)
!558 = distinct !DILexicalBlock(scope: !559, file: !152, line: 490)
!559 = distinct !DILexicalBlock(scope: !556, file: !152, line: 490)
!560 = !DILocation(line: 491, scope: !548)
!561 = !DILocation(line: 494, scope: !477)
!562 = !DILocation(line: 495, scope: !477)
!563 = !DILocation(line: 496, scope: !564)
!564 = distinct !DILexicalBlock(scope: !565, file: !152, line: 495)
!565 = distinct !DILexicalBlock(scope: !477, file: !152, line: 495)
!566 = !DILocation(line: 496, scope: !567)
!567 = distinct !DILexicalBlock(scope: !564, file: !152, line: 496)
!568 = !DILocation(line: 496, scope: !569)
!569 = distinct !DILexicalBlock(scope: !570, file: !152, line: 496)
!570 = distinct !DILexicalBlock(scope: !567, file: !152, line: 496)
!571 = !DILocation(line: 496, scope: !572)
!572 = distinct !DILexicalBlock(scope: !569, file: !152, line: 496)
!573 = !DILocation(line: 496, scope: !574)
!574 = distinct !DILexicalBlock(scope: !575, file: !152, line: 496)
!575 = distinct !DILexicalBlock(scope: !572, file: !152, line: 496)
!576 = !DILocation(line: 497, scope: !564)
!577 = !DILocation(line: 500, scope: !477)
!578 = !DILocation(line: 501, scope: !579)
!579 = distinct !DILexicalBlock(scope: !580, file: !152, line: 500)
!580 = distinct !DILexicalBlock(scope: !477, file: !152, line: 500)
!581 = !DILocation(line: 501, scope: !582)
!582 = distinct !DILexicalBlock(scope: !579, file: !152, line: 501)
!583 = !DILocation(line: 501, scope: !584)
!584 = distinct !DILexicalBlock(scope: !585, file: !152, line: 501)
!585 = distinct !DILexicalBlock(scope: !582, file: !152, line: 501)
!586 = !DILocation(line: 501, scope: !587)
!587 = distinct !DILexicalBlock(scope: !584, file: !152, line: 501)
!588 = !DILocation(line: 501, scope: !589)
!589 = distinct !DILexicalBlock(scope: !590, file: !152, line: 501)
!590 = distinct !DILexicalBlock(scope: !587, file: !152, line: 501)
!591 = !DILocation(line: 502, scope: !579)
!592 = !DILocation(line: 505, scope: !477)
!593 = !DILocation(line: 506, scope: !477)
!594 = !DILocation(line: 508, scope: !595)
!595 = distinct !DILexicalBlock(scope: !477, file: !152, line: 506)
!596 = !DILocation(line: 509, scope: !597)
!597 = distinct !DILexicalBlock(scope: !598, file: !152, line: 508)
!598 = distinct !DILexicalBlock(scope: !595, file: !152, line: 508)
!599 = !DILocation(line: 509, scope: !600)
!600 = distinct !DILexicalBlock(scope: !597, file: !152, line: 509)
!601 = !DILocation(line: 509, scope: !602)
!602 = distinct !DILexicalBlock(scope: !603, file: !152, line: 509)
!603 = distinct !DILexicalBlock(scope: !600, file: !152, line: 509)
!604 = !DILocation(line: 509, scope: !605)
!605 = distinct !DILexicalBlock(scope: !602, file: !152, line: 509)
!606 = !DILocation(line: 509, scope: !607)
!607 = distinct !DILexicalBlock(scope: !608, file: !152, line: 509)
!608 = distinct !DILexicalBlock(scope: !605, file: !152, line: 509)
!609 = !DILocation(line: 510, scope: !597)
!610 = !DILocation(line: 516, scope: !595)
!611 = !DILocation(line: 517, scope: !595)
!612 = !DILocation(line: 518, scope: !595)
!613 = !DILocation(line: 524, scope: !614)
!614 = distinct !DILexicalBlock(scope: !615, file: !152, line: 520)
!615 = distinct !DILexicalBlock(scope: !595, file: !152, line: 518)
!616 = !DILocation(line: 525, scope: !614)
!617 = !DILocation(line: 528, scope: !595)
!618 = !DILocation(line: 534, scope: !595)
!619 = !DILocation(line: 535, scope: !620)
!620 = distinct !DILexicalBlock(scope: !621, file: !152, line: 534)
!621 = distinct !DILexicalBlock(scope: !595, file: !152, line: 534)
!622 = !DILocation(line: 535, scope: !623)
!623 = distinct !DILexicalBlock(scope: !620, file: !152, line: 535)
!624 = !DILocation(line: 535, scope: !625)
!625 = distinct !DILexicalBlock(scope: !626, file: !152, line: 535)
!626 = distinct !DILexicalBlock(scope: !623, file: !152, line: 535)
!627 = !DILocation(line: 535, scope: !628)
!628 = distinct !DILexicalBlock(scope: !625, file: !152, line: 535)
!629 = !DILocation(line: 535, scope: !630)
!630 = distinct !DILexicalBlock(scope: !631, file: !152, line: 535)
!631 = distinct !DILexicalBlock(scope: !628, file: !152, line: 535)
!632 = !DILocation(line: 536, scope: !620)
!633 = !DILocation(line: 537, scope: !620)
!634 = !DILocation(line: 545, scope: !595)
!635 = !DILocation(line: 546, scope: !595)
!636 = !DILocation(line: 550, scope: !637)
!637 = distinct !DILexicalBlock(scope: !638, file: !152, line: 546)
!638 = distinct !DILexicalBlock(scope: !595, file: !152, line: 546)
!639 = !DILocation(line: 551, scope: !637)
!640 = !DILocation(line: 554, scope: !595)
!641 = !DILocation(line: 561, scope: !595)
!642 = !DILocation(line: 562, scope: !595)
!643 = !DILocation(line: 565, scope: !595)
!644 = !DILocation(line: 566, scope: !645)
!645 = distinct !DILexicalBlock(scope: !646, file: !152, line: 565)
!646 = distinct !DILexicalBlock(scope: !595, file: !152, line: 565)
!647 = !DILocation(line: 566, scope: !648)
!648 = distinct !DILexicalBlock(scope: !645, file: !152, line: 566)
!649 = !DILocation(line: 566, scope: !650)
!650 = distinct !DILexicalBlock(scope: !651, file: !152, line: 566)
!651 = distinct !DILexicalBlock(scope: !648, file: !152, line: 566)
!652 = !DILocation(line: 566, scope: !653)
!653 = distinct !DILexicalBlock(scope: !650, file: !152, line: 566)
!654 = !DILocation(line: 566, scope: !655)
!655 = distinct !DILexicalBlock(scope: !656, file: !152, line: 566)
!656 = distinct !DILexicalBlock(scope: !653, file: !152, line: 566)
!657 = !DILocation(line: 567, scope: !645)
!658 = !DILocation(line: 573, scope: !595)
!659 = !DILocation(line: 574, scope: !595)
!660 = !DILocation(line: 575, scope: !595)
!661 = !DILocation(line: 579, scope: !662)
!662 = distinct !DILexicalBlock(scope: !663, file: !152, line: 575)
!663 = distinct !DILexicalBlock(scope: !595, file: !152, line: 575)
!664 = !DILocation(line: 580, scope: !662)
!665 = !DILocation(line: 583, scope: !595)
!666 = !DILocation(line: 588, scope: !595)
!667 = !DILocation(line: 589, scope: !668)
!668 = distinct !DILexicalBlock(scope: !669, file: !152, line: 588)
!669 = distinct !DILexicalBlock(scope: !595, file: !152, line: 588)
!670 = !DILocation(line: 589, scope: !671)
!671 = distinct !DILexicalBlock(scope: !668, file: !152, line: 589)
!672 = !DILocation(line: 589, scope: !673)
!673 = distinct !DILexicalBlock(scope: !674, file: !152, line: 589)
!674 = distinct !DILexicalBlock(scope: !671, file: !152, line: 589)
!675 = !DILocation(line: 589, scope: !676)
!676 = distinct !DILexicalBlock(scope: !673, file: !152, line: 589)
!677 = !DILocation(line: 589, scope: !678)
!678 = distinct !DILexicalBlock(scope: !679, file: !152, line: 589)
!679 = distinct !DILexicalBlock(scope: !676, file: !152, line: 589)
!680 = !DILocation(line: 590, scope: !668)
!681 = !DILocation(line: 591, scope: !668)
!682 = !DILocation(line: 594, scope: !595)
!683 = !DILocation(line: 595, scope: !595)
!684 = !DILocation(line: 599, scope: !685)
!685 = distinct !DILexicalBlock(scope: !686, file: !152, line: 595)
!686 = distinct !DILexicalBlock(scope: !595, file: !152, line: 595)
!687 = !DILocation(line: 600, scope: !685)
!688 = !DILocation(line: 603, scope: !595)
!689 = !DILocation(line: 608, scope: !595)
!690 = !DILocation(line: 609, scope: !595)
!691 = !DILocation(line: 612, scope: !595)
!692 = !DILocation(line: 613, scope: !693)
!693 = distinct !DILexicalBlock(scope: !694, file: !152, line: 612)
!694 = distinct !DILexicalBlock(scope: !595, file: !152, line: 612)
!695 = !DILocation(line: 613, scope: !696)
!696 = distinct !DILexicalBlock(scope: !693, file: !152, line: 613)
!697 = !DILocation(line: 613, scope: !698)
!698 = distinct !DILexicalBlock(scope: !699, file: !152, line: 613)
!699 = distinct !DILexicalBlock(scope: !696, file: !152, line: 613)
!700 = !DILocation(line: 613, scope: !701)
!701 = distinct !DILexicalBlock(scope: !698, file: !152, line: 613)
!702 = !DILocation(line: 613, scope: !703)
!703 = distinct !DILexicalBlock(scope: !704, file: !152, line: 613)
!704 = distinct !DILexicalBlock(scope: !701, file: !152, line: 613)
!705 = !DILocation(line: 614, scope: !693)
!706 = !DILocation(line: 620, scope: !595)
!707 = !DILocation(line: 621, scope: !595)
!708 = !DILocation(line: 622, scope: !595)
!709 = !DILocation(line: 628, scope: !710)
!710 = distinct !DILexicalBlock(scope: !711, file: !152, line: 624)
!711 = distinct !DILexicalBlock(scope: !595, file: !152, line: 622)
!712 = !DILocation(line: 629, scope: !710)
!713 = !DILocation(line: 632, scope: !595)
!714 = !DILocation(line: 639, scope: !595)
!715 = !DILocation(line: 640, scope: !716)
!716 = distinct !DILexicalBlock(scope: !717, file: !152, line: 639)
!717 = distinct !DILexicalBlock(scope: !595, file: !152, line: 639)
!718 = !DILocation(line: 640, scope: !719)
!719 = distinct !DILexicalBlock(scope: !716, file: !152, line: 640)
!720 = !DILocation(line: 640, scope: !721)
!721 = distinct !DILexicalBlock(scope: !722, file: !152, line: 640)
!722 = distinct !DILexicalBlock(scope: !719, file: !152, line: 640)
!723 = !DILocation(line: 640, scope: !724)
!724 = distinct !DILexicalBlock(scope: !721, file: !152, line: 640)
!725 = !DILocation(line: 640, scope: !726)
!726 = distinct !DILexicalBlock(scope: !727, file: !152, line: 640)
!727 = distinct !DILexicalBlock(scope: !724, file: !152, line: 640)
!728 = !DILocation(line: 641, scope: !716)
!729 = !DILocation(line: 642, scope: !716)
!730 = !DILocation(line: 650, scope: !595)
!731 = !DILocation(line: 651, scope: !595)
!732 = !DILocation(line: 655, scope: !733)
!733 = distinct !DILexicalBlock(scope: !734, file: !152, line: 651)
!734 = distinct !DILexicalBlock(scope: !595, file: !152, line: 651)
!735 = !DILocation(line: 656, scope: !733)
!736 = !DILocation(line: 659, scope: !595)
!737 = !DILocation(line: 666, scope: !595)
!738 = !DILocation(line: 669, scope: !595)
!739 = !DILocation(line: 670, scope: !740)
!740 = distinct !DILexicalBlock(scope: !741, file: !152, line: 669)
!741 = distinct !DILexicalBlock(scope: !595, file: !152, line: 669)
!742 = !DILocation(line: 670, scope: !743)
!743 = distinct !DILexicalBlock(scope: !740, file: !152, line: 670)
!744 = !DILocation(line: 670, scope: !745)
!745 = distinct !DILexicalBlock(scope: !746, file: !152, line: 670)
!746 = distinct !DILexicalBlock(scope: !743, file: !152, line: 670)
!747 = !DILocation(line: 670, scope: !748)
!748 = distinct !DILexicalBlock(scope: !745, file: !152, line: 670)
!749 = !DILocation(line: 670, scope: !750)
!750 = distinct !DILexicalBlock(scope: !751, file: !152, line: 670)
!751 = distinct !DILexicalBlock(scope: !748, file: !152, line: 670)
!752 = !DILocation(line: 671, scope: !740)
!753 = !DILocation(line: 674, scope: !595)
!754 = !DILocation(line: 676, scope: !595)
!755 = !DILocation(line: 682, scope: !595)
!756 = !DILocation(line: 685, scope: !595)
!757 = !DILocation(line: 686, scope: !758)
!758 = distinct !DILexicalBlock(scope: !759, file: !152, line: 685)
!759 = distinct !DILexicalBlock(scope: !595, file: !152, line: 685)
!760 = !DILocation(line: 686, scope: !761)
!761 = distinct !DILexicalBlock(scope: !758, file: !152, line: 686)
!762 = !DILocation(line: 686, scope: !763)
!763 = distinct !DILexicalBlock(scope: !764, file: !152, line: 686)
!764 = distinct !DILexicalBlock(scope: !761, file: !152, line: 686)
!765 = !DILocation(line: 686, scope: !766)
!766 = distinct !DILexicalBlock(scope: !763, file: !152, line: 686)
!767 = !DILocation(line: 686, scope: !768)
!768 = distinct !DILexicalBlock(scope: !769, file: !152, line: 686)
!769 = distinct !DILexicalBlock(scope: !766, file: !152, line: 686)
!770 = !DILocation(line: 687, scope: !758)
!771 = !DILocation(line: 690, scope: !595)
!772 = !DILocation(line: 691, scope: !595)
!773 = !DILocation(line: 692, scope: !595)
!774 = !DILocation(line: 693, scope: !595)
!775 = !DILocation(line: 696, scope: !595)
!776 = !DILocation(line: 697, scope: !777)
!777 = distinct !DILexicalBlock(scope: !778, file: !152, line: 696)
!778 = distinct !DILexicalBlock(scope: !595, file: !152, line: 696)
!779 = !DILocation(line: 698, scope: !777)
!780 = !DILocation(line: 701, scope: !595)
!781 = !DILocation(line: 702, scope: !782)
!782 = distinct !DILexicalBlock(scope: !783, file: !152, line: 701)
!783 = distinct !DILexicalBlock(scope: !595, file: !152, line: 701)
!784 = !DILocation(line: 703, scope: !782)
!785 = !DILocation(line: 704, scope: !782)
!786 = !DILocation(line: 704, scope: !787)
!787 = distinct !DILexicalBlock(scope: !782, file: !152, line: 704)
!788 = !DILocation(line: 704, scope: !789)
!789 = distinct !DILexicalBlock(scope: !790, file: !152, line: 704)
!790 = distinct !DILexicalBlock(scope: !787, file: !152, line: 704)
!791 = !DILocation(line: 704, scope: !792)
!792 = distinct !DILexicalBlock(scope: !793, file: !152, line: 704)
!793 = distinct !DILexicalBlock(scope: !789, file: !152, line: 704)
!794 = !DILocation(line: 704, scope: !795)
!795 = distinct !DILexicalBlock(scope: !792, file: !152, line: 704)
!796 = !DILocation(line: 704, scope: !797)
!797 = distinct !DILexicalBlock(scope: !798, file: !152, line: 704)
!798 = distinct !DILexicalBlock(scope: !795, file: !152, line: 704)
!799 = !DILocation(line: 704, scope: !800)
!800 = distinct !DILexicalBlock(scope: !797, file: !152, line: 704)
!801 = !DILocation(line: 704, scope: !802)
!802 = distinct !DILexicalBlock(scope: !803, file: !152, line: 704)
!803 = distinct !DILexicalBlock(scope: !800, file: !152, line: 704)
!804 = !DILocation(line: 705, scope: !782)
!805 = !DILocation(line: 706, scope: !782)
!806 = !DILocation(line: 710, scope: !782)
!807 = !DILocation(line: 711, scope: !782)
!808 = !DILocation(line: 713, scope: !595)
!809 = !DILocation(line: 714, scope: !595)
!810 = !DILocation(line: 715, scope: !595)
!811 = !DILocation(line: 718, scope: !595)
!812 = !DILocation(line: 719, scope: !595)
!813 = !DILocation(line: 720, scope: !595)
!814 = !DILocation(line: 723, scope: !595)
!815 = !DILocation(line: 724, scope: !595)
!816 = !DILocation(line: 736, scope: !595)
!817 = !DILocation(line: 737, scope: !595)
!818 = !DILocation(line: 738, scope: !595)
!819 = !DILocation(line: 741, scope: !595)
!820 = !DILocation(line: 742, scope: !821)
!821 = distinct !DILexicalBlock(scope: !822, file: !152, line: 741)
!822 = distinct !DILexicalBlock(scope: !595, file: !152, line: 741)
!823 = !DILocation(line: 743, scope: !821)
!824 = !DILocation(line: 744, scope: !825)
!825 = distinct !DILexicalBlock(scope: !822, file: !152, line: 743)
!826 = !DILocation(line: 745, scope: !825)
!827 = !DILocation(line: 750, scope: !825)
!828 = !DILocation(line: 752, scope: !595)
!829 = !DILocation(line: 754, scope: !595)
!830 = !DILocation(line: 755, scope: !831)
!831 = distinct !DILexicalBlock(scope: !832, file: !152, line: 754)
!832 = distinct !DILexicalBlock(scope: !595, file: !152, line: 754)
!833 = !DILocation(line: 756, scope: !831)
!834 = !DILocation(line: 757, scope: !835)
!835 = distinct !DILexicalBlock(scope: !832, file: !152, line: 756)
!836 = !DILocation(line: 758, scope: !835)
!837 = !DILocation(line: 763, scope: !835)
!838 = !DILocation(line: 765, scope: !595)
!839 = !DILocation(line: 767, scope: !595)
!840 = !DILocation(line: 768, scope: !841)
!841 = distinct !DILexicalBlock(scope: !842, file: !152, line: 767)
!842 = distinct !DILexicalBlock(scope: !595, file: !152, line: 767)
!843 = !DILocation(line: 768, scope: !844)
!844 = distinct !DILexicalBlock(scope: !841, file: !152, line: 768)
!845 = !DILocation(line: 768, scope: !846)
!846 = distinct !DILexicalBlock(scope: !847, file: !152, line: 768)
!847 = distinct !DILexicalBlock(scope: !844, file: !152, line: 768)
!848 = !DILocation(line: 768, scope: !849)
!849 = distinct !DILexicalBlock(scope: !846, file: !152, line: 768)
!850 = !DILocation(line: 768, scope: !851)
!851 = distinct !DILexicalBlock(scope: !852, file: !152, line: 768)
!852 = distinct !DILexicalBlock(scope: !849, file: !152, line: 768)
!853 = !DILocation(line: 769, scope: !841)
!854 = !DILocation(line: 775, scope: !595)
!855 = !DILocation(line: 776, scope: !595)
!856 = !DILocation(line: 777, scope: !595)
!857 = !DILocation(line: 781, scope: !858)
!858 = distinct !DILexicalBlock(scope: !859, file: !152, line: 777)
!859 = distinct !DILexicalBlock(scope: !595, file: !152, line: 777)
!860 = !DILocation(line: 782, scope: !858)
!861 = !DILocation(line: 785, scope: !595)
!862 = !DILocation(line: 790, scope: !595)
!863 = !DILocation(line: 791, scope: !864)
!864 = distinct !DILexicalBlock(scope: !865, file: !152, line: 790)
!865 = distinct !DILexicalBlock(scope: !595, file: !152, line: 790)
!866 = !DILocation(line: 791, scope: !867)
!867 = distinct !DILexicalBlock(scope: !864, file: !152, line: 791)
!868 = !DILocation(line: 791, scope: !869)
!869 = distinct !DILexicalBlock(scope: !870, file: !152, line: 791)
!870 = distinct !DILexicalBlock(scope: !867, file: !152, line: 791)
!871 = !DILocation(line: 791, scope: !872)
!872 = distinct !DILexicalBlock(scope: !869, file: !152, line: 791)
!873 = !DILocation(line: 791, scope: !874)
!874 = distinct !DILexicalBlock(scope: !875, file: !152, line: 791)
!875 = distinct !DILexicalBlock(scope: !872, file: !152, line: 791)
!876 = !DILocation(line: 792, scope: !864)
!877 = !DILocation(line: 793, scope: !864)
!878 = !DILocation(line: 801, scope: !595)
!879 = !DILocation(line: 802, scope: !595)
!880 = !DILocation(line: 806, scope: !881)
!881 = distinct !DILexicalBlock(scope: !882, file: !152, line: 802)
!882 = distinct !DILexicalBlock(scope: !595, file: !152, line: 802)
!883 = !DILocation(line: 807, scope: !881)
!884 = !DILocation(line: 810, scope: !595)
!885 = !DILocation(line: 815, scope: !595)
!886 = !DILocation(line: 816, scope: !595)
!887 = !DILocation(line: 818, scope: !595)
!888 = !DILocation(line: 819, scope: !889)
!889 = distinct !DILexicalBlock(scope: !890, file: !152, line: 818)
!890 = distinct !DILexicalBlock(scope: !595, file: !152, line: 818)
!891 = !DILocation(line: 819, scope: !892)
!892 = distinct !DILexicalBlock(scope: !889, file: !152, line: 819)
!893 = !DILocation(line: 819, scope: !894)
!894 = distinct !DILexicalBlock(scope: !895, file: !152, line: 819)
!895 = distinct !DILexicalBlock(scope: !892, file: !152, line: 819)
!896 = !DILocation(line: 819, scope: !897)
!897 = distinct !DILexicalBlock(scope: !894, file: !152, line: 819)
!898 = !DILocation(line: 819, scope: !899)
!899 = distinct !DILexicalBlock(scope: !900, file: !152, line: 819)
!900 = distinct !DILexicalBlock(scope: !897, file: !152, line: 819)
!901 = !DILocation(line: 820, scope: !889)
!902 = !DILocation(line: 821, scope: !889)
!903 = !DILocation(line: 824, scope: !595)
!904 = !DILocation(line: 825, scope: !905)
!905 = distinct !DILexicalBlock(scope: !906, file: !152, line: 824)
!906 = distinct !DILexicalBlock(scope: !595, file: !152, line: 824)
!907 = !DILocation(line: 825, scope: !908)
!908 = distinct !DILexicalBlock(scope: !905, file: !152, line: 825)
!909 = !DILocation(line: 825, scope: !910)
!910 = distinct !DILexicalBlock(scope: !911, file: !152, line: 825)
!911 = distinct !DILexicalBlock(scope: !908, file: !152, line: 825)
!912 = !DILocation(line: 825, scope: !913)
!913 = distinct !DILexicalBlock(scope: !910, file: !152, line: 825)
!914 = !DILocation(line: 825, scope: !915)
!915 = distinct !DILexicalBlock(scope: !916, file: !152, line: 825)
!916 = distinct !DILexicalBlock(scope: !913, file: !152, line: 825)
!917 = !DILocation(line: 826, scope: !905)
!918 = !DILocation(line: 827, scope: !905)
!919 = !DILocation(line: 833, scope: !595)
!920 = !DILocation(line: 834, scope: !595)
!921 = !DILocation(line: 839, scope: !595)
!922 = !DILocation(line: 845, scope: !923)
!923 = distinct !DILexicalBlock(scope: !924, file: !152, line: 844)
!924 = distinct !DILexicalBlock(scope: !595, file: !152, line: 839)
!925 = !DILocation(line: 845, scope: !926)
!926 = distinct !DILexicalBlock(scope: !923, file: !152, line: 845)
!927 = !DILocation(line: 845, scope: !928)
!928 = distinct !DILexicalBlock(scope: !929, file: !152, line: 845)
!929 = distinct !DILexicalBlock(scope: !926, file: !152, line: 845)
!930 = !DILocation(line: 845, scope: !931)
!931 = distinct !DILexicalBlock(scope: !928, file: !152, line: 845)
!932 = !DILocation(line: 845, scope: !933)
!933 = distinct !DILexicalBlock(scope: !934, file: !152, line: 845)
!934 = distinct !DILexicalBlock(scope: !931, file: !152, line: 845)
!935 = !DILocation(line: 846, scope: !923)
!936 = !DILocation(line: 847, scope: !923)
!937 = !DILocation(line: 853, scope: !595)
!938 = !DILocation(line: 858, scope: !939)
!939 = distinct !DILexicalBlock(scope: !940, file: !152, line: 857)
!940 = distinct !DILexicalBlock(scope: !595, file: !152, line: 853)
!941 = !DILocation(line: 858, scope: !942)
!942 = distinct !DILexicalBlock(scope: !939, file: !152, line: 858)
!943 = !DILocation(line: 858, scope: !944)
!944 = distinct !DILexicalBlock(scope: !945, file: !152, line: 858)
!945 = distinct !DILexicalBlock(scope: !942, file: !152, line: 858)
!946 = !DILocation(line: 858, scope: !947)
!947 = distinct !DILexicalBlock(scope: !944, file: !152, line: 858)
!948 = !DILocation(line: 858, scope: !949)
!949 = distinct !DILexicalBlock(scope: !950, file: !152, line: 858)
!950 = distinct !DILexicalBlock(scope: !947, file: !152, line: 858)
!951 = !DILocation(line: 859, scope: !939)
!952 = !DILocation(line: 860, scope: !939)
!953 = !DILocation(line: 866, scope: !595)
!954 = !DILocation(line: 872, scope: !955)
!955 = distinct !DILexicalBlock(scope: !956, file: !152, line: 871)
!956 = distinct !DILexicalBlock(scope: !595, file: !152, line: 866)
!957 = !DILocation(line: 872, scope: !958)
!958 = distinct !DILexicalBlock(scope: !955, file: !152, line: 872)
!959 = !DILocation(line: 872, scope: !960)
!960 = distinct !DILexicalBlock(scope: !961, file: !152, line: 872)
!961 = distinct !DILexicalBlock(scope: !958, file: !152, line: 872)
!962 = !DILocation(line: 872, scope: !963)
!963 = distinct !DILexicalBlock(scope: !960, file: !152, line: 872)
!964 = !DILocation(line: 872, scope: !965)
!965 = distinct !DILexicalBlock(scope: !966, file: !152, line: 872)
!966 = distinct !DILexicalBlock(scope: !963, file: !152, line: 872)
!967 = !DILocation(line: 873, scope: !955)
!968 = !DILocation(line: 874, scope: !955)
!969 = !DILocation(line: 877, scope: !595)
!970 = !DILocation(line: 882, scope: !971)
!971 = distinct !DILexicalBlock(scope: !972, file: !152, line: 881)
!972 = distinct !DILexicalBlock(scope: !595, file: !152, line: 877)
!973 = !DILocation(line: 882, scope: !974)
!974 = distinct !DILexicalBlock(scope: !971, file: !152, line: 882)
!975 = !DILocation(line: 882, scope: !976)
!976 = distinct !DILexicalBlock(scope: !977, file: !152, line: 882)
!977 = distinct !DILexicalBlock(scope: !974, file: !152, line: 882)
!978 = !DILocation(line: 882, scope: !979)
!979 = distinct !DILexicalBlock(scope: !976, file: !152, line: 882)
!980 = !DILocation(line: 882, scope: !981)
!981 = distinct !DILexicalBlock(scope: !982, file: !152, line: 882)
!982 = distinct !DILexicalBlock(scope: !979, file: !152, line: 882)
!983 = !DILocation(line: 883, scope: !971)
!984 = !DILocation(line: 884, scope: !971)
!985 = !DILocation(line: 887, scope: !595)
!986 = !DILocation(line: 892, scope: !987)
!987 = distinct !DILexicalBlock(scope: !988, file: !152, line: 891)
!988 = distinct !DILexicalBlock(scope: !595, file: !152, line: 887)
!989 = !DILocation(line: 892, scope: !990)
!990 = distinct !DILexicalBlock(scope: !987, file: !152, line: 892)
!991 = !DILocation(line: 892, scope: !992)
!992 = distinct !DILexicalBlock(scope: !993, file: !152, line: 892)
!993 = distinct !DILexicalBlock(scope: !990, file: !152, line: 892)
!994 = !DILocation(line: 892, scope: !995)
!995 = distinct !DILexicalBlock(scope: !992, file: !152, line: 892)
!996 = !DILocation(line: 892, scope: !997)
!997 = distinct !DILexicalBlock(scope: !998, file: !152, line: 892)
!998 = distinct !DILexicalBlock(scope: !995, file: !152, line: 892)
!999 = !DILocation(line: 893, scope: !987)
!1000 = !DILocation(line: 894, scope: !987)
!1001 = !DILocation(line: 897, scope: !595)
!1002 = !DILocation(line: 902, scope: !1003)
!1003 = distinct !DILexicalBlock(scope: !1004, file: !152, line: 901)
!1004 = distinct !DILexicalBlock(scope: !595, file: !152, line: 897)
!1005 = !DILocation(line: 902, scope: !1006)
!1006 = distinct !DILexicalBlock(scope: !1003, file: !152, line: 902)
!1007 = !DILocation(line: 902, scope: !1008)
!1008 = distinct !DILexicalBlock(scope: !1009, file: !152, line: 902)
!1009 = distinct !DILexicalBlock(scope: !1006, file: !152, line: 902)
!1010 = !DILocation(line: 902, scope: !1011)
!1011 = distinct !DILexicalBlock(scope: !1008, file: !152, line: 902)
!1012 = !DILocation(line: 902, scope: !1013)
!1013 = distinct !DILexicalBlock(scope: !1014, file: !152, line: 902)
!1014 = distinct !DILexicalBlock(scope: !1011, file: !152, line: 902)
!1015 = !DILocation(line: 903, scope: !1003)
!1016 = !DILocation(line: 904, scope: !1003)
!1017 = !DILocation(line: 907, scope: !595)
!1018 = !DILocation(line: 912, scope: !1019)
!1019 = distinct !DILexicalBlock(scope: !1020, file: !152, line: 911)
!1020 = distinct !DILexicalBlock(scope: !595, file: !152, line: 907)
!1021 = !DILocation(line: 912, scope: !1022)
!1022 = distinct !DILexicalBlock(scope: !1019, file: !152, line: 912)
!1023 = !DILocation(line: 912, scope: !1024)
!1024 = distinct !DILexicalBlock(scope: !1025, file: !152, line: 912)
!1025 = distinct !DILexicalBlock(scope: !1022, file: !152, line: 912)
!1026 = !DILocation(line: 912, scope: !1027)
!1027 = distinct !DILexicalBlock(scope: !1024, file: !152, line: 912)
!1028 = !DILocation(line: 912, scope: !1029)
!1029 = distinct !DILexicalBlock(scope: !1030, file: !152, line: 912)
!1030 = distinct !DILexicalBlock(scope: !1027, file: !152, line: 912)
!1031 = !DILocation(line: 913, scope: !1019)
!1032 = !DILocation(line: 914, scope: !1019)
!1033 = !DILocation(line: 917, scope: !595)
!1034 = !DILocation(line: 922, scope: !1035)
!1035 = distinct !DILexicalBlock(scope: !1036, file: !152, line: 921)
!1036 = distinct !DILexicalBlock(scope: !595, file: !152, line: 917)
!1037 = !DILocation(line: 922, scope: !1038)
!1038 = distinct !DILexicalBlock(scope: !1035, file: !152, line: 922)
!1039 = !DILocation(line: 922, scope: !1040)
!1040 = distinct !DILexicalBlock(scope: !1041, file: !152, line: 922)
!1041 = distinct !DILexicalBlock(scope: !1038, file: !152, line: 922)
!1042 = !DILocation(line: 922, scope: !1043)
!1043 = distinct !DILexicalBlock(scope: !1040, file: !152, line: 922)
!1044 = !DILocation(line: 922, scope: !1045)
!1045 = distinct !DILexicalBlock(scope: !1046, file: !152, line: 922)
!1046 = distinct !DILexicalBlock(scope: !1043, file: !152, line: 922)
!1047 = !DILocation(line: 923, scope: !1035)
!1048 = !DILocation(line: 924, scope: !1035)
!1049 = !DILocation(line: 927, scope: !595)
!1050 = !DILocation(line: 928, scope: !595)
!1051 = !DILocation(line: 929, scope: !595)
!1052 = !DILocation(line: 930, scope: !595)
!1053 = !DILocation(line: 931, scope: !595)
!1054 = !DILocation(line: 932, scope: !595)
!1055 = !DILocation(line: 933, scope: !595)
!1056 = !DILocation(line: 936, scope: !595)
!1057 = !DILocation(line: 937, scope: !595)
!1058 = !DILocation(line: 938, scope: !595)
!1059 = !DILocation(line: 941, scope: !1060)
!1060 = distinct !DILexicalBlock(scope: !1061, file: !152, line: 940)
!1061 = distinct !DILexicalBlock(scope: !595, file: !152, line: 938)
!1062 = !DILocation(line: 942, scope: !1060)
!1063 = !DILocation(line: 943, scope: !1060)
!1064 = !DILocation(line: 944, scope: !1060)
!1065 = !DILocation(line: 946, scope: !595)
!1066 = !DILocation(line: 947, scope: !595)
!1067 = !DILocation(line: 948, scope: !595)
!1068 = !DILocation(line: 949, scope: !595)
!1069 = !DILocation(line: 951, scope: !595)
!1070 = !DILocation(line: 952, scope: !595)
!1071 = !DILocation(line: 953, scope: !595)
!1072 = !DILocation(line: 954, scope: !595)
!1073 = !DILocation(line: 956, scope: !595)
!1074 = !DILocation(line: 957, scope: !595)
!1075 = !DILocation(line: 958, scope: !595)
!1076 = !DILocation(line: 960, scope: !595)
!1077 = !DILocation(line: 961, scope: !595)
!1078 = !DILocation(line: 963, scope: !595)
!1079 = !DILocation(line: 964, scope: !595)
!1080 = !DILocation(line: 966, scope: !595)
!1081 = !DILocation(line: 967, scope: !1082)
!1082 = distinct !DILexicalBlock(scope: !1083, file: !152, line: 966)
!1083 = distinct !DILexicalBlock(scope: !595, file: !152, line: 966)
!1084 = !DILocation(line: 967, scope: !1085)
!1085 = distinct !DILexicalBlock(scope: !1082, file: !152, line: 967)
!1086 = !DILocation(line: 967, scope: !1087)
!1087 = distinct !DILexicalBlock(scope: !1088, file: !152, line: 967)
!1088 = distinct !DILexicalBlock(scope: !1085, file: !152, line: 967)
!1089 = !DILocation(line: 967, scope: !1090)
!1090 = distinct !DILexicalBlock(scope: !1087, file: !152, line: 967)
!1091 = !DILocation(line: 967, scope: !1092)
!1092 = distinct !DILexicalBlock(scope: !1093, file: !152, line: 967)
!1093 = distinct !DILexicalBlock(scope: !1090, file: !152, line: 967)
!1094 = !DILocation(line: 968, scope: !1082)
!1095 = !DILocation(line: 971, scope: !595)
!1096 = !DILocation(line: 973, scope: !595)
!1097 = !DILocation(line: 974, scope: !1098)
!1098 = distinct !DILexicalBlock(scope: !1099, file: !152, line: 973)
!1099 = distinct !DILexicalBlock(scope: !595, file: !152, line: 973)
!1100 = !DILocation(line: 975, scope: !1098)
!1101 = !DILocation(line: 976, scope: !1098)
!1102 = !DILocation(line: 977, scope: !1103)
!1103 = distinct !DILexicalBlock(scope: !1099, file: !152, line: 976)
!1104 = !DILocation(line: 978, scope: !1103)
!1105 = !DILocation(line: 980, scope: !595)
!1106 = !DILocation(line: 981, scope: !595)
!1107 = !DILocation(line: 982, scope: !595)
!1108 = !DILocation(line: 983, scope: !595)
!1109 = !DILocation(line: 984, scope: !595)
!1110 = !DILocation(line: 986, scope: !595)
!1111 = !DILocation(line: 987, scope: !595)
!1112 = !DILocation(line: 990, scope: !595)
!1113 = !DILocation(line: 991, scope: !595)
!1114 = !DILabel(scope: !477, name: "EXIT", file: !152, line: 993)
!1115 = !DILocation(line: 993, scope: !477)
!1116 = !DILocation(line: 995, scope: !477)
!1117 = !DILocation(line: 997, scope: !477)
!1118 = !DILocation(line: 998, scope: !477)
!1119 = distinct !DISubprogram(name: "SmmEndOfDxeCallback", scope: !152, file: !152, line: 1012, type: !1120, scopeLine: 1017, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !231)
!1120 = !DISubroutineType(types: !1121)
!1121 = !{!36, !1122, !13, !297}
!1122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1123, size: 64)
!1123 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !48)
!1124 = !DILocalVariable(name: "Protocol", arg: 1, scope: !1119, file: !152, line: 1013, type: !1122)
!1125 = !DILocation(line: 1013, scope: !1119)
!1126 = !DILocalVariable(name: "Interface", arg: 2, scope: !1119, file: !152, line: 1014, type: !13)
!1127 = !DILocation(line: 1014, scope: !1119)
!1128 = !DILocalVariable(name: "Handle", arg: 3, scope: !1119, file: !152, line: 1015, type: !297)
!1129 = !DILocation(line: 1015, scope: !1119)
!1130 = !DILocalVariable(name: "Status", scope: !1119, file: !152, line: 1018, type: !36)
!1131 = !DILocation(line: 1018, scope: !1119)
!1132 = !DILocation(line: 1020, scope: !1119)
!1133 = !DILocation(line: 1020, scope: !1134)
!1134 = distinct !DILexicalBlock(scope: !1119, file: !152, line: 1020)
!1135 = !DILocation(line: 1020, scope: !1136)
!1136 = distinct !DILexicalBlock(scope: !1137, file: !152, line: 1020)
!1137 = distinct !DILexicalBlock(scope: !1134, file: !152, line: 1020)
!1138 = !DILocation(line: 1020, scope: !1139)
!1139 = distinct !DILexicalBlock(scope: !1136, file: !152, line: 1020)
!1140 = !DILocation(line: 1020, scope: !1141)
!1141 = distinct !DILexicalBlock(scope: !1142, file: !152, line: 1020)
!1142 = distinct !DILexicalBlock(scope: !1139, file: !152, line: 1020)
!1143 = !DILocation(line: 1021, scope: !1119)
!1144 = !DILocation(line: 1022, scope: !1119)
!1145 = !DILocation(line: 1023, scope: !1119)
!1146 = !DILocation(line: 1023, scope: !1147)
!1147 = distinct !DILexicalBlock(scope: !1119, file: !152, line: 1023)
!1148 = !DILocation(line: 1023, scope: !1149)
!1149 = distinct !DILexicalBlock(scope: !1150, file: !152, line: 1023)
!1150 = distinct !DILexicalBlock(scope: !1147, file: !152, line: 1023)
!1151 = !DILocation(line: 1023, scope: !1152)
!1152 = distinct !DILexicalBlock(scope: !1153, file: !152, line: 1023)
!1153 = distinct !DILexicalBlock(scope: !1149, file: !152, line: 1023)
!1154 = !DILocation(line: 1023, scope: !1155)
!1155 = distinct !DILexicalBlock(scope: !1152, file: !152, line: 1023)
!1156 = !DILocation(line: 1023, scope: !1157)
!1157 = distinct !DILexicalBlock(scope: !1158, file: !152, line: 1023)
!1158 = distinct !DILexicalBlock(scope: !1155, file: !152, line: 1023)
!1159 = !DILocation(line: 1023, scope: !1160)
!1160 = distinct !DILexicalBlock(scope: !1157, file: !152, line: 1023)
!1161 = !DILocation(line: 1023, scope: !1162)
!1162 = distinct !DILexicalBlock(scope: !1163, file: !152, line: 1023)
!1163 = distinct !DILexicalBlock(scope: !1160, file: !152, line: 1023)
!1164 = !DILocation(line: 1024, scope: !1119)
!1165 = !DILocation(line: 1025, scope: !1119)
!1166 = !DILocation(line: 1029, scope: !1119)
!1167 = !DILocation(line: 1030, scope: !1119)
!1168 = !DILocation(line: 1031, scope: !1169)
!1169 = distinct !DILexicalBlock(scope: !1170, file: !152, line: 1030)
!1170 = distinct !DILexicalBlock(scope: !1119, file: !152, line: 1030)
!1171 = !DILocation(line: 1032, scope: !1169)
!1172 = !DILocation(line: 1034, scope: !1119)
!1173 = distinct !DISubprogram(name: "VariableWriteServiceInitializeSmm", scope: !152, file: !152, line: 1042, type: !1174, scopeLine: 1045, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !231)
!1174 = !DISubroutineType(types: !1175)
!1175 = !{null}
!1176 = !DILocalVariable(name: "Status", scope: !1173, file: !152, line: 1046, type: !36)
!1177 = !DILocation(line: 1046, scope: !1173)
!1178 = !DILocation(line: 1048, scope: !1173)
!1179 = !DILocation(line: 1049, scope: !1173)
!1180 = !DILocation(line: 1050, scope: !1181)
!1181 = distinct !DILexicalBlock(scope: !1182, file: !152, line: 1049)
!1182 = distinct !DILexicalBlock(scope: !1173, file: !152, line: 1049)
!1183 = !DILocation(line: 1050, scope: !1184)
!1184 = distinct !DILexicalBlock(scope: !1181, file: !152, line: 1050)
!1185 = !DILocation(line: 1050, scope: !1186)
!1186 = distinct !DILexicalBlock(scope: !1187, file: !152, line: 1050)
!1187 = distinct !DILexicalBlock(scope: !1184, file: !152, line: 1050)
!1188 = !DILocation(line: 1050, scope: !1189)
!1189 = distinct !DILexicalBlock(scope: !1186, file: !152, line: 1050)
!1190 = !DILocation(line: 1050, scope: !1191)
!1191 = distinct !DILexicalBlock(scope: !1192, file: !152, line: 1050)
!1192 = distinct !DILexicalBlock(scope: !1189, file: !152, line: 1050)
!1193 = !DILocation(line: 1051, scope: !1181)
!1194 = !DILocation(line: 1056, scope: !1173)
!1195 = !DILocation(line: 1057, scope: !1173)
!1196 = distinct !DISubprogram(name: "SmmFtwNotificationEvent", scope: !152, file: !152, line: 1075, type: !1120, scopeLine: 1080, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !231)
!1197 = !DILocalVariable(name: "Protocol", arg: 1, scope: !1196, file: !152, line: 1076, type: !1122)
!1198 = !DILocation(line: 1076, scope: !1196)
!1199 = !DILocalVariable(name: "Interface", arg: 2, scope: !1196, file: !152, line: 1077, type: !13)
!1200 = !DILocation(line: 1077, scope: !1196)
!1201 = !DILocalVariable(name: "Handle", arg: 3, scope: !1196, file: !152, line: 1078, type: !297)
!1202 = !DILocation(line: 1078, scope: !1196)
!1203 = !DILocalVariable(name: "Status", scope: !1196, file: !152, line: 1081, type: !36)
!1204 = !DILocation(line: 1081, scope: !1196)
!1205 = !DILocalVariable(name: "VariableStoreBase", scope: !1196, file: !152, line: 1082, type: !323)
!1206 = !DILocation(line: 1082, scope: !1196)
!1207 = !DILocalVariable(name: "FvbProtocol", scope: !1196, file: !152, line: 1083, type: !1208)
!1208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1209, size: 64)
!1209 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SMM_FIRMWARE_VOLUME_BLOCK_PROTOCOL", file: !1210, line: 26, baseType: !300)
!1210 = !DIFile(filename: "MdeModulePkg/Include/Protocol/SmmFirmwareVolumeBlock.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "3f8c4b04c1c6e791317a6d64081a71f9")
!1211 = !DILocation(line: 1083, scope: !1196)
!1212 = !DILocalVariable(name: "FtwProtocol", scope: !1196, file: !152, line: 1084, type: !1213)
!1213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1214, size: 64)
!1214 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SMM_FAULT_TOLERANT_WRITE_PROTOCOL", file: !1215, line: 28, baseType: !1216)
!1215 = !DIFile(filename: "MdeModulePkg/Include/Protocol/SmmFaultTolerantWrite.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "ca4763f9250550aba3d332ba5b9c0ad1")
!1216 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FAULT_TOLERANT_WRITE_PROTOCOL", file: !1217, line: 23, baseType: !1218)
!1217 = !DIFile(filename: "MdeModulePkg/Include/Protocol/FaultTolerantWrite.h", directory: "/home/achintya/Downloads/HARDEN_demo2/VLab_HARDEN-main/demo2_edk2-main", checksumkind: CSK_MD5, checksum: "4a945e0bd8a5230eb74cb6bb8127a39f")
!1218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_FAULT_TOLERANT_WRITE_PROTOCOL", file: !1217, line: 190, size: 384, elements: !1219)
!1219 = !{!1220, !1226, !1231, !1236, !1241, !1246}
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "GetMaxBlockSize", scope: !1218, file: !1217, line: 191, baseType: !1221, size: 64)
!1221 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FAULT_TOLERANT_WRITE_GET_MAX_BLOCK_SIZE", file: !1217, line: 39, baseType: !1222)
!1222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1223, size: 64)
!1223 = !DISubroutineType(types: !1224)
!1224 = !{!36, !1225, !173}
!1225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1216, size: 64)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "Allocate", scope: !1218, file: !1217, line: 192, baseType: !1227, size: 64, offset: 64)
!1227 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FAULT_TOLERANT_WRITE_ALLOCATE", file: !1217, line: 67, baseType: !1228)
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1229, size: 64)
!1229 = !DISubroutineType(types: !1230)
!1230 = !{!36, !1225, !171, !17, !17}
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "Write", scope: !1218, file: !1217, line: 193, baseType: !1232, size: 64, offset: 128)
!1232 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FAULT_TOLERANT_WRITE_WRITE", file: !1217, line: 103, baseType: !1233)
!1233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1234, size: 64)
!1234 = !DISubroutineType(types: !1235)
!1235 = !{!36, !1225, !329, !17, !17, !13, !297, !13}
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "Restart", scope: !1218, file: !1217, line: 194, baseType: !1237, size: 64, offset: 192)
!1237 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FAULT_TOLERANT_WRITE_RESTART", file: !1217, line: 128, baseType: !1238)
!1238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1239, size: 64)
!1239 = !DISubroutineType(types: !1240)
!1240 = !{!36, !1225, !297}
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "Abort", scope: !1218, file: !1217, line: 195, baseType: !1242, size: 64, offset: 256)
!1242 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FAULT_TOLERANT_WRITE_ABORT", file: !1217, line: 145, baseType: !1243)
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1244, size: 64)
!1244 = !DISubroutineType(types: !1245)
!1245 = !{!36, !1225}
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "GetLastWrite", scope: !1218, file: !1217, line: 196, baseType: !1247, size: 64, offset: 320)
!1247 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FAULT_TOLERANT_WRITE_GET_LAST_WRITE", file: !1217, line: 176, baseType: !1248)
!1248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1249, size: 64)
!1249 = !DISubroutineType(types: !1250)
!1250 = !{!36, !1225, !171, !1251, !173, !173, !173, !13, !125}
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!1252 = !DILocation(line: 1084, scope: !1196)
!1253 = !DILocalVariable(name: "NvStorageVariableBase", scope: !1196, file: !152, line: 1085, type: !323)
!1254 = !DILocation(line: 1085, scope: !1196)
!1255 = !DILocalVariable(name: "FtwMaxBlockSize", scope: !1196, file: !152, line: 1086, type: !17)
!1256 = !DILocation(line: 1086, scope: !1196)
!1257 = !DILocalVariable(name: "NvStorageVariableSize", scope: !1196, file: !152, line: 1087, type: !53)
!1258 = !DILocation(line: 1087, scope: !1196)
!1259 = !DILocalVariable(name: "NvStorageVariableSize64", scope: !1196, file: !152, line: 1088, type: !19)
!1260 = !DILocation(line: 1088, scope: !1196)
!1261 = !DILocation(line: 1090, scope: !1196)
!1262 = !DILocation(line: 1091, scope: !1263)
!1263 = distinct !DILexicalBlock(scope: !1264, file: !152, line: 1090)
!1264 = distinct !DILexicalBlock(scope: !1196, file: !152, line: 1090)
!1265 = !DILocation(line: 1097, scope: !1196)
!1266 = !DILocation(line: 1098, scope: !1196)
!1267 = !DILocation(line: 1099, scope: !1268)
!1268 = distinct !DILexicalBlock(scope: !1269, file: !152, line: 1098)
!1269 = distinct !DILexicalBlock(scope: !1196, file: !152, line: 1098)
!1270 = !DILocation(line: 1102, scope: !1196)
!1271 = !DILocation(line: 1103, scope: !1196)
!1272 = !DILocation(line: 1103, scope: !1273)
!1273 = distinct !DILexicalBlock(scope: !1196, file: !152, line: 1103)
!1274 = !DILocation(line: 1103, scope: !1275)
!1275 = distinct !DILexicalBlock(scope: !1276, file: !152, line: 1103)
!1276 = distinct !DILexicalBlock(scope: !1273, file: !152, line: 1103)
!1277 = !DILocation(line: 1103, scope: !1278)
!1278 = distinct !DILexicalBlock(scope: !1279, file: !152, line: 1103)
!1279 = distinct !DILexicalBlock(scope: !1275, file: !152, line: 1103)
!1280 = !DILocation(line: 1103, scope: !1281)
!1281 = distinct !DILexicalBlock(scope: !1278, file: !152, line: 1103)
!1282 = !DILocation(line: 1103, scope: !1283)
!1283 = distinct !DILexicalBlock(scope: !1284, file: !152, line: 1103)
!1284 = distinct !DILexicalBlock(scope: !1281, file: !152, line: 1103)
!1285 = !DILocation(line: 1103, scope: !1286)
!1286 = distinct !DILexicalBlock(scope: !1283, file: !152, line: 1103)
!1287 = !DILocation(line: 1103, scope: !1288)
!1288 = distinct !DILexicalBlock(scope: !1289, file: !152, line: 1103)
!1289 = distinct !DILexicalBlock(scope: !1286, file: !152, line: 1103)
!1290 = !DILocation(line: 1105, scope: !1196)
!1291 = !DILocation(line: 1107, scope: !1196)
!1292 = !DILocation(line: 1107, scope: !1293)
!1293 = distinct !DILexicalBlock(scope: !1196, file: !152, line: 1107)
!1294 = !DILocation(line: 1107, scope: !1295)
!1295 = distinct !DILexicalBlock(scope: !1296, file: !152, line: 1107)
!1296 = distinct !DILexicalBlock(scope: !1293, file: !152, line: 1107)
!1297 = !DILocation(line: 1107, scope: !1298)
!1298 = distinct !DILexicalBlock(scope: !1299, file: !152, line: 1107)
!1299 = distinct !DILexicalBlock(scope: !1295, file: !152, line: 1107)
!1300 = !DILocation(line: 1107, scope: !1301)
!1301 = distinct !DILexicalBlock(scope: !1298, file: !152, line: 1107)
!1302 = !DILocation(line: 1107, scope: !1303)
!1303 = distinct !DILexicalBlock(scope: !1304, file: !152, line: 1107)
!1304 = distinct !DILexicalBlock(scope: !1301, file: !152, line: 1107)
!1305 = !DILocation(line: 1107, scope: !1306)
!1306 = distinct !DILexicalBlock(scope: !1303, file: !152, line: 1107)
!1307 = !DILocation(line: 1107, scope: !1308)
!1308 = distinct !DILexicalBlock(scope: !1309, file: !152, line: 1107)
