; ModuleID = '__uClibc_main.os'
source_filename = "libc/misc/internals/__uClibc_main.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.__uclibc_locale_struct.198 = type { i16*, i16*, i16*, [384 x i16], [384 x i16], [384 x i16], [14 x i8], [6 x i16], [6 x i8], i8, i8, [10 x i8], i8*, i8*, i8*, i8*, i8*, i16*, i8*, i8*, i16*, i8*, i8*, i16*, i32, i32, i32, i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct.__collate_t.197 }
%struct.__collate_t.197 = type { i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16*, i16*, i16*, i16*, i16*, i16*, i16*, i16*, i16*, i16 }
%struct.__STDIO_FILE_STRUCT.566 = type { i16, [2 x i8], i32, i8*, i8*, i8*, i8*, i8*, i8*, %struct.__STDIO_FILE_STRUCT.566*, [2 x i32], %struct.__mbstate_t.565, i8* }
%struct.__mbstate_t.565 = type { i32, i32 }
%struct.EFI_GCD_MEMORY_SPACE_DESCRIPTOR = type { i64, i64, i64, i64, i32, i8*, i8* }
%struct.EFI_MEMORY_ATTRIBUTES_TABLE = type { i32, i32, i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "__libc_stack_end", scope: !2, file: !3, line: 52, type: !5, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !4, globals: !25, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "libc/misc/internals/__uClibc_main.c", directory: "/home/shafi/Research/KLEE/klee-uclibc", checksumkind: CSK_MD5, checksum: "02c0db7d43910a8924b2180232bacf45")
!4 = !{!5, !6, !8, !10, !22, !24}
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "Elf64_auxv_t", file: !12, line: 1036, baseType: !13)
!12 = !DIFile(filename: "./include/elf.h", directory: "/home/shafi/Research/KLEE/klee-uclibc", checksumkind: CSK_MD5, checksum: "280b87e0a4080980f4c613bf16ed323f")
!13 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 1026, size: 128, elements: !14)
!14 = !{!15, !18}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "a_type", scope: !13, file: !12, line: 1028, baseType: !16, size: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !17, line: 58, baseType: !9)
!17 = !DIFile(filename: "./include/stdint.h", directory: "/home/shafi/Research/KLEE/klee-uclibc", checksumkind: CSK_MD5, checksum: "996bf1fb6caa3282c1964171127ad56a")
!18 = !DIDerivedType(tag: DW_TAG_member, name: "a_un", scope: !13, file: !12, line: 1035, baseType: !19, size: 64, offset: 64)
!19 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !13, file: !12, line: 1029, size: 64, elements: !20)
!20 = !{!21}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "a_val", scope: !19, file: !12, line: 1031, baseType: !16, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !23, line: 46, baseType: !9)
!23 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!24 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!25 = !{!0, !26, !30, !32, !34, !37, !39, !46, !49}
!26 = !DIGlobalVariableExpression(var: !27, expr: !DIExpression())
!27 = distinct !DIGlobalVariable(name: "__uclibc_progname", scope: !2, file: !3, line: 110, type: !28, isLocal: false, isDefinition: true)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!30 = !DIGlobalVariableExpression(var: !31, expr: !DIExpression())
!31 = distinct !DIGlobalVariable(name: "program_invocation_short_name", scope: !2, file: !3, line: 112, type: !28, isLocal: false, isDefinition: true)
!32 = !DIGlobalVariableExpression(var: !33, expr: !DIExpression())
!33 = distinct !DIGlobalVariable(name: "program_invocation_name", scope: !2, file: !3, line: 113, type: !28, isLocal: false, isDefinition: true)
!34 = !DIGlobalVariableExpression(var: !35, expr: !DIExpression())
!35 = distinct !DIGlobalVariable(name: "__environ", scope: !2, file: !3, line: 125, type: !36, isLocal: false, isDefinition: true)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "__pagesize", scope: !2, file: !3, line: 129, type: !22, isLocal: false, isDefinition: true)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "been_there_done_that", scope: !41, file: !3, line: 189, type: !45, isLocal: true, isDefinition: true)
!41 = distinct !DISubprogram(name: "__uClibc_init", scope: !3, file: !3, line: 187, type: !42, scopeLine: 188, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !44)
!42 = !DISubroutineType(types: !43)
!43 = !{null}
!44 = !{}
!45 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!46 = !DIGlobalVariableExpression(var: !47, expr: !DIExpression())
!47 = distinct !DIGlobalVariable(name: "__app_fini", scope: !2, file: !3, line: 244, type: !48, isLocal: false, isDefinition: true)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!49 = !DIGlobalVariableExpression(var: !50, expr: !DIExpression())
!50 = distinct !DIGlobalVariable(name: "__rtld_fini", scope: !2, file: !3, line: 247, type: !48, isLocal: false, isDefinition: true)
!51 = !DIGlobalVariableExpression(var: !52, expr: !DIExpression())
!52 = distinct !DIGlobalVariable(name: "n_calls", scope: !53, file: !54, line: 299, type: !45, isLocal: true, isDefinition: true)
!53 = distinct !DISubprogram(name: "close", scope: !54, file: !54, line: 298, type: !55, scopeLine: 298, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !44)
!54 = !DIFile(filename: "klee/runtime/POSIX/fd.c", directory: "/home/shafi/Research/KLEE", checksumkind: CSK_MD5, checksum: "fd27ffca8f23688b1cbb26cb3f8119d2")
!55 = !DISubroutineType(types: !56)
!56 = !{!45, !45}
!57 = distinct !DICompileUnit(language: DW_LANG_C89, file: !58, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !59, retainedTypes: !80, globals: !139, splitDebugInlining: false, nameTableKind: None)
!58 = !DIFile(filename: "/home/shafi/Research/KLEE/klee/runtime/POSIX/fd.c", directory: "/home/shafi/Research/KLEE/klee_build/runtime/POSIX", checksumkind: CSK_MD5, checksum: "fd27ffca8f23688b1cbb26cb3f8119d2")
!59 = !{!60, !68}
!60 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !61, line: 58, baseType: !62, size: 32, elements: !63)
!61 = !DIFile(filename: "klee/runtime/POSIX/fd.h", directory: "/home/shafi/Research/KLEE", checksumkind: CSK_MD5, checksum: "9dc4d4f19a43ba557c3ab447f2f3c234")
!62 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!63 = !{!64, !65, !66, !67}
!64 = !DIEnumerator(name: "eOpen", value: 1)
!65 = !DIEnumerator(name: "eCloseOnExec", value: 2)
!66 = !DIEnumerator(name: "eReadable", value: 4)
!67 = !DIEnumerator(name: "eWriteable", value: 8)
!68 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !69, line: 97, baseType: !62, size: 32, elements: !70)
!69 = !DIFile(filename: "/usr/include/dirent.h", directory: "", checksumkind: CSK_MD5, checksum: "6eb1a2faa0cf53b967234cc6c0fe978e")
!70 = !{!71, !72, !73, !74, !75, !76, !77, !78, !79}
!71 = !DIEnumerator(name: "DT_UNKNOWN", value: 0)
!72 = !DIEnumerator(name: "DT_FIFO", value: 1)
!73 = !DIEnumerator(name: "DT_CHR", value: 2)
!74 = !DIEnumerator(name: "DT_DIR", value: 4)
!75 = !DIEnumerator(name: "DT_BLK", value: 6)
!76 = !DIEnumerator(name: "DT_REG", value: 8)
!77 = !DIEnumerator(name: "DT_LNK", value: 10)
!78 = !DIEnumerator(name: "DT_SOCK", value: 12)
!79 = !DIEnumerator(name: "DT_WHT", value: 14)
!80 = !{!81, !5, !82, !9, !86, !6, !101, !45, !7}
!81 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "off64_t", file: !83, line: 92, baseType: !84)
!83 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !85, line: 153, baseType: !81)
!85 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent64", file: !88, line: 37, size: 2240, elements: !89)
!88 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/dirent.h", directory: "", checksumkind: CSK_MD5, checksum: "bc8b10a1ddd2747862e3ae7b91dbf464")
!89 = !{!90, !92, !93, !95, !97}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !87, file: !88, line: 39, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !85, line: 149, baseType: !9)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !87, file: !88, line: 40, baseType: !84, size: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !87, file: !88, line: 41, baseType: !94, size: 16, offset: 128)
!94 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !87, file: !88, line: 42, baseType: !96, size: 8, offset: 144)
!96 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !87, file: !88, line: 43, baseType: !98, size: 2048, offset: 152)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 2048, elements: !99)
!99 = !{!100}
!100 = !DISubrange(count: 256)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !103, line: 26, size: 1152, elements: !104)
!103 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "3ba283bc334370fe631cbc82f5229ed7")
!104 = !{!105, !107, !109, !111, !113, !115, !117, !118, !119, !121, !123, !125, !133, !134, !135}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !102, file: !103, line: 31, baseType: !106, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !85, line: 145, baseType: !9)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !102, file: !103, line: 36, baseType: !108, size: 64, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !85, line: 148, baseType: !9)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !102, file: !103, line: 44, baseType: !110, size: 64, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !85, line: 151, baseType: !9)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !102, file: !103, line: 45, baseType: !112, size: 32, offset: 192)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !85, line: 150, baseType: !62)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !102, file: !103, line: 47, baseType: !114, size: 32, offset: 224)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !85, line: 146, baseType: !62)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !102, file: !103, line: 48, baseType: !116, size: 32, offset: 256)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !85, line: 147, baseType: !62)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !102, file: !103, line: 50, baseType: !45, size: 32, offset: 288)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !102, file: !103, line: 52, baseType: !106, size: 64, offset: 320)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !102, file: !103, line: 57, baseType: !120, size: 64, offset: 384)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !85, line: 152, baseType: !81)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !102, file: !103, line: 61, baseType: !122, size: 64, offset: 448)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !85, line: 175, baseType: !81)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !102, file: !103, line: 63, baseType: !124, size: 64, offset: 512)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !85, line: 180, baseType: !81)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !102, file: !103, line: 74, baseType: !126, size: 128, offset: 576)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !127, line: 11, size: 128, elements: !128)
!127 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!128 = !{!129, !131}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !126, file: !127, line: 16, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !85, line: 160, baseType: !81)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !126, file: !127, line: 21, baseType: !132, size: 64, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !85, line: 197, baseType: !81)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !102, file: !103, line: 75, baseType: !126, size: 128, offset: 704)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !102, file: !103, line: 76, baseType: !126, size: 128, offset: 832)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !102, file: !103, line: 89, baseType: !136, size: 192, offset: 960)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 192, elements: !137)
!137 = !{!138}
!138 = !DISubrange(count: 3)
!139 = !{!51, !140, !147, !154, !160, !165, !170}
!140 = !DIGlobalVariableExpression(var: !141, expr: !DIExpression())
!141 = distinct !DIGlobalVariable(name: "n_calls", scope: !142, file: !54, line: 331, type: !45, isLocal: true, isDefinition: true)
!142 = distinct !DISubprogram(name: "read", scope: !54, file: !54, line: 330, type: !143, scopeLine: 330, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !44)
!143 = !DISubroutineType(types: !144)
!144 = !{!145, !45, !5, !22}
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !83, line: 108, baseType: !146)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !85, line: 194, baseType: !81)
!147 = !DIGlobalVariableExpression(var: !148, expr: !DIExpression())
!148 = distinct !DIGlobalVariable(name: "n_calls", scope: !149, file: !54, line: 397, type: !45, isLocal: true, isDefinition: true)
!149 = distinct !DISubprogram(name: "write", scope: !54, file: !54, line: 396, type: !150, scopeLine: 396, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !44)
!150 = !DISubroutineType(types: !151)
!151 = !{!145, !45, !152, !22}
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!154 = !DIGlobalVariableExpression(var: !155, expr: !DIExpression())
!155 = distinct !DIGlobalVariable(name: "n_calls", scope: !156, file: !54, line: 633, type: !45, isLocal: true, isDefinition: true)
!156 = distinct !DISubprogram(name: "chmod", scope: !54, file: !54, line: 632, type: !157, scopeLine: 632, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !44)
!157 = !DISubroutineType(types: !158)
!158 = !{!45, !28, !159}
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !83, line: 69, baseType: !112)
!160 = !DIGlobalVariableExpression(var: !161, expr: !DIExpression())
!161 = distinct !DIGlobalVariable(name: "n_calls", scope: !162, file: !54, line: 652, type: !45, isLocal: true, isDefinition: true)
!162 = distinct !DISubprogram(name: "fchmod", scope: !54, file: !54, line: 651, type: !163, scopeLine: 651, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !44)
!163 = !DISubroutineType(types: !164)
!164 = !{!45, !45, !159}
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(name: "n_calls", scope: !167, file: !54, line: 738, type: !45, isLocal: true, isDefinition: true)
!167 = distinct !DISubprogram(name: "__fd_ftruncate", scope: !54, file: !54, line: 737, type: !168, scopeLine: 737, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !44)
!168 = !DISubroutineType(types: !169)
!169 = !{!45, !45, !82}
!170 = !DIGlobalVariableExpression(var: !171, expr: !DIExpression())
!171 = distinct !DIGlobalVariable(name: "n_calls", scope: !172, file: !54, line: 1332, type: !45, isLocal: true, isDefinition: true)
!172 = distinct !DISubprogram(name: "getcwd", scope: !54, file: !54, line: 1331, type: !173, scopeLine: 1331, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !44)
!173 = !DISubroutineType(types: !174)
!174 = !{!6, !6, !22}
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(name: "__global_locale_data", scope: !177, file: !212, line: 375, type: !451, isLocal: false, isDefinition: true)
!177 = distinct !DICompileUnit(language: DW_LANG_C99, file: !178, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !179, retainedTypes: !201, globals: !254, splitDebugInlining: false, nameTableKind: None)
!178 = !DIFile(filename: "libc/misc/locale/_locale_init.c", directory: "/home/shafi/Research/KLEE/klee-uclibc", checksumkind: CSK_MD5, checksum: "6b2866feb4effdd243a6d2ad04178572")
!179 = !{!180, !186}
!180 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !181, line: 90, baseType: !62, size: 32, elements: !182)
!181 = !DIFile(filename: "./include/bits/uClibc_locale.h", directory: "/home/shafi/Research/KLEE/klee-uclibc", checksumkind: CSK_MD5, checksum: "599f80544f873a2ed327ea753999aa6d")
!182 = !{!183, !184, !185}
!183 = !DIEnumerator(name: "__ctype_encoding_7_bit", value: 0)
!184 = !DIEnumerator(name: "__ctype_encoding_utf8", value: 1)
!185 = !DIEnumerator(name: "__ctype_encoding_8_bit", value: 2)
!186 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !187, line: 48, baseType: !62, size: 32, elements: !188)
!187 = !DIFile(filename: "./include/ctype.h", directory: "/home/shafi/Research/KLEE/klee-uclibc", checksumkind: CSK_MD5, checksum: "d2acef852115df228b64a6f51a6bad04")
!188 = !{!189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200}
!189 = !DIEnumerator(name: "_ISupper", value: 256)
!190 = !DIEnumerator(name: "_ISlower", value: 512)
!191 = !DIEnumerator(name: "_ISalpha", value: 1024)
!192 = !DIEnumerator(name: "_ISdigit", value: 2048)
!193 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!194 = !DIEnumerator(name: "_ISspace", value: 8192)
!195 = !DIEnumerator(name: "_ISprint", value: 16384)
!196 = !DIEnumerator(name: "_ISgraph", value: 32768)
!197 = !DIEnumerator(name: "_ISblank", value: 1)
!198 = !DIEnumerator(name: "_IScntrl", value: 2)
!199 = !DIEnumerator(name: "_ISpunct", value: 4)
!200 = !DIEnumerator(name: "_ISalnum", value: 8)
!201 = !{!45, !202, !6, !203, !205, !208, !96, !209, !210, !223, !231, !9}
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !96)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !207)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !17, line: 52, baseType: !94)
!208 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "coldata_header_t", file: !212, line: 400, baseType: !213)
!212 = !DIFile(filename: "libc/misc/locale/locale.c", directory: "/home/shafi/Research/KLEE/klee-uclibc", checksumkind: CSK_MD5, checksum: "c9c3a760038910c15bf8cd5df79e8d7e")
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !212, line: 390, size: 128, elements: !214)
!214 = !{!215, !216, !217, !218, !219, !220, !221, !222}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "num_base", scope: !213, file: !212, line: 391, baseType: !207, size: 16)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "num_der", scope: !213, file: !212, line: 392, baseType: !207, size: 16, offset: 16)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "MAX_WEIGHTS", scope: !213, file: !212, line: 393, baseType: !207, size: 16, offset: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "num_index2weight", scope: !213, file: !212, line: 394, baseType: !207, size: 16, offset: 48)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "num_weightstr", scope: !213, file: !212, line: 396, baseType: !207, size: 16, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "num_multistart", scope: !213, file: !212, line: 397, baseType: !207, size: 16, offset: 80)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "num_override", scope: !213, file: !212, line: 398, baseType: !207, size: 16, offset: 96)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "num_ruletable", scope: !213, file: !212, line: 399, baseType: !207, size: 16, offset: 112)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "coldata_der_t", file: !212, line: 430, baseType: !225)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !212, line: 425, size: 64, elements: !226)
!226 = !{!227, !228, !229, !230}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "base_idx", scope: !225, file: !212, line: 426, baseType: !207, size: 16)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "undefined_idx", scope: !225, file: !212, line: 427, baseType: !207, size: 16, offset: 16)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "overrides_offset", scope: !225, file: !212, line: 428, baseType: !207, size: 16, offset: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "multistart_offset", scope: !225, file: !212, line: 429, baseType: !207, size: 16, offset: 48)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "coldata_base_t", file: !212, line: 423, baseType: !233)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !212, line: 402, size: 304, elements: !234)
!234 = !{!235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "num_weights", scope: !233, file: !212, line: 403, baseType: !207, size: 16)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "num_starters", scope: !233, file: !212, line: 404, baseType: !207, size: 16, offset: 16)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "ii_shift", scope: !233, file: !212, line: 405, baseType: !207, size: 16, offset: 32)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "ti_shift", scope: !233, file: !212, line: 406, baseType: !207, size: 16, offset: 48)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "ii_len", scope: !233, file: !212, line: 407, baseType: !207, size: 16, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "ti_len", scope: !233, file: !212, line: 408, baseType: !207, size: 16, offset: 80)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "max_weight", scope: !233, file: !212, line: 409, baseType: !207, size: 16, offset: 96)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "num_col_base", scope: !233, file: !212, line: 410, baseType: !207, size: 16, offset: 112)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "max_col_index", scope: !233, file: !212, line: 411, baseType: !207, size: 16, offset: 128)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "undefined_idx", scope: !233, file: !212, line: 412, baseType: !207, size: 16, offset: 144)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "range_low", scope: !233, file: !212, line: 413, baseType: !207, size: 16, offset: 160)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "range_count", scope: !233, file: !212, line: 414, baseType: !207, size: 16, offset: 176)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "range_base_weight", scope: !233, file: !212, line: 415, baseType: !207, size: 16, offset: 192)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "range_rule_offset", scope: !233, file: !212, line: 416, baseType: !207, size: 16, offset: 208)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "index2weight_offset", scope: !233, file: !212, line: 418, baseType: !207, size: 16, offset: 224)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "index2ruleidx_offset", scope: !233, file: !212, line: 419, baseType: !207, size: 16, offset: 240)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "multistart_offset", scope: !233, file: !212, line: 420, baseType: !207, size: 16, offset: 256)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "wcs2colidt_offset_low", scope: !233, file: !212, line: 421, baseType: !207, size: 16, offset: 272)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "wcs2colidt_offset_hi", scope: !233, file: !212, line: 422, baseType: !207, size: 16, offset: 288)
!254 = !{!255, !439, !175, !441, !444, !446}
!255 = !DIGlobalVariableExpression(var: !256, expr: !DIExpression())
!256 = distinct !DIGlobalVariable(name: "__global_locale", scope: !177, file: !212, line: 377, type: !257, isLocal: false, isDefinition: true)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "__locale_t", file: !181, line: 330, baseType: !258)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__uclibc_locale_struct", file: !181, line: 154, size: 26560, elements: !260)
!260 = !{!261, !268, !274, !275, !279, !281, !282, !286, !290, !292, !293, !294, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !313, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_b", scope: !259, file: !181, line: 156, baseType: !262, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ctype_mask_t", file: !265, line: 38, baseType: !266)
!265 = !DIFile(filename: "./include/bits/uClibc_touplow.h", directory: "/home/shafi/Research/KLEE/klee-uclibc", checksumkind: CSK_MD5, checksum: "5d3626eea7d6a2aaaba36e9a6eede6c5")
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !267, line: 44, baseType: !94)
!267 = !DIFile(filename: "./include/bits/types.h", directory: "/home/shafi/Research/KLEE/klee-uclibc", checksumkind: CSK_MD5, checksum: "ff69fe50708aa486cd32d2c69e12cc37")
!268 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_tolower", scope: !259, file: !181, line: 157, baseType: !269, size: 64, offset: 64)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !271)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ctype_touplow_t", file: !265, line: 42, baseType: !272)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !267, line: 43, baseType: !273)
!273 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_toupper", scope: !259, file: !181, line: 158, baseType: !269, size: 64, offset: 128)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_b_data", scope: !259, file: !181, line: 162, baseType: !276, size: 6144, offset: 192)
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !264, size: 6144, elements: !277)
!277 = !{!278}
!278 = !DISubrange(count: 384)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_tolower_data", scope: !259, file: !181, line: 163, baseType: !280, size: 6144, offset: 6336)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !271, size: 6144, elements: !277)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_toupper_data", scope: !259, file: !181, line: 164, baseType: !280, size: 6144, offset: 12480)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "cur_locale", scope: !259, file: !181, line: 168, baseType: !283, size: 112, offset: 18624)
!283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 112, elements: !284)
!284 = !{!285}
!285 = !DISubrange(count: 14)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "category_offsets", scope: !259, file: !181, line: 174, baseType: !287, size: 96, offset: 18736)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 96, elements: !288)
!288 = !{!289}
!289 = !DISubrange(count: 6)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "category_item_count", scope: !259, file: !181, line: 175, baseType: !291, size: 48, offset: 18832)
!291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 48, elements: !288)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !259, file: !181, line: 178, baseType: !96, size: 8, offset: 18880)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cur_max", scope: !259, file: !181, line: 179, baseType: !96, size: 8, offset: 18888)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit_length", scope: !259, file: !181, line: 180, baseType: !295, size: 80, offset: 18896)
!295 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 80, elements: !296)
!296 = !{!297}
!297 = !DISubrange(count: 10)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "idx8ctype", scope: !259, file: !181, line: 183, baseType: !203, size: 64, offset: 19008)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8ctype", scope: !259, file: !181, line: 184, baseType: !203, size: 64, offset: 19072)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "idx8uplow", scope: !259, file: !181, line: 185, baseType: !203, size: 64, offset: 19136)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8uplow", scope: !259, file: !181, line: 186, baseType: !203, size: 64, offset: 19200)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "idx8c2wc", scope: !259, file: !181, line: 188, baseType: !203, size: 64, offset: 19264)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8c2wc", scope: !259, file: !181, line: 189, baseType: !205, size: 64, offset: 19328)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "idx8wc2c", scope: !259, file: !181, line: 190, baseType: !203, size: 64, offset: 19392)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8wc2c", scope: !259, file: !181, line: 191, baseType: !203, size: 64, offset: 19456)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "code2flag", scope: !259, file: !181, line: 197, baseType: !205, size: 64, offset: 19520)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "tblwctype", scope: !259, file: !181, line: 199, baseType: !203, size: 64, offset: 19584)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "tblwuplow", scope: !259, file: !181, line: 200, baseType: !203, size: 64, offset: 19648)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "tblwuplow_diff", scope: !259, file: !181, line: 202, baseType: !310, size: 64, offset: 19712)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !312)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !17, line: 40, baseType: !273)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point_wc", scope: !259, file: !181, line: 205, baseType: !314, size: 32, offset: 19776)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !23, line: 74, baseType: !45)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep_wc", scope: !259, file: !181, line: 206, baseType: !314, size: 32, offset: 19808)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point_len", scope: !259, file: !181, line: 207, baseType: !45, size: 32, offset: 19840)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep_len", scope: !259, file: !181, line: 208, baseType: !45, size: 32, offset: 19872)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit0_mb", scope: !259, file: !181, line: 213, baseType: !28, size: 64, offset: 19904)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit1_mb", scope: !259, file: !181, line: 214, baseType: !28, size: 64, offset: 19968)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit2_mb", scope: !259, file: !181, line: 215, baseType: !28, size: 64, offset: 20032)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit3_mb", scope: !259, file: !181, line: 216, baseType: !28, size: 64, offset: 20096)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit4_mb", scope: !259, file: !181, line: 217, baseType: !28, size: 64, offset: 20160)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit5_mb", scope: !259, file: !181, line: 218, baseType: !28, size: 64, offset: 20224)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit6_mb", scope: !259, file: !181, line: 219, baseType: !28, size: 64, offset: 20288)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit7_mb", scope: !259, file: !181, line: 220, baseType: !28, size: 64, offset: 20352)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit8_mb", scope: !259, file: !181, line: 221, baseType: !28, size: 64, offset: 20416)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit9_mb", scope: !259, file: !181, line: 222, baseType: !28, size: 64, offset: 20480)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "codeset", scope: !259, file: !181, line: 223, baseType: !28, size: 64, offset: 20544)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point", scope: !259, file: !181, line: 226, baseType: !28, size: 64, offset: 20608)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep", scope: !259, file: !181, line: 227, baseType: !28, size: 64, offset: 20672)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "grouping", scope: !259, file: !181, line: 228, baseType: !28, size: 64, offset: 20736)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "int_curr_symbol", scope: !259, file: !181, line: 231, baseType: !28, size: 64, offset: 20800)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "currency_symbol", scope: !259, file: !181, line: 232, baseType: !28, size: 64, offset: 20864)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "mon_decimal_point", scope: !259, file: !181, line: 233, baseType: !28, size: 64, offset: 20928)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "mon_thousands_sep", scope: !259, file: !181, line: 234, baseType: !28, size: 64, offset: 20992)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "mon_grouping", scope: !259, file: !181, line: 235, baseType: !28, size: 64, offset: 21056)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "positive_sign", scope: !259, file: !181, line: 236, baseType: !28, size: 64, offset: 21120)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "negative_sign", scope: !259, file: !181, line: 237, baseType: !28, size: 64, offset: 21184)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "int_frac_digits", scope: !259, file: !181, line: 238, baseType: !28, size: 64, offset: 21248)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "frac_digits", scope: !259, file: !181, line: 239, baseType: !28, size: 64, offset: 21312)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "p_cs_precedes", scope: !259, file: !181, line: 240, baseType: !28, size: 64, offset: 21376)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "p_sep_by_space", scope: !259, file: !181, line: 241, baseType: !28, size: 64, offset: 21440)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "n_cs_precedes", scope: !259, file: !181, line: 242, baseType: !28, size: 64, offset: 21504)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "n_sep_by_space", scope: !259, file: !181, line: 243, baseType: !28, size: 64, offset: 21568)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "p_sign_posn", scope: !259, file: !181, line: 244, baseType: !28, size: 64, offset: 21632)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "n_sign_posn", scope: !259, file: !181, line: 245, baseType: !28, size: 64, offset: 21696)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_cs_precedes", scope: !259, file: !181, line: 246, baseType: !28, size: 64, offset: 21760)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sep_by_space", scope: !259, file: !181, line: 247, baseType: !28, size: 64, offset: 21824)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_cs_precedes", scope: !259, file: !181, line: 248, baseType: !28, size: 64, offset: 21888)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sep_by_space", scope: !259, file: !181, line: 249, baseType: !28, size: 64, offset: 21952)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sign_posn", scope: !259, file: !181, line: 250, baseType: !28, size: 64, offset: 22016)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sign_posn", scope: !259, file: !181, line: 251, baseType: !28, size: 64, offset: 22080)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "crncystr", scope: !259, file: !181, line: 253, baseType: !28, size: 64, offset: 22144)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "abday_1", scope: !259, file: !181, line: 256, baseType: !28, size: 64, offset: 22208)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "abday_2", scope: !259, file: !181, line: 257, baseType: !28, size: 64, offset: 22272)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "abday_3", scope: !259, file: !181, line: 258, baseType: !28, size: 64, offset: 22336)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "abday_4", scope: !259, file: !181, line: 259, baseType: !28, size: 64, offset: 22400)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "abday_5", scope: !259, file: !181, line: 260, baseType: !28, size: 64, offset: 22464)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "abday_6", scope: !259, file: !181, line: 261, baseType: !28, size: 64, offset: 22528)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "abday_7", scope: !259, file: !181, line: 262, baseType: !28, size: 64, offset: 22592)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "day_1", scope: !259, file: !181, line: 264, baseType: !28, size: 64, offset: 22656)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "day_2", scope: !259, file: !181, line: 265, baseType: !28, size: 64, offset: 22720)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "day_3", scope: !259, file: !181, line: 266, baseType: !28, size: 64, offset: 22784)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "day_4", scope: !259, file: !181, line: 267, baseType: !28, size: 64, offset: 22848)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "day_5", scope: !259, file: !181, line: 268, baseType: !28, size: 64, offset: 22912)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "day_6", scope: !259, file: !181, line: 269, baseType: !28, size: 64, offset: 22976)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "day_7", scope: !259, file: !181, line: 270, baseType: !28, size: 64, offset: 23040)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_1", scope: !259, file: !181, line: 272, baseType: !28, size: 64, offset: 23104)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_2", scope: !259, file: !181, line: 273, baseType: !28, size: 64, offset: 23168)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_3", scope: !259, file: !181, line: 274, baseType: !28, size: 64, offset: 23232)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_4", scope: !259, file: !181, line: 275, baseType: !28, size: 64, offset: 23296)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_5", scope: !259, file: !181, line: 276, baseType: !28, size: 64, offset: 23360)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_6", scope: !259, file: !181, line: 277, baseType: !28, size: 64, offset: 23424)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_7", scope: !259, file: !181, line: 278, baseType: !28, size: 64, offset: 23488)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_8", scope: !259, file: !181, line: 279, baseType: !28, size: 64, offset: 23552)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_9", scope: !259, file: !181, line: 280, baseType: !28, size: 64, offset: 23616)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_10", scope: !259, file: !181, line: 281, baseType: !28, size: 64, offset: 23680)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_11", scope: !259, file: !181, line: 282, baseType: !28, size: 64, offset: 23744)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_12", scope: !259, file: !181, line: 283, baseType: !28, size: 64, offset: 23808)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "mon_1", scope: !259, file: !181, line: 285, baseType: !28, size: 64, offset: 23872)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "mon_2", scope: !259, file: !181, line: 286, baseType: !28, size: 64, offset: 23936)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "mon_3", scope: !259, file: !181, line: 287, baseType: !28, size: 64, offset: 24000)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "mon_4", scope: !259, file: !181, line: 288, baseType: !28, size: 64, offset: 24064)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "mon_5", scope: !259, file: !181, line: 289, baseType: !28, size: 64, offset: 24128)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "mon_6", scope: !259, file: !181, line: 290, baseType: !28, size: 64, offset: 24192)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "mon_7", scope: !259, file: !181, line: 291, baseType: !28, size: 64, offset: 24256)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "mon_8", scope: !259, file: !181, line: 292, baseType: !28, size: 64, offset: 24320)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "mon_9", scope: !259, file: !181, line: 293, baseType: !28, size: 64, offset: 24384)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "mon_10", scope: !259, file: !181, line: 294, baseType: !28, size: 64, offset: 24448)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "mon_11", scope: !259, file: !181, line: 295, baseType: !28, size: 64, offset: 24512)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "mon_12", scope: !259, file: !181, line: 296, baseType: !28, size: 64, offset: 24576)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "am_str", scope: !259, file: !181, line: 298, baseType: !28, size: 64, offset: 24640)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "pm_str", scope: !259, file: !181, line: 299, baseType: !28, size: 64, offset: 24704)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "d_t_fmt", scope: !259, file: !181, line: 301, baseType: !28, size: 64, offset: 24768)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "d_fmt", scope: !259, file: !181, line: 302, baseType: !28, size: 64, offset: 24832)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "t_fmt", scope: !259, file: !181, line: 303, baseType: !28, size: 64, offset: 24896)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "t_fmt_ampm", scope: !259, file: !181, line: 304, baseType: !28, size: 64, offset: 24960)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "era", scope: !259, file: !181, line: 305, baseType: !28, size: 64, offset: 25024)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "era_year", scope: !259, file: !181, line: 307, baseType: !28, size: 64, offset: 25088)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "era_d_fmt", scope: !259, file: !181, line: 308, baseType: !28, size: 64, offset: 25152)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "alt_digits", scope: !259, file: !181, line: 309, baseType: !28, size: 64, offset: 25216)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "era_d_t_fmt", scope: !259, file: !181, line: 310, baseType: !28, size: 64, offset: 25280)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "era_t_fmt", scope: !259, file: !181, line: 311, baseType: !28, size: 64, offset: 25344)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "yesexpr", scope: !259, file: !181, line: 316, baseType: !28, size: 64, offset: 25408)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "noexpr", scope: !259, file: !181, line: 317, baseType: !28, size: 64, offset: 25472)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "yesstr", scope: !259, file: !181, line: 318, baseType: !28, size: 64, offset: 25536)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "nostr", scope: !259, file: !181, line: 319, baseType: !28, size: 64, offset: 25600)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "collate", scope: !259, file: !181, line: 322, baseType: !409, size: 896, offset: 25664)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "__collate_t", file: !181, line: 149, baseType: !410)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !181, line: 111, size: 896, elements: !411)
!411 = !{!412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !437, !438}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "num_weights", scope: !410, file: !181, line: 112, baseType: !207, size: 16)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "num_starters", scope: !410, file: !181, line: 113, baseType: !207, size: 16, offset: 16)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "ii_shift", scope: !410, file: !181, line: 114, baseType: !207, size: 16, offset: 32)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "ti_shift", scope: !410, file: !181, line: 115, baseType: !207, size: 16, offset: 48)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "ii_len", scope: !410, file: !181, line: 116, baseType: !207, size: 16, offset: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "ti_len", scope: !410, file: !181, line: 117, baseType: !207, size: 16, offset: 80)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "max_weight", scope: !410, file: !181, line: 118, baseType: !207, size: 16, offset: 96)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "num_col_base", scope: !410, file: !181, line: 119, baseType: !207, size: 16, offset: 112)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "max_col_index", scope: !410, file: !181, line: 120, baseType: !207, size: 16, offset: 128)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "undefined_idx", scope: !410, file: !181, line: 121, baseType: !207, size: 16, offset: 144)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "range_low", scope: !410, file: !181, line: 122, baseType: !207, size: 16, offset: 160)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "range_count", scope: !410, file: !181, line: 123, baseType: !207, size: 16, offset: 176)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "range_base_weight", scope: !410, file: !181, line: 124, baseType: !207, size: 16, offset: 192)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "range_rule_offset", scope: !410, file: !181, line: 125, baseType: !207, size: 16, offset: 208)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "ii_mask", scope: !410, file: !181, line: 127, baseType: !207, size: 16, offset: 224)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "ti_mask", scope: !410, file: !181, line: 128, baseType: !207, size: 16, offset: 240)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "index2weight_tbl", scope: !410, file: !181, line: 130, baseType: !205, size: 64, offset: 256)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "index2ruleidx_tbl", scope: !410, file: !181, line: 131, baseType: !205, size: 64, offset: 320)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "multistart_tbl", scope: !410, file: !181, line: 132, baseType: !205, size: 64, offset: 384)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "wcs2colidt_tbl", scope: !410, file: !181, line: 135, baseType: !205, size: 64, offset: 448)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "overrides_tbl", scope: !410, file: !181, line: 138, baseType: !205, size: 64, offset: 512)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "weightstr", scope: !410, file: !181, line: 141, baseType: !205, size: 64, offset: 576)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "ruletable", scope: !410, file: !181, line: 142, baseType: !205, size: 64, offset: 640)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "index2weight", scope: !410, file: !181, line: 145, baseType: !436, size: 64, offset: 704)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "index2ruleidx", scope: !410, file: !181, line: 146, baseType: !436, size: 64, offset: 768)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "MAX_WEIGHTS", scope: !410, file: !181, line: 148, baseType: !207, size: 16, offset: 832)
!439 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression())
!440 = distinct !DIGlobalVariable(name: "__curlocale_var", scope: !177, file: !212, line: 380, type: !257, isLocal: false, isDefinition: true)
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(name: "utf8", scope: !177, file: !212, line: 387, type: !443, isLocal: true, isDefinition: true)
!443 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 48, elements: !288)
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(name: "ascii", scope: !177, file: !212, line: 388, type: !443, isLocal: true, isDefinition: true)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(name: "__code2flag", scope: !177, file: !212, line: 854, type: !448, isLocal: true, isDefinition: true)
!448 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 256, elements: !449)
!449 = !{!450}
!450 = !DISubrange(count: 16)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uclibc_locale_t", file: !181, line: 324, baseType: !259)
!452 = !DIGlobalVariableExpression(var: !453, expr: !DIExpression())
!453 = distinct !DIGlobalVariable(name: "_stdio_streams", scope: !454, file: !455, line: 131, type: !499, isLocal: true, isDefinition: true)
!454 = distinct !DICompileUnit(language: DW_LANG_C99, file: !455, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !456, splitDebugInlining: false, nameTableKind: None)
!455 = !DIFile(filename: "libc/stdio/_stdio.c", directory: "/home/shafi/Research/KLEE/klee-uclibc", checksumkind: CSK_MD5, checksum: "4be07f3b0ecb392ed80de3da184d87ae")
!456 = !{!457, !489, !491, !493, !495, !497, !452}
!457 = !DIGlobalVariableExpression(var: !458, expr: !DIExpression())
!458 = distinct !DIGlobalVariable(name: "stdin", scope: !454, file: !455, line: 154, type: !459, isLocal: false, isDefinition: true)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !461, line: 46, baseType: !462)
!461 = !DIFile(filename: "./include/stdio.h", directory: "/home/shafi/Research/KLEE/klee-uclibc", checksumkind: CSK_MD5, checksum: "70cf100e22d87317ae53d38f310fbf54")
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__STDIO_FILE_STRUCT", file: !463, line: 233, size: 704, elements: !464)
!463 = !DIFile(filename: "./include/bits/uClibc_stdio.h", directory: "/home/shafi/Research/KLEE/klee-uclibc", checksumkind: CSK_MD5, checksum: "f3087838ed931057d6634bfd1a454d76")
!464 = !{!465, !466, !470, !471, !472, !473, !474, !475, !476, !477, !479, !481, !488}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "__modeflags", scope: !462, file: !463, line: 234, baseType: !94, size: 16)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "__ungot_width", scope: !462, file: !463, line: 237, baseType: !467, size: 16, offset: 16)
!467 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 16, elements: !468)
!468 = !{!469}
!469 = !DISubrange(count: 2)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "__filedes", scope: !462, file: !463, line: 244, baseType: !45, size: 32, offset: 32)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "__bufstart", scope: !462, file: !463, line: 246, baseType: !209, size: 64, offset: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "__bufend", scope: !462, file: !463, line: 247, baseType: !209, size: 64, offset: 128)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "__bufpos", scope: !462, file: !463, line: 248, baseType: !209, size: 64, offset: 192)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "__bufread", scope: !462, file: !463, line: 249, baseType: !209, size: 64, offset: 256)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "__bufgetc_u", scope: !462, file: !463, line: 252, baseType: !209, size: 64, offset: 320)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "__bufputc_u", scope: !462, file: !463, line: 255, baseType: !209, size: 64, offset: 384)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "__nextopen", scope: !462, file: !463, line: 261, baseType: !478, size: 64, offset: 448)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "__ungot", scope: !462, file: !463, line: 268, baseType: !480, size: 64, offset: 512)
!480 = !DICompositeType(tag: DW_TAG_array_type, baseType: !314, size: 64, elements: !468)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "__state", scope: !462, file: !463, line: 271, baseType: !482, size: 64, offset: 576)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !483, line: 85, baseType: !484)
!483 = !DIFile(filename: "./include/wchar.h", directory: "/home/shafi/Research/KLEE/klee-uclibc", checksumkind: CSK_MD5, checksum: "8ff64f580ee3668870eb49bcbfa374a6")
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !483, line: 81, size: 64, elements: !485)
!485 = !{!486, !487}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "__mask", scope: !484, file: !483, line: 83, baseType: !314, size: 32)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "__wc", scope: !484, file: !483, line: 84, baseType: !314, size: 32, offset: 32)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !462, file: !463, line: 274, baseType: !5, size: 64, offset: 640)
!489 = !DIGlobalVariableExpression(var: !490, expr: !DIExpression())
!490 = distinct !DIGlobalVariable(name: "stdout", scope: !454, file: !455, line: 155, type: !459, isLocal: false, isDefinition: true)
!491 = !DIGlobalVariableExpression(var: !492, expr: !DIExpression())
!492 = distinct !DIGlobalVariable(name: "stderr", scope: !454, file: !455, line: 156, type: !459, isLocal: false, isDefinition: true)
!493 = !DIGlobalVariableExpression(var: !494, expr: !DIExpression())
!494 = distinct !DIGlobalVariable(name: "__stdin", scope: !454, file: !455, line: 159, type: !459, isLocal: false, isDefinition: true)
!495 = !DIGlobalVariableExpression(var: !496, expr: !DIExpression())
!496 = distinct !DIGlobalVariable(name: "__stdout", scope: !454, file: !455, line: 162, type: !459, isLocal: false, isDefinition: true)
!497 = !DIGlobalVariableExpression(var: !498, expr: !DIExpression())
!498 = distinct !DIGlobalVariable(name: "_stdio_openlist", scope: !454, file: !455, line: 180, type: !459, isLocal: false, isDefinition: true)
!499 = !DICompositeType(tag: DW_TAG_array_type, baseType: !460, size: 2112, elements: !137)
!500 = !DIGlobalVariableExpression(var: !501, expr: !DIExpression())
!501 = distinct !DIGlobalVariable(name: "been_there_done_that", scope: !502, file: !503, line: 49, type: !45, isLocal: true, isDefinition: true)
!502 = distinct !DICompileUnit(language: DW_LANG_C99, file: !503, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !504, globals: !518, splitDebugInlining: false, nameTableKind: None)
!503 = !DIFile(filename: "libc/stdlib/abort.c", directory: "/home/shafi/Research/KLEE/klee-uclibc", checksumkind: CSK_MD5, checksum: "1b6a5002c8ccbecac21fd5865047b001")
!504 = !{!505, !5, !514}
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !507, line: 50, baseType: !508)
!507 = !DIFile(filename: "./include/signal.h", directory: "/home/shafi/Research/KLEE/klee-uclibc", checksumkind: CSK_MD5, checksum: "7a473019838bc8a086e72b07da7e12b6")
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !509, line: 31, baseType: !510)
!509 = !DIFile(filename: "./include/bits/sigset.h", directory: "/home/shafi/Research/KLEE/klee-uclibc", checksumkind: CSK_MD5, checksum: "5be4663919ae70a2a63143f4cf3e23c1")
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !509, line: 28, size: 1024, elements: !511)
!511 = !{!512}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !510, file: !509, line: 30, baseType: !513, size: 1024)
!513 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 1024, elements: !449)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !507, line: 75, baseType: !515)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = !DISubroutineType(types: !517)
!517 = !{null, !45}
!518 = !{!500}
!519 = !DIGlobalVariableExpression(var: !520, expr: !DIExpression())
!520 = distinct !DIGlobalVariable(name: "__exit_cleanup", scope: !521, file: !524, line: 309, type: !515, isLocal: false, isDefinition: true)
!521 = distinct !DICompileUnit(language: DW_LANG_C99, file: !522, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !523, splitDebugInlining: false, nameTableKind: None)
!522 = !DIFile(filename: "libc/stdlib/exit.c", directory: "/home/shafi/Research/KLEE/klee-uclibc", checksumkind: CSK_MD5, checksum: "d048e19c57c2fb60337762a73956895f")
!523 = !{!519}
!524 = !DIFile(filename: "libc/stdlib/_atexit.c", directory: "/home/shafi/Research/KLEE/klee-uclibc", checksumkind: CSK_MD5, checksum: "4ac01cfeb6d56cd88c0c7f25523d13d7")
!525 = !DIGlobalVariableExpression(var: !526, expr: !DIExpression())
!526 = distinct !DIGlobalVariable(name: "mSmmMemLibInternalMaximumSupportAddress", scope: !527, file: !2928, line: 43, type: !774, isLocal: false, isDefinition: true)
!527 = distinct !DICompileUnit(language: DW_LANG_C99, file: !528, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !529, retainedTypes: !752, globals: !2925, splitDebugInlining: false, nameTableKind: None)
!528 = !DIFile(filename: "stase_driver.c", directory: "/home/shafi/Research/Repositories/stase-edk2", checksumkind: CSK_MD5, checksum: "a61d5ed26ab7726f7ecf375e4e52511d")
!529 = !{!530, !541, !561, !567, !574, !579, !582, !587, !594, !599, !607, !613, !620, !629, !641, !655, !663, !674, !686, !699, !711, !718, !729, !741, !746}
!530 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !531, line: 21, baseType: !62, size: 32, elements: !532)
!531 = !DIFile(filename: "demo2_edk2/MdePkg/Include/Pi/PiDxeCis.h", directory: "/home/shafi/Research/Repositories/stase-edk2", checksumkind: CSK_MD5, checksum: "f8fbd2fd810a3e95190520b13c8ac78c")
!532 = !{!533, !534, !535, !536, !537, !538, !539, !540}
!533 = !DIEnumerator(name: "EfiGcdMemoryTypeNonExistent", value: 0)
!534 = !DIEnumerator(name: "EfiGcdMemoryTypeReserved", value: 1)
!535 = !DIEnumerator(name: "EfiGcdMemoryTypeSystemMemory", value: 2)
!536 = !DIEnumerator(name: "EfiGcdMemoryTypeMemoryMappedIo", value: 3)
!537 = !DIEnumerator(name: "EfiGcdMemoryTypePersistent", value: 4)
!538 = !DIEnumerator(name: "EfiGcdMemoryTypePersistentMemory", value: 4)
!539 = !DIEnumerator(name: "EfiGcdMemoryTypeMoreReliable", value: 5)
!540 = !DIEnumerator(name: "EfiGcdMemoryTypeMaximum", value: 7)
!541 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !542, line: 38, baseType: !62, size: 32, elements: !543)
!542 = !DIFile(filename: "demo2_edk2/MdePkg/Include/Uefi/UefiMultiPhase.h", directory: "/home/shafi/Research/Repositories/stase-edk2", checksumkind: CSK_MD5, checksum: "5f5d4fa5712a85da1fcfc32ccda19642")
!543 = !{!544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560}
!544 = !DIEnumerator(name: "EfiReservedMemoryType", value: 0)
!545 = !DIEnumerator(name: "EfiLoaderCode", value: 1)
!546 = !DIEnumerator(name: "EfiLoaderData", value: 2)
!547 = !DIEnumerator(name: "EfiBootServicesCode", value: 3)
!548 = !DIEnumerator(name: "EfiBootServicesData", value: 4)
!549 = !DIEnumerator(name: "EfiRuntimeServicesCode", value: 5)
!550 = !DIEnumerator(name: "EfiRuntimeServicesData", value: 6)
!551 = !DIEnumerator(name: "EfiConventionalMemory", value: 7)
!552 = !DIEnumerator(name: "EfiUnusableMemory", value: 8)
!553 = !DIEnumerator(name: "EfiACPIReclaimMemory", value: 9)
!554 = !DIEnumerator(name: "EfiACPIMemoryNVS", value: 10)
!555 = !DIEnumerator(name: "EfiMemoryMappedIO", value: 11)
!556 = !DIEnumerator(name: "EfiMemoryMappedIOPortSpace", value: 12)
!557 = !DIEnumerator(name: "EfiPalCode", value: 13)
!558 = !DIEnumerator(name: "EfiPersistentMemory", value: 14)
!559 = !DIEnumerator(name: "EfiUnacceptedMemoryType", value: 15)
!560 = !DIEnumerator(name: "EfiMaxMemoryType", value: 16)
!561 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !542, line: 117, baseType: !62, size: 32, elements: !562)
!562 = !{!563, !564, !565, !566}
!563 = !DIEnumerator(name: "EfiResetCold", value: 0)
!564 = !DIEnumerator(name: "EfiResetWarm", value: 1)
!565 = !DIEnumerator(name: "EfiResetShutdown", value: 2)
!566 = !DIEnumerator(name: "EfiResetPlatformSpecific", value: 3)
!567 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !568, line: 29, baseType: !62, size: 32, elements: !569)
!568 = !DIFile(filename: "demo2_edk2/MdePkg/Include/Uefi/UefiSpec.h", directory: "/home/shafi/Research/Repositories/stase-edk2", checksumkind: CSK_MD5, checksum: "366008dc80ead17aa51577c11b5cc1f1")
!569 = !{!570, !571, !572, !573}
!570 = !DIEnumerator(name: "AllocateAnyPages", value: 0)
!571 = !DIEnumerator(name: "AllocateMaxAddress", value: 1)
!572 = !DIEnumerator(name: "AllocateAddress", value: 2)
!573 = !DIEnumerator(name: "MaxAllocateType", value: 3)
!574 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !568, line: 506, baseType: !62, size: 32, elements: !575)
!575 = !{!576, !577, !578}
!576 = !DIEnumerator(name: "TimerCancel", value: 0)
!577 = !DIEnumerator(name: "TimerPeriodic", value: 1)
!578 = !DIEnumerator(name: "TimerRelative", value: 2)
!579 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !568, line: 1144, baseType: !62, size: 32, elements: !580)
!580 = !{!581}
!581 = !DIEnumerator(name: "EFI_NATIVE_INTERFACE", value: 0)
!582 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !568, line: 1460, baseType: !62, size: 32, elements: !583)
!583 = !{!584, !585, !586}
!584 = !DIEnumerator(name: "AllHandles", value: 0)
!585 = !DIEnumerator(name: "ByRegisterNotify", value: 1)
!586 = !DIEnumerator(name: "ByProtocol", value: 2)
!587 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !588, line: 24, baseType: !62, size: 32, elements: !589)
!588 = !DIFile(filename: "demo2_edk2/MdePkg/Include/Protocol/MmCpuIo.h", directory: "/home/shafi/Research/Repositories/stase-edk2", checksumkind: CSK_MD5, checksum: "21dc8412795b847df3cd212dc1f10267")
!589 = !{!590, !591, !592, !593}
!590 = !DIEnumerator(name: "MM_IO_UINT8", value: 0)
!591 = !DIEnumerator(name: "MM_IO_UINT16", value: 1)
!592 = !DIEnumerator(name: "MM_IO_UINT32", value: 2)
!593 = !DIEnumerator(name: "MM_IO_UINT64", value: 3)
!594 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !595, line: 44, baseType: !62, size: 32, elements: !596)
!595 = !DIFile(filename: "./demo2_edk2/MdeModulePkg/Universal/Variable/RuntimeDxe/TcgMorLockSmm.c", directory: "/home/shafi/Research/Repositories/stase-edk2", checksumkind: CSK_MD5, checksum: "a089f6b9810965929f3b7aa2192d0d2e")
!596 = !{!597, !598}
!597 = !DIEnumerator(name: "MorLockStateUnlocked", value: 0)
!598 = !DIEnumerator(name: "MorLockStateLocked", value: 1)
!599 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !531, line: 95, baseType: !62, size: 32, elements: !600)
!600 = !{!601, !602, !603, !604, !605, !606}
!601 = !DIEnumerator(name: "EfiGcdAllocateAnySearchBottomUp", value: 0)
!602 = !DIEnumerator(name: "EfiGcdAllocateMaxAddressSearchBottomUp", value: 1)
!603 = !DIEnumerator(name: "EfiGcdAllocateAddress", value: 2)
!604 = !DIEnumerator(name: "EfiGcdAllocateAnySearchTopDown", value: 3)
!605 = !DIEnumerator(name: "EfiGcdAllocateMaxAddressSearchTopDown", value: 4)
!606 = !DIEnumerator(name: "EfiGcdMaxAllocateType", value: 5)
!607 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !531, line: 73, baseType: !62, size: 32, elements: !608)
!608 = !{!609, !610, !611, !612}
!609 = !DIEnumerator(name: "EfiGcdIoTypeNonExistent", value: 0)
!610 = !DIEnumerator(name: "EfiGcdIoTypeReserved", value: 1)
!611 = !DIEnumerator(name: "EfiGcdIoTypeIo", value: 2)
!612 = !DIEnumerator(name: "EfiGcdIoTypeMaximum", value: 3)
!613 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !614, line: 14, baseType: !62, size: 32, elements: !615)
!614 = !DIFile(filename: "demo2_edk2/MdeModulePkg/Include/Library/VarCheckLib.h", directory: "/home/shafi/Research/Repositories/stase-edk2", checksumkind: CSK_MD5, checksum: "4f61cd513e758fc04d7c69aaee184b9d")
!615 = !{!616, !617, !618, !619}
!616 = !DIEnumerator(name: "VarCheckRequestReserved0", value: 0)
!617 = !DIEnumerator(name: "VarCheckRequestReserved1", value: 1)
!618 = !DIEnumerator(name: "VarCheckFromTrusted", value: 2)
!619 = !DIEnumerator(name: "VarCheckFromUntrusted", value: 3)
!620 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !621, line: 28, baseType: !62, size: 32, elements: !622)
!621 = !DIFile(filename: "demo2_edk2/MdePkg/Include/Protocol/Ip4Config2.h", directory: "/home/shafi/Research/Repositories/stase-edk2", checksumkind: CSK_MD5, checksum: "6f57a2cc9bafccc9bbc0a22671af9a71")
!622 = !{!623, !624, !625, !626, !627, !628}
!623 = !DIEnumerator(name: "Ip4Config2DataTypeInterfaceInfo", value: 0)
!624 = !DIEnumerator(name: "Ip4Config2DataTypePolicy", value: 1)
!625 = !DIEnumerator(name: "Ip4Config2DataTypeManualAddress", value: 2)
!626 = !DIEnumerator(name: "Ip4Config2DataTypeGateway", value: 3)
!627 = !DIEnumerator(name: "Ip4Config2DataTypeDnsServer", value: 4)
!628 = !DIEnumerator(name: "Ip4Config2DataTypeMaximum", value: 5)
!629 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !630, line: 98, baseType: !62, size: 32, elements: !631)
!630 = !DIFile(filename: "demo2_edk2/MdePkg/Include/Protocol/Dhcp4.h", directory: "/home/shafi/Research/Repositories/stase-edk2", checksumkind: CSK_MD5, checksum: "a08ac256f108a02ab5f40fe69a7510a0")
!631 = !{!632, !633, !634, !635, !636, !637, !638, !639, !640}
!632 = !DIEnumerator(name: "Dhcp4Stopped", value: 0)
!633 = !DIEnumerator(name: "Dhcp4Init", value: 1)
!634 = !DIEnumerator(name: "Dhcp4Selecting", value: 2)
!635 = !DIEnumerator(name: "Dhcp4Requesting", value: 3)
!636 = !DIEnumerator(name: "Dhcp4Bound", value: 4)
!637 = !DIEnumerator(name: "Dhcp4Renewing", value: 5)
!638 = !DIEnumerator(name: "Dhcp4Rebinding", value: 6)
!639 = !DIEnumerator(name: "Dhcp4InitReboot", value: 7)
!640 = !DIEnumerator(name: "Dhcp4Rebooting", value: 8)
!641 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !630, line: 141, baseType: !62, size: 32, elements: !642)
!642 = !{!643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654}
!643 = !DIEnumerator(name: "Dhcp4SendDiscover", value: 1)
!644 = !DIEnumerator(name: "Dhcp4RcvdOffer", value: 2)
!645 = !DIEnumerator(name: "Dhcp4SelectOffer", value: 3)
!646 = !DIEnumerator(name: "Dhcp4SendRequest", value: 4)
!647 = !DIEnumerator(name: "Dhcp4RcvdAck", value: 5)
!648 = !DIEnumerator(name: "Dhcp4RcvdNak", value: 6)
!649 = !DIEnumerator(name: "Dhcp4SendDecline", value: 7)
!650 = !DIEnumerator(name: "Dhcp4BoundCompleted", value: 8)
!651 = !DIEnumerator(name: "Dhcp4EnterRenewing", value: 9)
!652 = !DIEnumerator(name: "Dhcp4EnterRebinding", value: 10)
!653 = !DIEnumerator(name: "Dhcp4AddressLost", value: 11)
!654 = !DIEnumerator(name: "Dhcp4Fail", value: 12)
!655 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !656, line: 249, baseType: !62, size: 32, elements: !657)
!656 = !DIFile(filename: "demo2_edk2/MdePkg/Include/Protocol/Ip6.h", directory: "/home/shafi/Research/Repositories/stase-edk2", checksumkind: CSK_MD5, checksum: "d5efa26fd8585bff2df9a55aca9f623f")
!657 = !{!658, !659, !660, !661, !662}
!658 = !DIEnumerator(name: "EfiNeighborInComplete", value: 0)
!659 = !DIEnumerator(name: "EfiNeighborReachable", value: 1)
!660 = !DIEnumerator(name: "EfiNeighborStale", value: 2)
!661 = !DIEnumerator(name: "EfiNeighborDelay", value: 3)
!662 = !DIEnumerator(name: "EfiNeighborProbe", value: 4)
!663 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !664, line: 25, baseType: !62, size: 32, elements: !665)
!664 = !DIFile(filename: "demo2_edk2/MdePkg/Include/Protocol/Ip6Config.h", directory: "/home/shafi/Research/Repositories/stase-edk2", checksumkind: CSK_MD5, checksum: "d41e511bf11c9eb1afc219004c0e8d36")
!665 = !{!666, !667, !668, !669, !670, !671, !672, !673}
!666 = !DIEnumerator(name: "Ip6ConfigDataTypeInterfaceInfo", value: 0)
!667 = !DIEnumerator(name: "Ip6ConfigDataTypeAltInterfaceId", value: 1)
!668 = !DIEnumerator(name: "Ip6ConfigDataTypePolicy", value: 2)
!669 = !DIEnumerator(name: "Ip6ConfigDataTypeDupAddrDetectTransmits", value: 3)
!670 = !DIEnumerator(name: "Ip6ConfigDataTypeManualAddress", value: 4)
!671 = !DIEnumerator(name: "Ip6ConfigDataTypeGateway", value: 5)
!672 = !DIEnumerator(name: "Ip6ConfigDataTypeDnsServer", value: 6)
!673 = !DIEnumerator(name: "Ip6ConfigDataTypeMaximum", value: 7)
!674 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !675, line: 28, baseType: !62, size: 32, elements: !676)
!675 = !DIFile(filename: "demo2_edk2/MdePkg/Include/Protocol/Dhcp6.h", directory: "/home/shafi/Research/Repositories/stase-edk2", checksumkind: CSK_MD5, checksum: "bf699e189e28cf80226db9221bce0cd8")
!676 = !{!677, !678, !679, !680, !681, !682, !683, !684, !685}
!677 = !DIEnumerator(name: "Dhcp6Init", value: 0)
!678 = !DIEnumerator(name: "Dhcp6Selecting", value: 1)
!679 = !DIEnumerator(name: "Dhcp6Requesting", value: 2)
!680 = !DIEnumerator(name: "Dhcp6Declining", value: 3)
!681 = !DIEnumerator(name: "Dhcp6Confirming", value: 4)
!682 = !DIEnumerator(name: "Dhcp6Releasing", value: 5)
!683 = !DIEnumerator(name: "Dhcp6Bound", value: 6)
!684 = !DIEnumerator(name: "Dhcp6Renewing", value: 7)
!685 = !DIEnumerator(name: "Dhcp6Rebinding", value: 8)
!686 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !675, line: 76, baseType: !62, size: 32, elements: !687)
!687 = !{!688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698}
!688 = !DIEnumerator(name: "Dhcp6SendSolicit", value: 0)
!689 = !DIEnumerator(name: "Dhcp6RcvdAdvertise", value: 1)
!690 = !DIEnumerator(name: "Dhcp6SelectAdvertise", value: 2)
!691 = !DIEnumerator(name: "Dhcp6SendRequest", value: 3)
!692 = !DIEnumerator(name: "Dhcp6RcvdReply", value: 4)
!693 = !DIEnumerator(name: "Dhcp6RcvdReconfigure", value: 5)
!694 = !DIEnumerator(name: "Dhcp6SendDecline", value: 6)
!695 = !DIEnumerator(name: "Dhcp6SendConfirm", value: 7)
!696 = !DIEnumerator(name: "Dhcp6SendRelease", value: 8)
!697 = !DIEnumerator(name: "Dhcp6EnterRenewing", value: 9)
!698 = !DIEnumerator(name: "Dhcp6EnterRebinding", value: 10)
!699 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !700, line: 192, baseType: !62, size: 32, elements: !701)
!700 = !DIFile(filename: "demo2_edk2/MdePkg/Include/Protocol/PxeBaseCode.h", directory: "/home/shafi/Research/Repositories/stase-edk2", checksumkind: CSK_MD5, checksum: "5c81517a25a11d0772fd25cf3f99822b")
!701 = !{!702, !703, !704, !705, !706, !707, !708, !709, !710}
!702 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_TFTP_FIRST", value: 0)
!703 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_TFTP_GET_FILE_SIZE", value: 1)
!704 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_TFTP_READ_FILE", value: 2)
!705 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_TFTP_WRITE_FILE", value: 3)
!706 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_TFTP_READ_DIRECTORY", value: 4)
!707 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_MTFTP_GET_FILE_SIZE", value: 5)
!708 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_MTFTP_READ_FILE", value: 6)
!709 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_MTFTP_READ_DIRECTORY", value: 7)
!710 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_MTFTP_LAST", value: 8)
!711 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !712, line: 63, baseType: !62, size: 32, elements: !713)
!712 = !DIFile(filename: "demo2_edk2/MdePkg/Include/Protocol/PxeBaseCodeCallBack.h", directory: "/home/shafi/Research/Repositories/stase-edk2", checksumkind: CSK_MD5, checksum: "620f8d98f32292d4cb970381b3122ad5")
!713 = !{!714, !715, !716, !717}
!714 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_CALLBACK_STATUS_FIRST", value: 0)
!715 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_CALLBACK_STATUS_CONTINUE", value: 1)
!716 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_CALLBACK_STATUS_ABORT", value: 2)
!717 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_CALLBACK_STATUS_LAST", value: 3)
!718 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !712, line: 48, baseType: !62, size: 32, elements: !719)
!719 = !{!720, !721, !722, !723, !724, !725, !726, !727, !728}
!720 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_FUNCTION_FIRST", value: 0)
!721 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_FUNCTION_DHCP", value: 1)
!722 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_FUNCTION_DISCOVER", value: 2)
!723 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_FUNCTION_MTFTP", value: 3)
!724 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_FUNCTION_UDP_WRITE", value: 4)
!725 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_FUNCTION_UDP_READ", value: 5)
!726 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_FUNCTION_ARP", value: 6)
!727 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_FUNCTION_IGMP", value: 7)
!728 = !DIEnumerator(name: "EFI_PXE_BASE_CODE_PXE_FUNCTION_LAST", value: 8)
!729 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !730, line: 71, baseType: !62, size: 32, elements: !731)
!730 = !DIFile(filename: "./dynamic_harness/../demo2_edk2/NetworkPkg/UefiPxeBcDxe/PxeBcDhcp4.h", directory: "/home/shafi/Research/Repositories/stase-edk2", checksumkind: CSK_MD5, checksum: "71d8c6a5b4dce053943495bbd9962c1e")
!731 = !{!732, !733, !734, !735, !736, !737, !738, !739, !740}
!732 = !DIEnumerator(name: "PxeOfferTypeDhcpOnly", value: 0)
!733 = !DIEnumerator(name: "PxeOfferTypeDhcpPxe10", value: 1)
!734 = !DIEnumerator(name: "PxeOfferTypeDhcpWfm11a", value: 2)
!735 = !DIEnumerator(name: "PxeOfferTypeDhcpBinl", value: 3)
!736 = !DIEnumerator(name: "PxeOfferTypeProxyPxe10", value: 4)
!737 = !DIEnumerator(name: "PxeOfferTypeProxyWfm11a", value: 5)
!738 = !DIEnumerator(name: "PxeOfferTypeProxyBinl", value: 6)
!739 = !DIEnumerator(name: "PxeOfferTypeBootp", value: 7)
!740 = !DIEnumerator(name: "PxeOfferTypeMax", value: 8)
!741 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !621, line: 127, baseType: !62, size: 32, elements: !742)
!742 = !{!743, !744, !745}
!743 = !DIEnumerator(name: "Ip4Config2PolicyStatic", value: 0)
!744 = !DIEnumerator(name: "Ip4Config2PolicyDhcp", value: 1)
!745 = !DIEnumerator(name: "Ip4Config2PolicyMax", value: 2)
!746 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !747, line: 49, baseType: !62, size: 32, elements: !748)
!747 = !DIFile(filename: "demo2_edk2/MdePkg/Include/Library/UefiLib.h", directory: "/home/shafi/Research/Repositories/stase-edk2", checksumkind: CSK_MD5, checksum: "04ce8e95867d80f73e00f19a41f14cfd")
!748 = !{!749, !750, !751}
!749 = !DIEnumerator(name: "EfiLockUninitialized", value: 0)
!750 = !DIEnumerator(name: "EfiLockReleased", value: 1)
!751 = !DIEnumerator(name: "EfiLockAcquired", value: 2)
!752 = !{!5, !753, !769, !773, !774, !777, !778, !788, !789, !791, !794, !795, !796, !798, !800, !801, !792, !776, !767, !803, !827, !843, !844, !851, !860, !868, !9, !873, !880, !896, !903, !909, !947, !952, !957, !965, !972, !973, !980, !985, !1002, !2673, !2919, !763, !1492}
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_HOB_CPU", file: !755, line: 462, baseType: !756)
!755 = !DIFile(filename: "demo2_edk2/MdePkg/Include/Pi/PiHob.h", directory: "/home/shafi/Research/Repositories/stase-edk2", checksumkind: CSK_MD5, checksum: "dec7eaaeb0fbb70f2707cfed7d02e8ea")
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !755, line: 445, size: 128, elements: !757)
!757 = !{!758, !768, !770, !771}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "Header", scope: !756, file: !755, line: 449, baseType: !759, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_HOB_GENERIC_HEADER", file: !755, line: 49, baseType: !760)
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !755, line: 36, size: 64, elements: !761)
!761 = !{!762, !765, !766}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "HobType", scope: !760, file: !755, line: 40, baseType: !763, size: 16)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT16", file: !764, line: 178, baseType: !94)
!764 = !DIFile(filename: "demo2_edk2/MdePkg/Include/X64/ProcessorBind.h", directory: "/home/shafi/Research/Repositories/stase-edk2", checksumkind: CSK_MD5, checksum: "ef2524a221fe61206fa09ec88dd4f59b")
!765 = !DIDerivedType(tag: DW_TAG_member, name: "HobLength", scope: !760, file: !755, line: 44, baseType: !763, size: 16, offset: 16)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved", scope: !760, file: !755, line: 48, baseType: !767, size: 32, offset: 32)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT32", file: !764, line: 170, baseType: !62)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "SizeOfMemorySpace", scope: !756, file: !755, line: 453, baseType: !769, size: 8, offset: 64)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT8", file: !764, line: 196, baseType: !96)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "SizeOfIoSpace", scope: !756, file: !755, line: 457, baseType: !769, size: 8, offset: 72)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved", scope: !756, file: !755, line: 461, baseType: !772, size: 48, offset: 80)
!772 = !DICompositeType(tag: DW_TAG_array_type, baseType: !769, size: 48, elements: !288)
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "BOOLEAN", file: !764, line: 192, baseType: !96)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_PHYSICAL_ADDRESS", file: !775, line: 50, baseType: !776)
!775 = !DIFile(filename: "demo2_edk2/MdePkg/Include/Uefi/UefiBaseType.h", directory: "/home/shafi/Research/Repositories/stase-edk2", checksumkind: CSK_MD5, checksum: "b5eaae1478faf382d749a006f8da41d7")
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT64", file: !764, line: 162, baseType: !24)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINTN", file: !764, line: 211, baseType: !776)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MEMORY_DESCRIPTOR", file: !568, line: 160, baseType: !780)
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !568, line: 128, size: 320, elements: !781)
!781 = !{!782, !783, !784, !786, !787}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !780, file: !568, line: 134, baseType: !767, size: 32)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "PhysicalStart", scope: !780, file: !568, line: 140, baseType: !774, size: 64, offset: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "VirtualStart", scope: !780, file: !568, line: 146, baseType: !785, size: 64, offset: 128)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_VIRTUAL_ADDRESS", file: !775, line: 55, baseType: !776)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "NumberOfPages", scope: !780, file: !568, line: 153, baseType: !776, size: 64, offset: 192)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "Attribute", scope: !780, file: !568, line: 159, baseType: !776, size: 64, offset: 256)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "RETURN_STATUS", file: !790, line: 1026, baseType: !777)
!790 = !DIFile(filename: "demo2_edk2/MdePkg/Include/Base.h", directory: "/home/shafi/Research/Repositories/stase-edk2", checksumkind: CSK_MD5, checksum: "95cde640b56213e70965ab4e1f247822")
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTN", file: !764, line: 216, baseType: !792)
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT64", file: !764, line: 166, baseType: !793)
!793 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !776)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !769)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !767)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SMM_COMMUNICATE_HEADER", file: !805, line: 17, baseType: !806)
!805 = !DIFile(filename: "demo2_edk2/MdePkg/Include/Protocol/SmmCommunication.h", directory: "/home/shafi/Research/Repositories/stase-edk2", checksumkind: CSK_MD5, checksum: "35e63d964366fc37d8178c8879debc7d")
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MM_COMMUNICATE_HEADER", file: !807, line: 34, baseType: !808)
!807 = !DIFile(filename: "demo2_edk2/MdePkg/Include/Protocol/MmCommunication.h", directory: "/home/shafi/Research/Repositories/stase-edk2", checksumkind: CSK_MD5, checksum: "f75635d145543cd744523801edc6e57b")
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !807, line: 21, size: 200, elements: !809)
!809 = !{!810, !822, !823}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "HeaderGuid", scope: !808, file: !807, line: 25, baseType: !811, size: 128)
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GUID", file: !775, line: 25, baseType: !812)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "GUID", file: !790, line: 218, baseType: !813)
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !790, line: 213, size: 128, elements: !814)
!814 = !{!815, !816, !817, !818}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "Data1", scope: !813, file: !790, line: 214, baseType: !767, size: 32)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "Data2", scope: !813, file: !790, line: 215, baseType: !763, size: 16, offset: 32)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "Data3", scope: !813, file: !790, line: 216, baseType: !763, size: 16, offset: 48)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "Data4", scope: !813, file: !790, line: 217, baseType: !819, size: 64, offset: 64)
!819 = !DICompositeType(tag: DW_TAG_array_type, baseType: !769, size: 64, elements: !820)
!820 = !{!821}
!821 = !DISubrange(count: 8)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "MessageLength", scope: !808, file: !807, line: 29, baseType: !777, size: 64, offset: 128)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !808, file: !807, line: 33, baseType: !824, size: 8, offset: 192)
!824 = !DICompositeType(tag: DW_TAG_array_type, baseType: !769, size: 8, elements: !825)
!825 = !{!826}
!826 = !DISubrange(count: 1)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SMM_LOCK_BOX_PARAMETER_SAVE", file: !829, line: 37, baseType: !830)
!829 = !DIFile(filename: "demo2_edk2/MdeModulePkg/Include/Guid/SmmLockBox.h", directory: "/home/shafi/Research/Repositories/stase-edk2", checksumkind: CSK_MD5, checksum: "9777fd9c488a5be23b3f7075e5468f02")
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !829, line: 32, size: 384, elements: !831)
!831 = !{!832, !839, !840, !842}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "Header", scope: !830, file: !829, line: 33, baseType: !833, size: 128)
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SMM_LOCK_BOX_PARAMETER_HEADER", file: !829, line: 30, baseType: !834)
!834 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !829, line: 26, size: 128, elements: !835)
!835 = !{!836, !837, !838}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "Command", scope: !834, file: !829, line: 27, baseType: !767, size: 32)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "DataLength", scope: !834, file: !829, line: 28, baseType: !767, size: 32, offset: 32)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "ReturnStatus", scope: !834, file: !829, line: 29, baseType: !776, size: 64, offset: 64)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "Guid", scope: !830, file: !829, line: 34, baseType: !812, size: 128, offset: 128)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "Buffer", scope: !830, file: !829, line: 35, baseType: !841, size: 64, offset: 256)
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "PHYSICAL_ADDRESS", file: !790, line: 237, baseType: !776)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !830, file: !829, line: 36, baseType: !776, size: 64, offset: 320)
!843 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_STATUS", file: !775, line: 29, baseType: !789)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SMM_LOCK_BOX_PARAMETER_SET_ATTRIBUTES", file: !829, line: 58, baseType: !846)
!846 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !829, line: 54, size: 320, elements: !847)
!847 = !{!848, !849, !850}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "Header", scope: !846, file: !829, line: 55, baseType: !833, size: 128)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "Guid", scope: !846, file: !829, line: 56, baseType: !812, size: 128, offset: 128)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "Attributes", scope: !846, file: !829, line: 57, baseType: !776, size: 64, offset: 256)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SMM_LOCK_BOX_PARAMETER_UPDATE", file: !829, line: 45, baseType: !853)
!853 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !829, line: 39, size: 448, elements: !854)
!854 = !{!855, !856, !857, !858, !859}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "Header", scope: !853, file: !829, line: 40, baseType: !833, size: 128)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "Guid", scope: !853, file: !829, line: 41, baseType: !812, size: 128, offset: 128)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !853, file: !829, line: 42, baseType: !776, size: 64, offset: 256)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "Buffer", scope: !853, file: !829, line: 43, baseType: !841, size: 64, offset: 320)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !853, file: !829, line: 44, baseType: !776, size: 64, offset: 384)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64)
!861 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SMM_LOCK_BOX_PARAMETER_RESTORE", file: !829, line: 52, baseType: !862)
!862 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !829, line: 47, size: 384, elements: !863)
!863 = !{!864, !865, !866, !867}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "Header", scope: !862, file: !829, line: 48, baseType: !833, size: 128)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "Guid", scope: !862, file: !829, line: 49, baseType: !812, size: 128, offset: 128)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "Buffer", scope: !862, file: !829, line: 50, baseType: !841, size: 64, offset: 256)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !862, file: !829, line: 51, baseType: !776, size: 64, offset: 320)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SMM_LOCK_BOX_PARAMETER_RESTORE_ALL_IN_PLACE", file: !829, line: 62, baseType: !870)
!870 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !829, line: 60, size: 128, elements: !871)
!871 = !{!872}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "Header", scope: !870, file: !829, line: 61, baseType: !833, size: 128)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!874 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DHCP4_PACKET_OPTION", file: !630, line: 44, baseType: !875)
!875 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !630, line: 31, size: 24, elements: !876)
!876 = !{!877, !878, !879}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "OpCode", scope: !875, file: !630, line: 35, baseType: !769, size: 8)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !875, file: !630, line: 39, baseType: !769, size: 8, offset: 8)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !875, file: !630, line: 43, baseType: !824, size: 8, offset: 16)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!881 = !DIDerivedType(tag: DW_TAG_typedef, name: "PXEBC_BOOT_SVR_ENTRY", file: !730, line: 225, baseType: !882)
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !730, line: 221, size: 56, elements: !883)
!883 = !{!884, !885, !886}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !882, file: !730, line: 222, baseType: !763, size: 16)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "IpCnt", scope: !882, file: !730, line: 223, baseType: !769, size: 8, offset: 16)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "IpAddr", scope: !882, file: !730, line: 224, baseType: !887, size: 32, offset: 24)
!887 = !DICompositeType(tag: DW_TAG_array_type, baseType: !888, size: 32, elements: !825)
!888 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IPv4_ADDRESS", file: !775, line: 85, baseType: !889)
!889 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPv4_ADDRESS", file: !790, line: 225, baseType: !890)
!890 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !790, line: 223, size: 32, elements: !891)
!891 = !{!892}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "Addr", scope: !890, file: !790, line: 224, baseType: !893, size: 32)
!893 = !DICompositeType(tag: DW_TAG_array_type, baseType: !769, size: 32, elements: !894)
!894 = !{!895}
!895 = !DISubrange(count: 4)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 64)
!897 = !DIDerivedType(tag: DW_TAG_typedef, name: "PXEBC_BOOT_MENU_ENTRY", file: !730, line: 231, baseType: !898)
!898 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !730, line: 227, size: 32, elements: !899)
!899 = !{!900, !901, !902}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !898, file: !730, line: 228, baseType: !763, size: 16)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "DescLen", scope: !898, file: !730, line: 229, baseType: !769, size: 8, offset: 16)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "DescStr", scope: !898, file: !730, line: 230, baseType: !824, size: 8, offset: 24)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64)
!904 = !DIDerivedType(tag: DW_TAG_typedef, name: "PXEBC_MENU_PROMPT", file: !730, line: 236, baseType: !905)
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !730, line: 233, size: 16, elements: !906)
!906 = !{!907, !908}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "Timeout", scope: !905, file: !730, line: 234, baseType: !769, size: 8)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "Prompt", scope: !905, file: !730, line: 235, baseType: !824, size: 8, offset: 8)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "PXEBC_BOOT_CUSTOM", file: !730, line: 263, baseType: !911)
!911 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !730, line: 257, size: 440, elements: !912)
!912 = !{!913, !914, !932, !933, !934}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "ReplyRequested", scope: !911, file: !730, line: 258, baseType: !773, size: 8)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "ReplyObject", scope: !911, file: !730, line: 259, baseType: !915, size: 64, offset: 8)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!916 = !DIDerivedType(tag: DW_TAG_typedef, name: "NETWORK_OBJECT", file: !730, line: 250, baseType: !917)
!917 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !730, line: 247, size: 192, elements: !918)
!918 = !{!919, !924}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "Header", scope: !917, file: !730, line: 248, baseType: !920, size: 64)
!920 = !DIDerivedType(tag: DW_TAG_typedef, name: "NETWORK_OBJECT_HEADER", file: !730, line: 240, baseType: !921)
!921 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !730, line: 238, size: 64, elements: !922)
!922 = !{!923}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "ReferenceCount", scope: !921, file: !730, line: 239, baseType: !776, size: 64)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "Body", scope: !917, file: !730, line: 249, baseType: !925, size: 128, offset: 64)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "NETWORK_OBJECT_BODY", file: !730, line: 245, baseType: !926)
!926 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !730, line: 242, size: 128, elements: !927)
!927 = !{!928, !929}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "ContentLength", scope: !926, file: !730, line: 243, baseType: !776, size: 64)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "ContentData", scope: !926, file: !730, line: 244, baseType: !930, size: 64, offset: 64)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!931 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHAR16", file: !764, line: 183, baseType: !94)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "TransactionId", scope: !911, file: !730, line: 260, baseType: !767, size: 32, offset: 72)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "LastOperationStatus", scope: !911, file: !730, line: 261, baseType: !843, size: 64, offset: 104)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "NetworkInfo", scope: !911, file: !730, line: 262, baseType: !935, size: 272, offset: 168)
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "NETWORK_DETAILS", file: !730, line: 255, baseType: !936)
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !730, line: 252, size: 272, elements: !937)
!937 = !{!938, !946}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "MacAddress", scope: !936, file: !730, line: 253, baseType: !939, size: 256)
!939 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MAC_ADDRESS", file: !775, line: 97, baseType: !940)
!940 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !775, line: 95, size: 256, elements: !941)
!941 = !{!942}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "Addr", scope: !940, file: !775, line: 96, baseType: !943, size: 256)
!943 = !DICompositeType(tag: DW_TAG_array_type, baseType: !769, size: 256, elements: !944)
!944 = !{!945}
!945 = !DISubrange(count: 32)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "Port", scope: !936, file: !730, line: 254, baseType: !763, size: 16, offset: 256)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64)
!948 = !DIDerivedType(tag: DW_TAG_typedef, name: "PXEBC_DHCP4_OPTION_MESG", file: !730, line: 181, baseType: !949)
!949 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !730, line: 179, size: 8, elements: !950)
!950 = !{!951}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !949, file: !730, line: 180, baseType: !769, size: 8)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64)
!953 = !DIDerivedType(tag: DW_TAG_typedef, name: "PXEBC_DHCP4_OPTION_MAX_MESG_SIZE", file: !730, line: 171, baseType: !954)
!954 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !730, line: 169, size: 16, elements: !955)
!955 = !{!956}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !954, file: !730, line: 170, baseType: !763, size: 16)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64)
!958 = !DIDerivedType(tag: DW_TAG_typedef, name: "PXEBC_DHCP4_OPTION_PARA", file: !730, line: 167, baseType: !959)
!959 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !730, line: 165, size: 1080, elements: !960)
!960 = !{!961}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "ParaList", scope: !959, file: !730, line: 166, baseType: !962, size: 1080)
!962 = !DICompositeType(tag: DW_TAG_array_type, baseType: !769, size: 1080, elements: !963)
!963 = !{!964}
!964 = !DISubrange(count: 135)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = !DIDerivedType(tag: DW_TAG_typedef, name: "PXEBC_DHCP4_OPTION_UUID", file: !730, line: 201, baseType: !967)
!967 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !730, line: 198, size: 136, elements: !968)
!968 = !{!969, !970}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !967, file: !730, line: 199, baseType: !769, size: 8)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "Guid", scope: !967, file: !730, line: 200, baseType: !971, size: 128, offset: 8)
!971 = !DICompositeType(tag: DW_TAG_array_type, baseType: !769, size: 128, elements: !449)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "PXEBC_DHCP4_OPTION_UNDI", file: !730, line: 177, baseType: !975)
!975 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !730, line: 173, size: 24, elements: !976)
!976 = !{!977, !978, !979}
